[
    {
        "id": 19119,
        "difficulty": "Уровень: Базовый",
        "task": "(В. Лашин) В файле содержится последовательность натуральных чисел.\nЕё элементы могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых остаток от деления обоих элементов на 43 равен минимальному элементу последовательности. В ответе запишите количество найденных пар, затем максимальную из абсолютных значений разностей элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\19119_2m0JCq6oIb.txt"
        ],
        "answer": "2"
    },
    {
        "id": 18957,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Бахтиев) В файле содержится последовательность целых чисел.\nЕё элементы могут принимать целые значения от -100 000 до 100 000 включительно. Определите количество троек последовательности, в которых хотя бы два числа из трёх не содержат нулей в своей записи, а сумма тройки меньше половины значения максимального элемента последовательности. В ответе запишите количество найденных троек, затем максимальную из сумм элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\18957_PXuTKXcNAr.txt"
        ],
        "answer": "5072"
    },
    {
        "id": 18932,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Попков) В файле содержится последовательность целых чисел, представляющих значения ледяных кристаллов. Каждое значение может находиться в диапазоне от –10 000 до 10 000 включительно. Вам необходимо выполнить следующие действия:\nОпределите количество кристаллов, значения которых четны, затем найдите пары соседних кристаллов, в которых хотя бы одно значение положительное, а сумма значений пары меньше количества кристаллов с четными значениями. В ответе запишите количество найденных пар, а также максимальную из сумм квадратов элементов таких пар. Под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\18932_8Eky5HvjPo.txt"
        ],
        "answer": "4706"
    },
    {
        "id": 18617,
        "difficulty": "Уровень: Средний",
        "task": "Файл содержит последовательность натуральных чисел, не превышающих 100 000. Назовём парой два идущих подряд элемента последовательности. Определите количество пар, для которых выполняются следующие условия:\n– остаток от деления на 3 хотя бы одного числа из пары равен остатку от деления на 3 максимального элемента всей последовательности;\n– остаток от деления на 7 хотя бы одного числа из пары равен остатку от деления на 7 минимального элемента всей последовательности.\nВ ответе запишите два числа: сначала количество найденных пар, затем максимальную величину суммы элементов этих пар.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\18617_qDBrhUQa70.txt"
        ],
        "answer": "1467"
    },
    {
        "id": 18582,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -100 000 до 100 000 включительно. Определите количество троек элементов последовательности, в которых количество отрицательных чисел больше количества положительных, а сумма элементов тройки оканчивается на ту же цифру, что и минимальный элемент в последовательности. В ответе запишите количество найденных троек чисел, затем максимальное значение из модулей сумм элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\18582_1QwHCTHgE8.txt"
        ],
        "answer": "440"
    },
    {
        "id": 18368,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -100 000 до 100 000 включительно. Определите количество троек элементов последовательности, в которых хотя бы один из трёх элементов является пятизначным числом, а произведение элементов тройки кратно минимальному элементу последовательности, оканчивающемуся на 7. В ответе запишите количество найденных троек чисел, затем максимальное из произведений элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\18368_UK89O2Dn9.txt"
        ],
        "answer": "3"
    },
    {
        "id": 18257,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) В файле содержится последовательность натуральных чисел, которые нумеруются, начиная с единицы. Определите количество пар элементов последовательности, сумма номеров которых оканчивается на ту же цифру, что и максимальный элемент последовательности. В ответе запишите количество найденных пар, затем минимальное значение среди модулей разностей суммы элементов и суммы номеров таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\18257_jNdCTrDOd.txt"
        ],
        "answer": "1000"
    },
    {
        "id": 18176,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Бахтиев) В файле содержится последовательность целых чисел.\nЕё элементы могут принимать целые значения от -100 000 до 100 000 включительно. Определите количество троек последовательности, сумма цифр элементов которых равна минимальному положительному элементу последовательности, оканчивающемуся на 4. В ответе запишите количество найденных троек, затем максимальную из сумм элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\18176_HlsUory0h.txt"
        ],
        "answer": "11"
    },
    {
        "id": 18142,
        "difficulty": "Уровень: Базовый",
        "task": "(В. Колчев) В файле содержится последовательность натуральных чисел.\nЕё элементы могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых остаток от деления только одного из элементов на 16 равен минимальному элементу последовательности, который оканчивается на 8. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\18142_LpSdeR1bC.txt"
        ],
        "answer": "1172"
    },
    {
        "id": 18045,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых сумма последних цифр элементов равна количеству двузначных чисел в последовательности. В ответе запишите количество найденных пар, затем минимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\18045_eXo-lnjN1.txt"
        ],
        "answer": "243"
    },
    {
        "id": 17873,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность натуральных чисел.\nЕё элементы могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых остаток от деления хотя бы одного из элементов на 16 равен минимальному элементу последовательности. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\17873_USdnAoAoK.txt"
        ],
        "answer": "1214"
    },
    {
        "id": 17750,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых сумма остатков от деления элементов на 77 равна минимальному элементу последовательности. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\17750_i88xPC6Qg.txt"
        ],
        "answer": "35"
    },
    {
        "id": 17680,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Её элементы могут принимать целые значения от –100 000 до 100 000 включительно. Определите количество пар последовательности, в которых элементы не равны, а абсолютное значение их разности делится на минимальный положительный элемент последовательности, кратный 41. Гарантируется, что такой элемент в последовательности есть. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\17680_ACUHXOcCq.txt"
        ],
        "answer": "10"
    },
    {
        "id": 17636,
        "difficulty": "Уровень: Средний",
        "task": "В файле содержится последовательность целых чисел. Её элементы по модулю не превышают 100000 включительно. Определите количество троек элементов последовательности, в которых хотя бы один элемент оканчивается на 3 и является трёхзначным числом, а сумма всех элементов меньше максимального элемента последовательности, оканчивающегося на 3 и являющегося трёхзначным числом. В ответе запишите количество найденных троек, затем максимальную из сумм элементов таких троек.\nВ данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\17636_TPT3iXQw0.txt"
        ],
        "answer": "147"
    },
    {
        "id": 17558,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Её элементы могут принимать целые значения от –100 000 до 100 000 включительно. Определите количество пар последовательности, в которых хотя бы одно число отрицательно,  а сумма чисел пары меньше количества чисел последовательности, кратных 32. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\17558_hHTLyzmTi.txt"
        ],
        "answer": "4969"
    },
    {
        "id": 17530,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых остаток от деления на 55 хотя бы одного из элементов равен минимальному элементу последовательности. В ответе запишите количество найденных пар, затем минимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\17530_j0oq5cFeA.txt"
        ],
        "answer": "201"
    },
    {
        "id": 16264,
        "difficulty": "Уровень: Базовый",
        "task": "(Е.Джобс) В файле содержится последовательность натуральных чисел, каждое из которых не превышает 100 000. Определите количество пар элементов последовательности, в которых хотя бы одно число кратно минимальному двузначному значению последовательности, которое кратно сумме своих цифр.\nГарантируется, что в последовательности есть хотя бы одно двузначное число, соответствующее условию. В ответе запишите количество найденных пар чисел, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\16264_330D51JIH.txt"
        ],
        "answer": "537"
    },
    {
        "id": 15333,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых хотя бы одно число больше максимального элемента последовательности, кратного 19. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\15333_RhwTQ79ZJ.txt"
        ],
        "answer": "54"
    },
    {
        "id": 14952,
        "difficulty": "Уровень: Средний",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –100 000 до 100 000 включительно. Определите количество троек элементов последовательности, в которых не более одного из трёх элементов одновременно являются четырёхзначными и чётными числами. А сумма элементов тройки не больше максимального элемента последовательности, оканчивающегося на 121.\nВ ответе запишите количество найденных троек чисел, затем максимальную из сумм элементов таких троек.\nВ данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\14952_bw9CasoRD.txt"
        ],
        "answer": "5211"
    },
    {
        "id": 14652,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Попков) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите и запишите в ответе сначала количество пар элементов последовательности, в которых хотя бы одно число является квадратом натурального числа, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\14652_glrhjbHak.txt"
        ],
        "answer": "164"
    },
    {
        "id": 14260,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -100 000 до 100 000 включительно. Определите количество троек элементов последовательности, в которых все числа являются трёхзначными, а сумма элементов тройки больше минимального положительного элемента последовательности, который является четырёхзначным числом и оканчивается на две одинаковые цифры. В ответе запишите количество найденных троек чисел, затем максимальную из сумм элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\14260_fYYQGkcUp.txt"
        ],
        "answer": "8"
    },
    {
        "id": 14259,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -100 000 до 100 000 включительно. Определите количество троек элементов последовательности, в которых хотя бы одно число делится на свою наибольшую цифру, а произведение элементов тройки не меньше суммы всех элементов последовательности, оканчивающихся на 111. В ответе запишите количество найденных троек чисел, затем минимальное из произведений элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\14259_H5hcAKTmG.txt"
        ],
        "answer": "1673"
    },
    {
        "id": 14258,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -100 000 до 100 000 включительно. Определите количество троек элементов последовательности, в которых все числа состоят из разного количества разрядов, а сумма элементов тройки не меньше максимального элемента последовательности, который является четырёхзначным числом и оканчивается на 22. В ответе запишите количество найденных троек чисел, затем максимальную из сумм элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\14258_crwELXIFD.txt"
        ],
        "answer": "721"
    },
    {
        "id": 14257,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -100 000 до 100 000 включительно. Определите количество троек элементов последовательности, в которых ровно два из трёх элементов оканчиваются на 12, а сумма элементов тройки не больше максимального элемента последовательности, которое является пятизначным числом и оканчивается на 7. В ответе запишите количество найденных троек чисел, затем абсолютное значение минимальной из сумм элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\14257_YUlSzjwv1.txt"
        ],
        "answer": "3"
    },
    {
        "id": 14256,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -100 000 до 100 000 включительно. Определите количество троек последовательности, в которых хотя бы два из трёх чисел имеют нечётную сумму цифр, а сумма элементов тройки не больше максимального элемента последовательности, оканчивающегося на 25. В ответе запишите количество найденных троек чисел, затем максимальную из сумм элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\14256_Rk8e-hZzc.txt"
        ],
        "answer": "3249"
    },
    {
        "id": 14255,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -100 000 до 100 000 включительно. Определите количество пар последовательности, в которых ровно один из элементов оканчивается на 11, а сумма элементов пары не меньше среднего арифметического всех нечётных чисел последовательности. В ответе запишите количество найденных пар чисел, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\14255_9GfztA9zQ.txt"
        ],
        "answer": "56"
    },
    {
        "id": 13882,
        "difficulty": "Уровень: Средний",
        "task": "(М. Шагитов) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 0 до 10 000. Найдите все тройки элементов последовательности, среди которых все числа имеют разную сумму цифр, а сумма чисел тройки больше, чем максимальный элемент последовательности, кратный 401. В ответе запишите количество найденных троек, затем минимальную из сумм элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\13882_UYt1LitWb.txt"
        ],
        "answer": "6283"
    },
    {
        "id": 13858,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -100 000 до 100 000 включительно. Определите количество троек элементов последовательности, в которых хотя бы два из трёх элементов являются четырёхзначными числами, а произведение элементов тройки не больше квадрата минимального элемента последовательности, оканчивающегося на 25. В ответе запишите количество найденных троек чисел, затем максимальное из произведений элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\13858_mIB1b6roP.txt"
        ],
        "answer": "699"
    },
    {
        "id": 13088,
        "difficulty": "Уровень: Средний",
        "task": "Файл содержит последовательность натуральных чисел, не превышающих 100 000. Назовём тройкой три идущих подряд элемента последовательности.\nОпределите количество троек, для которых выполняются следующие условия:\n– ровно два числа в тройке четырёхзначные;\n– хотя бы одно число в тройке делится на 5;\n– сумма элементов тройки больше максимального последовательности, запись которого заканчивается на 17 (Гарантируется, что в последовательности есть хотя бы один элемент, запись которого заканчивается на 17.)\nВ ответе запишите два числа: сначала количество найденных троек, затем максимальную величину суммы элементов этих троек.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\13088_ah3VAKnDG.txt"
        ],
        "answer": "21"
    },
    {
        "id": 12735,
        "difficulty": "Уровень: Средний",
        "task": "(C. Горбачёв) В файле содержится последовательность натуральных чисел, каждое из которых не превышает 100 000. Определите количество троек элементов последовательности, в которых ровно два из трёх элементов кратны 7, а сумма элементов тройки меньше максимального элемента последовательности, оканчивающегося на 09.\nГарантируется, что в последовательности есть хотя бы одно число, оканчивающееся на 09. В ответе запишите количество найденных троек чисел, затем минимальное из произведений элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\12735_odyMPAOdp.txt"
        ],
        "answer": "300"
    },
    {
        "id": 12471,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность натуральных чисел, каждое из которых не превышает 100 000.\nОпределите количество троек элементов последовательности, в которых все три элемента являются чётными числами или в которых есть хотя бы одно двузначное число. А также сумма элементов тройки не больше максимального элемента последовательности, оканчивающегося на 13. Гарантируется, что в последовательности есть хотя бы одно число, оканчивающееся на 13.\nВ ответе запишите количество найденных троек чисел, затем целую часть среднего арифметического сумм из элементов таких троек.\nВ данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.\nДля такого файла\n10\n10\n10\n20\nОтветом будут числа: 2 35.\nЦелая часть среднего арифметического сумм из элементов подходящих троек это: ((10+10+10) + (10+10+20)) / 2 = 35.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\12471_e4lX6mhLk.txt"
        ],
        "answer": "4007"
    },
    {
        "id": 12450,
        "difficulty": "Уровень: Базовый",
        "task": "(Д. Иванов) В файле содержится последовательность натуральных чисел. Элементы последовательности могут  принимать целые значения от 1 до 100 000 включительно. Определите количество троек элементов последовательности, в которых сумма остатков от деления элементов на 113 равна минимальному элементу последовательности, кратному 52. В ответе запишите количество найденных троек, затем максимальную из сумм элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\12450_8ttQBOodd.txt"
        ],
        "answer": "7"
    },
    {
        "id": 12249,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от —100 000 до 100 000 включительно. Определите количество троек элементов последовательности, в которых хотя бы один из трёх элементов оканчивается на 3, а сумма элементов тройки не больше максимального элемента последовательности, являющегося пятизначным числом, которое оканчивается на 3. В ответе запишите количество найденных троек чисел, затем максимальную из сумм элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\12249_yUJ1meZIf.txt"
        ],
        "answer": "1767"
    },
    {
        "id": 12106,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Попков) На Северном полюсе Дед Мороз распределяет подарки для доставки детям по всей стране. У него есть специальный файл, в котором содержится последовательность целых чисел от -10 000 до 10 000. Помогите Деду Морозу определить количество пар элементов последовательности, в которых ровно один элемент отрицательный, а сумма элементов пары делится на минимальный положительный элемент последовательности, кратный 117.\nГарантируется, что в последовательности есть хотя бы одно положительное число, кратное 117. В ответе запишите количество найденных пар чисел, затем минимальную из сумм квадратов элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\12106_ncpIJFhBa.txt"
        ],
        "answer": "13"
    },
    {
        "id": 11949,
        "difficulty": "Уровень: Средний",
        "task": "(PRO100 ЕГЭ) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –100 000 до 100 000 включительно. Определите количество четвёрок элементов последовательности, в которых или только одно из чисел или все четыре числа являются двузначным, а сумма элементов четвёрки не меньше максимального элемента последовательности, оканчивающегося на 68.\nВ ответе запишите количество найденных четвёрок чисел, затем максимальную из сумм элементов таких четвёрок.\nВ данной задаче под четвёркой подразумевается четыре идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\11949_43A-S7SeT.txt"
        ],
        "answer": "75"
    },
    {
        "id": 11838,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -100 000 до 100 000 включительно. Определите количество троек элементов последовательности, в которых все числа различны и являются пятизначными, а сумма элементов тройки не больше максимального элемента последовательности, оканчивающегося на 50. В ответе запишите количество найденных троек чисел, затем максимальную из сумм элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\11838_mcqj68LqZ.txt"
        ],
        "answer": "72"
    },
    {
        "id": 11703,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -100 000 до 100 000 включительно. Определите количество троек элементов последовательности, в которых хотя бы один из трёх элементов является пятизначным числом, а произведение элементов тройки кратно максимальному элементу последовательности, оканчивающемуся на 18. В ответе запишите количество найденных троек чисел, затем максимальное из произведений элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\11703_cLy_iakID.txt"
        ],
        "answer": "7"
    },
    {
        "id": 11481,
        "difficulty": "Уровень: Базовый",
        "task": "(PRO100 ЕГЭ) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –100 000 до 100 000 включительно. Определите количество троек элементов последовательности, среди которых есть не более одного числа, начинающегося с цифры 6, а сумма элементов тройки не меньше максимального элемента последовательности, начинающегося с цифры 8. В ответе запишите количество найденных троек чисел, затем минимальную из сумм элементов таких троек.\nВ данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.\nПримечание: Числа 6868, -6868 начинаются с цифры 6.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\11481_00wqTgKCg.txt"
        ],
        "answer": "186"
    },
    {
        "id": 11236,
        "difficulty": "Уровень: Средний",
        "task": "(М. Ишимов) В файле содержится последовательность целых чисел, каждое из которых по модулю не превышает 100 000. Определите количество троек элементов последовательности, в которых ровно два из трёх элементов больше квадрата минимального двузначного элемента последовательности, а произведение модулей элементов тройки кратно максимальному четырёхзначному элементу последовательности, который оканчивается на 1. Гарантируется, что в последовательности есть хотя бы одно четырёхзначное число, которое оканчивается на 1. В ответе запишите количество найденных троек чисел, затем максимальную из сумм модулей элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\11236_wwuieqZlj.txt"
        ],
        "answer": "1"
    },
    {
        "id": 10771,
        "difficulty": "Уровень: Средний",
        "task": "(Н. Сафронов) В файле содержится последовательность целых неотрицательных чисел, не превышающих 10000. Определите количество троек элементов последовательности, в которых каждое число содержит цифру 3 в десятичной записи, а сумма элементов такой тройки является простым числом. В ответе запишите два числа: сначала количество найденных троек, затем минимальную сумму элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\10771_tNL2g6XxX.txt"
        ],
        "answer": "13"
    },
    {
        "id": 10719,
        "difficulty": "Уровень: Базовый",
        "task": "(PRO100 ЕГЭ) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -10 000 до 10 000 включительно. Определите количество пар последовательности, в которых только одно число оканчивается на 13.\nВ ответе запишите количество найденных пар чисел, затем максимальную из сумм элементов таких пар.\nВ данной задаче под парой подразумевается два элемента последовательности у которых разница в индексах равна трём.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\10719_xd_aCdd9N.txt"
        ],
        "answer": "90"
    },
    {
        "id": 10100,
        "difficulty": "Уровень: Средний",
        "task": "В файле содержится последовательность натуральных чисел, каждое из которых не превышает 100 000. Определите количество троек элементов последовательности, в которых ровно два из трёх элементов являются трёхзначными числами, а сумма элементов тройки не больше максимального элемента последовательности, оканчивающегося на 13.\nГарантируется, что в последовательности есть хотя бы одно число, оканчивающееся на 13. В ответе запишите количество найденных троек чисел, затем максимальную из сумм элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\10100_-llbR1Vrr.txt"
        ],
        "answer": "959"
    },
    {
        "id": 10004,
        "difficulty": "Уровень: Средний",
        "task": "(С. Чайкин) В файле содержится закольцованная последовательность целых чисел, по модулю не превышающих 100 000. Определите количество троек элементов последовательности, в которых только одно число не является четырехзначными, а сумма элементов тройки является полным квадратом. В ответе запишите два числа: сначала количество найденных троек, затем минимальную из сумм элементов таких троек. В данной задаче под тройкой подразумевается три различных элемента последовательности, находящихся на равном друг от друга расстоянии.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\10004_F6FacKc9A.txt"
        ],
        "answer": "31"
    },
    {
        "id": 9840,
        "difficulty": "Уровень: Средний",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -100 000 до 100 000 включительно. Определите количество пар последовательности, в которых только один из элементов является четырёхзначным числом, а квадрат суммы элементов пары не больше квадрата максимального элемента последовательности, являющегося четырёхзначным числом и оканчивающегося на 39. В ответе запишите количество найденных пар чисел, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\9840_gHQ7ncvzh.txt"
        ],
        "answer": "1591"
    },
    {
        "id": 9786,
        "difficulty": "Уровень: Средний",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые — значения\nот -100 000 до 100 000 включительно. Определите количество троек элементов последовательности, в которых не более двух из трёх\nэлементов являются четырёхзначными числами, а сумма элементов тройки не больше максимального элемента последовательности, оканчивающегося на 25. В ответе запишите количество найденных троек чисел, затем максимальную из сумм элементов таких троек.\nВ данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\9786_hzcnDzBAJ.txt"
        ],
        "answer": "6315"
    },
    {
        "id": 9748,
        "difficulty": "Уровень: Средний",
        "task": "В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество троек последовательности, в которых только одно из чисел является четырёхзначным, а сумма элементов тройки не меньше максимального элемента последовательности, оканчивающегося на 15. В ответе запишите количество найденных троек, затем максимальную из сумм элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\9748_AnApm30PR.txt"
        ],
        "answer": "299"
    },
    {
        "id": 9704,
        "difficulty": "Уровень: Средний",
        "task": "(А.Богданов) В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество элементов последовательности больших любой суммы пары элементов, в которой только одно число двухзначное. В ответе запишите количество найденных элементов, затем минимальный из них. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\9704_AAdQV7C1N.txt"
        ],
        "answer": "661"
    },
    {
        "id": 9547,
        "difficulty": "Уровень: Средний",
        "task": "В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 10 000 включительно. Определите количество пар последовательности, в которых только одно число имеет отличное от 3 количество разрядов, а элементы пары отличаются на значение, кратное минимальному трехзначному значению в последовательности, оканчивающемуся на 11. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\9547_Y_IkZSJgi.txt"
        ],
        "answer": "8"
    },
    {
        "id": 9372,
        "difficulty": "Уровень: Средний",
        "task": "В файле содержится последовательность целых чисел по модулю не превосходящих 10000. Определите количество пар последовательности, в которых хотя бы одно число трехзначное, а сумма элементов в таких парах больше максимального абсолютного значения, кратного 1001. В ответе запишите количество найденных пар, затем минимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\9372_IT2x-bvs6.txt"
        ],
        "answer": "101"
    },
    {
        "id": 9164,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 10 000 включительно. Определите количество пар последовательности, сумма элементов которой больше максимального кратного 17 числа в последовательности.\nВ ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности..",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\9164_asTykf-0_.txt"
        ],
        "answer": "5104"
    },
    {
        "id": 8954,
        "difficulty": "Уровень: Базовый",
        "task": "(Е. Джобс) В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 10 000 включительно. Определите количество пар последовательности, в которых только одно число кратно 7, а сумма элементов пары кратна максимальному элементу последовательности, оканчивающемуся на 0F в шестнадцатеричной системе счисления. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\8954_7vn6Za1UG.txt"
        ],
        "answer": "2"
    },
    {
        "id": 8682,
        "difficulty": "Уровень: Средний",
        "task": "(М. Шагитов)  В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 500 000 включительно. Определите количество пар последовательности, в которых только один из элементов является трехзначным числом, а сумма элементов пары кратна максимальному трехзначному элементу последовательности. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\8682_q1_dAE1p8.txt"
        ],
        "answer": "502"
    },
    {
        "id": 8681,
        "difficulty": "Уровень: Средний",
        "task": "(М. Шагитов)  В файле записана последовательность натуральных чисел. Числа в последовательности могут принимать значения от 1 до 500 000 включительно. Найдите количество пар элементов последовательности, где хотя бы одно число - четырехзначное, и произведение чисел в паре делится на наименьшее четырехзначное число последовательности, оканчивающееся на 7. В ответе укажите количество найденных пар, а затем максимальное из произведений элементов таких пар. В этой задаче под парой понимаются два соседних числа в последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\8681_RXCK_MkKt.txt"
        ],
        "answer": "37"
    },
    {
        "id": 8611,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 10 000 включительно. Определите количество пар последовательности, в которых только одно число является трёхзначным, а произведение элементов пары кратно максимальному трёхзначному элементу последовательности. В ответе запишите количество найденных пар, затем минимальное из произведений элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\8611_5HaMk15rS.txt"
        ],
        "answer": "2"
    },
    {
        "id": 8562,
        "difficulty": "Уровень: Средний",
        "task": "(В. Рыбальченко)В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -10 000 до 10 000 включительно.\nОпределите количество пар элементов, в которых только 1 число в квадрате меньше, чем квадрат минимального двухзначного числа в последовательности, оканчивающееся на 1, а сумма пары неотрицательное число. В ответе запишите два числа: сначала количество найденных пар, затем минимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\8562_e0vUNzplF.txt"
        ],
        "answer": "157"
    },
    {
        "id": 8504,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых хотя бы один из элементов является трёхзначным числом, а сумма элементов пары кратна минимальному трёхзначному элементу последовательности, оканчивающемуся на 5. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\8504_Or0AQles5.txt"
        ],
        "answer": "13"
    },
    {
        "id": 8475,
        "difficulty": "Уровень: Средний",
        "task": "(В. Рыбальченко) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -10 000 до 10 000 включительно.\nОпределите количество троек элементов, в которых только 2 числа в квадрате больше, чем квадрат минимального трехзначного числа в последовательности, оканчивающееся на 8, а также в тройке есть хотя бы одно трехзначное число. В ответе запишите два числа: сначала количество найденных троек, затем максимальную из сумм элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\8475_7y5CujBQB.txt"
        ],
        "answer": "5312"
    },
    {
        "id": 8427,
        "difficulty": "Уровень: Средний",
        "task": "Файл содержит последовательность натуральных чисел, не превышающих 20 000. Назовём парой два идущих подряд элемента последовательности. Определите количество пар, для которых выполняются следующие условия:\n– ровно одно число в паре четырёхзначное;\n– сумма квадратов элементов пары без остатка делится на наименьшее в последовательности трёхзначное число, запись которого заканчивается цифрой 3.\nВ ответе запишите два числа: сначала количество найденных пар, затем максимальную из сумм квадратов элементов таких пар.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\8427_qrsq2WBVI.txt"
        ],
        "answer": "74"
    },
    {
        "id": 8264,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Шагитов) Дана последовательность целых чисел, записанная в файле и содержащая целые числа в диапазоне от -10000 до 10000. Необходимо определить количество пар соседних чисел, где только одно из чисел отрицательно, а их сумма положительна и делится на наименьшее по модулю число в последовательности без остатка. В качестве ответа требуется указать число таких пар и максимальную сумму элементов среди них.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\8264_4MRJySqR-.txt"
        ],
        "answer": "2520"
    },
    {
        "id": 8161,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Рогов) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -10 000 до 10 000 включительно. Определите количество пар последовательности, в которых только одно число является трехзначным, а сумма элементов пары не превышает максимальный трехзначный элемент последовательности. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\8161_zkQmiRSmd.txt"
        ],
        "answer": "458"
    },
    {
        "id": 8007,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 10 000 включительно. Определите количество пар последовательности, в которых только одно число заканчивается на 10, а сумма элементов пары меньше суммы цифр всех чисел в файле. В ответе запишите количество найденных пар, затем минимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\8007_N9M5c5Ucu.txt"
        ],
        "answer": "19"
    },
    {
        "id": 7819,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Ишимов) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –100 000 до 100 000 включительно. Определите количество пар последовательности, в которых хотя бы одно число является трёхзначным неотрицательным, а сумма элементов пары кратна максимальному двухзначному элементу последовательности. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\7819_eeW8RghMn.txt"
        ],
        "answer": "11"
    },
    {
        "id": 7718,
        "difficulty": "Уровень: Средний",
        "task": "(Грачев Н.) В файле содержится последовательность целых неотрицательных чисел, не превышающих 10000. Определите количество пар элементов последовательности, в которых либо сумма элементов кратна 18, либо произведение элементов кратно 18. В ответе запишите два числа: сначала количество найденных пар, затем максимальную сумму элементов этих пар. В данной задаче под парой подразумевается два различных элемента последовательности.",
        "images": [],
        "files": [],
        "answer": "120400"
    },
    {
        "id": 7716,
        "difficulty": "Уровень: Средний",
        "task": "(Н. Сафронов) В файле содержится последовательность целых неотрицательных чисел, не превышающих 10000. Определите количество пар элементов последовательности, в которых запись хотя бы одного элемента из двух состоит только из четных цифр, а сумма текущей пары больше максимального элемента последовательности, состоящего только из нечетных цифр. В ответе запишите два числа: сначала количество найденных пар, затем максимальную сумму элементов этих пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\7716_0bv-JV07p.txt"
        ],
        "answer": "56"
    },
    {
        "id": 7682,
        "difficulty": "Уровень: Средний",
        "task": "(В. Рыбальченко) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -10 000 до 10 000 включительно.\nСначала определите количество четверок элементов последовательности, в которой их среднее значение больше абсолютного значения максимального по модулю числа последовательности, кратного 570. Затем определите количество троек, где есть хотя бы 2 положительных числа, а сумма чисел тройки кратна 34. Запишите в ответе сначала количество четверок, а затем количество троек.\nВ данной задаче под четверкой или тройкой подразумевается идущие подряд элементы последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\7682_T8PQ_aU2q.txt"
        ],
        "answer": "7"
    },
    {
        "id": 7619,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 10 000 включительно. Определите количество пар последовательности, в которых только одно число является двухзначным, а сумма элементов пары кратна максимальному двухзначному элементу последовательности. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\7619_bLdMiRLC1.txt"
        ],
        "answer": "1"
    },
    {
        "id": 7596,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых только одно число трехзначное, и сумма элементов пары кратна минимальному трехзначному значению последовательности, оканчивающемуся на 5. В ответе запишите два числа: сначала количество найденных пар, затем минимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\7596_oDvU4U7A-.txt"
        ],
        "answer": "2"
    },
    {
        "id": 7267,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых остаток от деления хотя бы одного из элементов на 117 равен минимальному элементу последовательности. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\7267_1qSVAgaUd.txt"
        ],
        "answer": "175"
    },
    {
        "id": 7089,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых остаток от деления хотя бы одного из элементов на 111 равен минимальному элементу последовательности. В ответе запишите количество найденных пар, затем минимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\7089_XQZi87Zkv.txt"
        ],
        "answer": "185"
    },
    {
        "id": 7038,
        "difficulty": "Уровень: Средний",
        "task": "(А.Богданов) В файле содержится последовательность целых чисел, по модулю не превышающих 10000. Определите количество пар, для которых выполняются следующие условия:\n– только один из элементов пары заканчивается на 1;\n– оба элемента пары меньше максимального среднего значения пары среди всех пар отвечающих предыдущему условию.\nВ ответе запишите два числа: сначала количество пар отвечающих двум условиям, затем максимальный элемент из пар, включающих минимальный элемент таких пар. В задаче рассматриваются пары соседних элементов.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\7038_0nfvRAwyC.txt"
        ],
        "answer": "1971"
    },
    {
        "id": 7020,
        "difficulty": "Уровень: Базовый",
        "task": "(М.Шагитов) В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от -100000 до 100000 включительно. Определите количество четверок последовательности, в которых остаток от деления ни одного из модулей чисел четверки на 111 не равен минимальному положительному элементу последовательности. В ответе запишите количество найденных четверок, затем минимальную из сумм элементов таких четверок. В данной задаче под четверкой подразумевается четыре идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\7020_ODuc8Je1-.txt"
        ],
        "answer": "6335"
    },
    {
        "id": 7007,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от —1000 до 1000 включительно. Определите количество пар последовательности, в которых совпадают последние цифры, а сумма модулей чисел пары не больше максимального числа в последовательности, оканчивающегося на 54. В ответе запишите количество найденных пар, затем - максимальное число в паре среди всех таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\7007_Dm0oNnyHF.txt"
        ],
        "answer": "173"
    },
    {
        "id": 6902,
        "difficulty": "Уровень: Базовый",
        "task": "(М.Шагитов) ﻿﻿﻿﻿В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от —100 000 до 100 000 включительно. Определите количество пар последовательности, в которых ровно одно число отрицательно, а сумма чисел пары меньше количества чисел в последовательности, делящихся на 5. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\6902_1EOtY_luD.txt"
        ],
        "answer": "2759"
    },
    {
        "id": 6791,
        "difficulty": "Уровень: Средний",
        "task": "(PRO100 ЕГЭ) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите количество пар последовательности, в которых только одно число оканчивается на 68, а сумма квадратов элементов пары не меньше квадрата минимального элемента последовательности, оканчивающегося на 68. В ответе запишите два числа: сначала количество найденных пар, затем максимальную из сумм квадратов элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\6791_GzfHODPqU.txt"
        ],
        "answer": "26"
    },
    {
        "id": 6752,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от —100 000 до 100 000 включительно. Определите количество пар последовательности, в которых хотя бы одно число отрицательно, а сумма чисел пары меньше количества чисел в последовательности, делящихся на 3. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\6752_bi5JChbya.txt"
        ],
        "answer": "5128"
    },
    {
        "id": 6696,
        "difficulty": "Уровень: Базовый",
        "task": "(Д. Статный) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -100 000 до 100 000 включительно. Найдите такие тройки элементов, сумма которых кратна 2022 и хотя бы одно из чисел неотрицательно. В ответ запишите сначала количество таких троек, а затем – максимальную сумму элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\6696_tmwSyKRT6.txt"
        ],
        "answer": "7"
    },
    {
        "id": 6605,
        "difficulty": "Уровень: Средний",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно.\nОпределите количество пар последовательности, в которых только одно число оканчивается на 5, а модуль разности квадратов элементов пары не больше квадрата максимального элемента последовательности, оканчивающегося на 5.\nВ ответе запишите два числа: сначала количество найденных пар, затем максимальную из модулей разностей квадратов элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\6605_EDx6h5bi-.txt"
        ],
        "answer": "938"
    },
    {
        "id": 6360,
        "difficulty": "Уровень: Средний",
        "task": "Файл содержит последовательность целых чисел, по модулю не превышающих 10 000. Назовём парой два идущих подряд элемента последовательности.\nОпределите количество пар, для которых выполняются следующие условия:\n– запись элементов пары заканчивается одной и той же цифрой;\n– ровно один элемент из пары делится без остатка на 7;\n– сумма квадратов элементов пары не превышает квадрат наименьшего из элементов последовательности, запись которых заканчивается цифрой 7.\nВ ответе запишите два числа: сначала количество найденных пар, затем максимальную величину суммы квадратов элементов этих пар.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\6360_80V19x8cX.txt"
        ],
        "answer": "102"
    },
    {
        "id": 6354,
        "difficulty": "Уровень: Средний",
        "task": "(П. Волгин) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать значения от -10 000 до 10 000 включительно. Определите количество пар элементов последовательности, в которой хотя бы одно число отрицательное, и хотя бы одно число четное, а куб суммы элементов пары больше максимального элемента, кратного 4, но не оканчивающегося на 2, 4, 6. В ответе запишите сначала количество найденных пар, а затем куб минимальной суммы элементов таких пар.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\6354_TywAP6y_1.txt"
        ],
        "answer": "80"
    },
    {
        "id": 6353,
        "difficulty": "Уровень: Средний",
        "task": "(П. Волгин) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать значения от -10 000 до 10 000 включительно. Определите количество троек элементов последовательности, в которой хотя бы одно число делится 118 и хотя бы одно число оканчивается 118, а сумма элементов тройки больше максимального элемента, кратного 118, но не оканчивающего на 8. В ответе запишите сначала количество найденных троек, а затем квадрат максимальной суммы элементов таких троек.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\6353_l-mvVYTPS.txt"
        ],
        "answer": "22"
    },
    {
        "id": 6270,
        "difficulty": "Уровень: Средний",
        "task": "(А.Богданов) В файле содержится последовательность целых чисел по модулю менее 10000.\n   а) рассматриваются только пары в которых строго одно число оканчивается на 7.\n   б) квадрат разности элементов пары меньше модуля разности квадратов элементов хотя бы одной пары, отвечающей условию а.\n В ответе запишите два числа: сначала количество найденных пар, затем минимальный квадрат разности. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\6270_F0qM9SQv3.txt"
        ],
        "answer": "678"
    },
    {
        "id": 6198,
        "difficulty": "Уровень: Средний",
        "task": "(Т. Коняев) В файле содержится последовательность натуральных чисел, каждое из которых не превышает 100000. Назовём тройкой чисел три идущих подряд элемента последовательности. Необходимо определить количество троек, НОК которых является простым числом. Гарантируется, что такие тройки имеются в файле. В качестве ответа укажите сначала количество таких троек, а затем наименьший НОД элементов таких троек. НОД - наибольший общий делитель; НОК - наименьшее общее кратное. Простое число - число, которое имеет только два натуральных делителя, т.е. делится только на себя и на единицу.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\6198_BjHC5Cdkm.txt"
        ],
        "answer": "8"
    },
    {
        "id": 6089,
        "difficulty": "Уровень: Средний",
        "task": "(А. Рогов) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать значения от -10 000 до 10 000 включительно. Определите количество элементов последовательности, которые делятся на 3, не делятся на 7 и 17, а так же являются делителем максимального элемента последовательности, оканчивающегося на 2. В ответе запишите количество найденных чисел, затем максимальное найденное число.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\6089_OBvIIa_xN.txt"
        ],
        "answer": "11"
    },
    {
        "id": 6059,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Игнатюк) В файле представлена последовательность чисел от 0 от 10000 включительно. Необходимо определить количество пар, где имеется два четных натуральных числа с наибольшим общими делителем, превышающим число 100, и указать наибольшую возможную разность между числами в паре. Известно, что парой принято называть два стоящих подряд числа.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\6059_ztWdk3xW5.txt"
        ],
        "answer": "25"
    },
    {
        "id": 6049,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –100 000 до 100 000 включительно. Определите количество пар последовательности, в которых только один из элементов оканчивается на 9, а сумма квадратов элементов пары меньше квадрата максимального элемента последовательности, оканчивающегося на 9. В ответе запишите количество найденных пар, затем минимальную из сумм квадратов элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\6049_X8cRCnEwR.txt"
        ],
        "answer": "1428"
    },
    {
        "id": 6024,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых только один из элементов оканчивается на 12, а квадрат суммы элементов пары меньше квадрата максимального элемента последовательности, оканчивающегося на 12. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\6024_6drmy5m9C.txt"
        ],
        "answer": "114"
    },
    {
        "id": 5916,
        "difficulty": "Уровень: Средний",
        "task": "(А. Игнатюк) В текстовом файле представлен набор чисел от 0 до 10000 включительно. Необходимо найти количество пар чисел, где одно число состоит только из четных цифр, а другое только из нечетных. Известно, что парой принято называть два стоящих подряд элемента последовательности. В качестве ответа укажите количество подходящих пар и наибольшую среди всех их сумм.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\5916_SvdIUcN0N.txt"
        ],
        "answer": "92"
    },
    {
        "id": 5672,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Ишимов) В файле содержится последовательность неотрицательных целых чисел. Элементы последовательности могут принимать целые значения от 1 до 10 000 включительно. Определите количество пар последовательности, в которых оба числа не меньше всех чисел последовательности, которые кратны 73. Гарантируется, что такой элемент в последовательности есть. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\5672_Kpqv2sS5I.txt"
        ],
        "answer": "161"
    },
    {
        "id": 5635,
        "difficulty": "Уровень: Средний",
        "task": "(М. Ишимов) В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от -100 000 до 100 000 включительно. Определите количество пар последовательности, в которых нет чисел, не превосходящих абсолютного значения суммы максимального и минимального из чисел последовательности, оканчивающихся на 31. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\5635_r6_aHSljO.txt"
        ],
        "answer": "966"
    },
    {
        "id": 5491,
        "difficulty": "Уровень: Средний",
        "task": "Файл содержит последовательность целых чисел, по модулю не превышающих 10 000. Назовём парой два идущих подряд элемента последовательности. Определите количество таких пар, в которых запись меньшего элемента заканчивается цифрой 3, а сумма квадратов элементов пары меньше, чем квадрат наименьшего из элементов последовательности, запись которых заканчивается цифрой 3. В ответе запишите два числа: сначала количество найденных пар, затем максимальную сумму квадратов элементов этих пар.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\5491_jNXqEZAvP.txt"
        ],
        "answer": "355"
    },
    {
        "id": 5439,
        "difficulty": "Уровень: Средний",
        "task": "В файле представлена последовательность целых положительных чисел, не превышающих 10000. Симметричной парой называется такая пара чисел в заданной последовательности, элементы которой расположены на равном расстоянии от концов последовательности. Например, в последовательности 1 2 3 4 3 5 1 симметричными парами назовем пары (1, 1), (2, 5), (3, 3). Число 4 не образует пару, так как оно находится на равном удалении от краев, следовательно, это одно число, а не два.\n\nНайдите количество симметричных пар таких, что среднее арифметическое максимального и минимального значений последовательности строго меньше значения одного элемента пары и строго больше значения второго элемента пары.\n\nВ качестве ответы введите количество найденных пар и максимальную суммы элементов среди найденных пар.\n\nДля выполнения этого задания можно написать программу или воспользоваться редактором электронных таблиц.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\5439_p3ynp5GsV.txt"
        ],
        "answer": "2120"
    },
    {
        "id": 5292,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Рогов) В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых только для одного числа выполняется условие: остаток от деления числа на 2023 не меньше минимального элемента последовательности, кратного 123. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\5292_NZT18gvQj.txt"
        ],
        "answer": "4372"
    },
    {
        "id": 5134,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Рогов) В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых произведение остатков от деления обоих элементов на 2023 не меньше максимального элемента последовательности, оканчивающегося на 10. В ответе запишите количество найденных пар, затем минимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\5134_Unxw28f7a.txt"
        ],
        "answer": "8897"
    },
    {
        "id": 4705,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите количество пар последовательности, в которых только одно число оканчивается на 3, а сумма квадратов элементов пары не меньше квадрата максимального элемента последовательности, оканчивающегося на 3. В ответе запишите два числа: сначала количество найденных пар, затем максимальную из сумм квадратов элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\4705_8QlTUIh3y.txt"
        ],
        "answer": "180"
    },
    {
        "id": 4677,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -100 000 до 100 000 включительно. Определите количество пар последовательности, в которых хотя бы один элемент отрицательный и сумма элементов меньше количества чисел в последовательности, кратных 100. Гарантируется, что такой элемент в последовательности  есть. В ответе запишите количество найденных пар, затем абсолютное значение максимальной из сумм элементов таких пар. В данной задаче под парой подразумевается два подряд идущих элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\4677_yBtrg4G9L.txt"
        ],
        "answer": "4963"
    },
    {
        "id": 4622,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность чисел. Элементы последовательности могут принимать целые значения от -100 000 до 100 000 включительно. Определите количество пар последовательности, в которых сумма элементов меньше минимального положительного элемента последовательности, кратного 19. Гарантируется, что такой элемент в последовательности есть. В ответе запишите количество найденных пар, затем абсолютное значение максимальной из сумм элементов таких пар. В данной задаче под парой подразумевается два подряд идущих элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\4622_5fSwIeTVo.txt"
        ],
        "answer": "4984"
    },
    {
        "id": 4597,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых остаток от деления хотя бы одного из элементов на 117 равен минимальному элементу последовательности. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\4597_X2-8sfFqD.txt"
        ],
        "answer": "175"
    },
    {
        "id": 4542,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Богданов) В файле содержится последовательность целых чисел, не превышающих 1000. Определите количество пар последовательности, в которых только одно число находится между значениями минимального кратного 37 и максимального кратного 73. Гарантируется, что такая пара в последовательности есть.\n\nВ ответе запишите количество найденных пар и минимальную сумму элементов среди таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\4542_-fC8xjzgu.txt"
        ],
        "answer": "136"
    },
    {
        "id": 4474,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых сумма чисел четна, а разница между числами кратна минимальному числу, кратному 103. Гарантируется, что элемент, кратный 103, в последовательности есть.\n\nВ ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\4474_5vHrLTBVX.txt"
        ],
        "answer": "4"
    },
    {
        "id": 4417,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность из 10 000 целых положительных чисел. Каждое число не превышает  10 000.  Определите и запишите в ответе сначала количество пар элементов последовательности, у которых сумма элементов кратна 120, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два различных элемента последовательности. Порядок элементов в паре не важен.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\4417_yPgjhkOFi.txt"
        ],
        "answer": "414830"
    },
    {
        "id": 4416,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность из 10 000 целых положительных чисел. Каждое число не превышает  10 000.  Определите и запишите в ответе сначала количество пар элементов последовательности, у которых сумма элементов кратна 60 и хотя бы один элемент из пары делится на 40, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два различных элемента последовательности. Порядок элементов в паре не важен.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\4416_nT8xzM79i.txt"
        ],
        "answer": "29278"
    },
    {
        "id": 4415,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность из 10 000 целых положительных чисел. Каждое число не превышает  10 000.  Определите и запишите в ответе сначала количество пар элементов последовательности, у которых разность элементов кратна 60, затем максимальную из разностей элементов таких пар. В данной задаче под парой подразумевается два различных элемента последовательности. Порядок элементов в паре не важен.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\4415_IR18pKvkH.txt"
        ],
        "answer": "832722"
    },
    {
        "id": 4414,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность из 10 000 целых положительных чисел. Каждое число не превышает  10 000.  Определите и запишите в ответе сначала количество пар элементов последовательности, у которых разность элементов кратна 36 и хотя бы один из элементов кратен 13, затем максимальную из разностей элементов таких пар. В данной задаче под парой подразумевается два различных элемента последовательности. Порядок элементов в паре не важен.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\4414_TDzTf_T0y.txt"
        ],
        "answer": "212587"
    },
    {
        "id": 4368,
        "difficulty": "Уровень: Базовый",
        "task": "(И. Кушнир) В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых хотя бы одно число делится на максимальный элемент последовательности, кратный 37, а сумма элементов пары при делении на максимальный элемент последовательности, кратный 37 дает в остатке число большее 30. Гарантируется, что такой элемент в последовательности есть. В ответе запишите количество найденных пар, затем среди таких пар определите пару с минимальной суммой элементов.\nВ данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\4368_c5ZyxTHdH.txt"
        ],
        "answer": "2"
    },
    {
        "id": 4367,
        "difficulty": "Уровень: Базовый",
        "task": "(И. Кушнир) В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых оба числа делятся на минимальный элемент последовательности, кратный 8, но не равный 8. Гарантируется, что такой элемент в последовательности есть. В ответе запишите количество найденных пар, затем среди таких пар определите пару с минимальной суммой элементов и запишите максимальное из чисел в ней (если пар с минимальной суммой элементов несколько, то в ответ следует выбрать максимальное число из первой пары).\nВ данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\4367_2TcxVvUjT.txt"
        ],
        "answer": "3"
    },
    {
        "id": 4365,
        "difficulty": "Уровень: Средний",
        "task": "(И. Кушнир) В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых либо сумма чисел кратна минимальному числу в последовательности, кратному 43, либо хотя бы в одном из чисел совпадает последняя цифра с последней цифрой в минимальном числе в последовательности, кратным 43. Гарантируется, что такой элемент в последовательности есть. В ответе запишите количество найденных пар, затем максимальное из чисел, которые являются элементами таких пар.\nВ данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\4365_8Z5DkxyUo.txt"
        ],
        "answer": "1895"
    },
    {
        "id": 4267,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 1 до 1000 включительно. Определите количество пар последовательности, в которых хотя бы одно число превышает максимальное число последовательности, кратное 22. В ответе запишите количество найденных пар, затем минимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.\nНайденные числа запишите через пробел.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\4267_U7aC4Q-ah.txt"
        ],
        "answer": "58"
    },
    {
        "id": 4198,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых хотя бы одно число делится на минимальный элемент последовательности, кратный 21. Гарантируется, что такой элемент в последовательности есть.\nВ ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\4198_jqQZaIW3s.txt"
        ],
        "answer": "126"
    },
    {
        "id": 4108,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых хотя бы одно из чисел больше чем максимальный элемент последовательности, кратный 11. Гарантируется, что такой элемент в последовательности есть. В ответе запишите количество найденных пар, затем минимальную из сумм элементов таких пар.\nВ данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\4108_2gnPGmZ3t.txt"
        ],
        "answer": "12"
    },
    {
        "id": 3895,
        "difficulty": "Уровень: Средний",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения, по модулю не превосходящие 10 000 включительно. Найдите такие пары элементов, в которых произведение элементов больше, чем произведение рядом стоящих чисел (перед и после пары). В качестве ответа выведите максимальную сумму среди найденных пар, затем количество таких из них, в которых есть хотя бы одно число, большее среднего арифметического всех чисел в файле.\nПод парой в задаче подразумевается два подряд идущих числа. Первая и последняя пара в файле не могут быть искомыми, так как перед или после них нет чисел.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\3895_tu8oxVM_B.txt"
        ],
        "answer": "19703"
    },
    {
        "id": 3579,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых оба числа делятся на минимальный элемент последовательности, кратный 6. Гарантируется, что такой элемент в последовательности есть. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар.\nВ данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\3579_4iHuEtE8I.txt"
        ],
        "answer": "17"
    },
    {
        "id": 3223,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые — значения от 1 до 10 000 включительно. Определите количество пар последовательности, в которых хотя бы одно число кратно минимальному числу в последовательности, кратному 17. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\3223_LFhIV7dQ8.txt"
        ],
        "answer": "24"
    },
    {
        "id": 2996,
        "difficulty": "Уровень: Базовый",
        "task": "(Е. Джобс) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -10000 до 10 000 включительно. Определите пары, среднее арифметическое в которых больше, чем количество чисел в последовательности, абсолютное значение которых меньше 100. В ответе запишите два числа: сначала количество найденных пар, а затем – максимальную сумму элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2996_iiSDg4vvn.txt"
        ],
        "answer": "685"
    },
    {
        "id": 2995,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 0 до 10 000 включительно. Определите количество пар, в которых оба элемента меньше, чем среднее арифметическое всех чисел в файле, и хотя бы один из двух элементов оканчивается на 9. В ответе запишите два числа: сначала количество найденных пар, а затем – максимальную сумму элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2995_0-3QdsPDk.txt"
        ],
        "answer": "86"
    },
    {
        "id": 2993,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 0 до 10 000 включительно. Определите количество пар чисел, в которых хотя бы один из двух элементов больше, чем наибольшее из всех чисел в файле, делящихся на 111, и хотя бы один элемент из двух оканчивается на 7. В ответе запишите два числа: сначала количество найденных пар, а затем – минимальную сумму элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2993_c7vLyjYtz.txt"
        ],
        "answer": "147"
    },
    {
        "id": 2992,
        "difficulty": "Уровень: Средний",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 0 до 10 000 включительно. Определите количество пар чисел, в которых хотя бы один из двух элементов больше, чем наибольшее из всех чисел в файле, делящихся на 107, и в семеричной записи хотя бы одного элемента из двух содержится сочетание цифр 36. В ответе запишите два числа: сначала количество найденных пар, а затем – минимальную сумму элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2992_kn3xrr6wY.txt"
        ],
        "answer": "14"
    },
    {
        "id": 2980,
        "difficulty": "Уровень: Базовый",
        "task": "(И. Романов) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать значения от -10 000 до 10 000 включительно. Определите и запишите сначала количество пар элементов последовательности, в которых модуль суммы первого и второго числа кратен 11, а затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2980_eg-rbupBK.txt"
        ],
        "answer": "451"
    },
    {
        "id": 2979,
        "difficulty": "Уровень: Базовый",
        "task": "(И. Романов) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать значения от -10 000 до 10 000 включительно. Определите и запишите сначала количество пар элементов последовательности, в которых сумма модулей первого и второго элемента пары больше 17043 и кратна 3, а зачем минимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2979_oVXOBwgJa.txt"
        ],
        "answer": "61"
    },
    {
        "id": 2937,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые — значения от —10 000 до 10 000 включительно. Определите количество пар последовательности, в которых хотя бы одно число делится на 11, а сумма элементов пары не более максимального элемента последовательности, кратного 11. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2937_cn0bmARrD.txt"
        ],
        "answer": "731"
    },
    {
        "id": 2679,
        "difficulty": "Уровень: Средний",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать значения от -1000 до 1000 включительно. Определите количество пар элементов последовательности, в которых хотя бы одно число кратно 5 или 7, а сумма чисел пары не превышает максимальное число последовательности, оканчивающиеся на две одинаковые цифры. В ответе запишите количество подходящих под условие пар, а затем максимальную из сумм чисел таких пар. В данной задаче под парой подразумевается два подряд идущих числа. \nНапример, для чисел 22 5 15 21 -7 -10 ответом будет пара чисел 3 20.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2679_Tl7DVRN96.txt"
        ],
        "answer": "2258"
    },
    {
        "id": 2526,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Калинин) Все в сборе, и уже пора выезжать, но прекрасным белогривым коням требуются координаты пункта назначения. Помогите их раздобыть, если первая координата – это количество пар элементов последовательности, в которых хотя бы одно число делится на 7, а другое не делится на 3. Вторая координата – это наименьшее произведение пары таких чисел. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2526_2iXS70LHA.txt"
        ],
        "answer": "881"
    },
    {
        "id": 2491,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите количество троек, в которых хотя бы один из трёх элементов меньше, чем среднее арифметическое всех чисел в файле, и десятичная запись всех трёх элементов тройки содержит цифру 9. В ответе запишите два числа: сначала количество найденных троек, а затем – максимальную сумму элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2491_por0Suw97.txt"
        ],
        "answer": "345"
    },
    {
        "id": 2473,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -10000 до 10000 включительно. Определите и запишите в ответе сначала количество пар элементов последовательности, в которых хотя бы одно из чисел делится на 7 и хотя бы одно из чисел оканчивается на 3, затем минимальную из сумм элементов среди таких пар.\nВ данной задаче под парой подразумевается два подряд идущих элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2473_UeXFfL2gO.txt"
        ],
        "answer": "333"
    },
    {
        "id": 2403,
        "difficulty": "Уровень: Средний",
        "task": "(В. Шубинкин) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -10 000 до 10 000 включительно. Определите и запишите в ответе сначала количество пар элементов последовательности, в которых ровно одно число делится на 9, а другое при этом заканчивается на 3 в восьмеричной системе счисления. Затем - максимальное число в паре среди всех таких пар.\nВ данной задаче под парой подразумевается два идущих подряд элемента последовательности.\nНапример, для последовательности 307; 36; 45; -27; -11; -6; 2; 16 ответом будет пара чисел: 2 и 307.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2403_yeuMDWhly.txt"
        ],
        "answer": "252"
    },
    {
        "id": 2402,
        "difficulty": "Уровень: Средний",
        "task": "(П. Волгин) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать значения от 0 до 200 включительно. Определите сначала количество троек элементов последовательности, в которых хотя бы одно число в троичной системе счисления оканчивается 2, а затем сумму минимальных чисел из таких троек. Под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2402_hDE2aSH2L.txt"
        ],
        "answer": "91"
    },
    {
        "id": 2401,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -10000 до 10000 включительно. Определите и запишите в ответе сначала количество пар элементов последовательности, в которых сумма модулей элементов пары имеет значение не превосходящее 200 и при этом не менее 50, затем минимальное из чисел, которые являются элементами таких пар.\nВ данной задаче под парой подразумевается два подряд идущих элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2401__XE8pxWvO.txt"
        ],
        "answer": "1"
    },
    {
        "id": 2400,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -10000 до 10000 включительно. Определите и запишите в ответе сначала количество пар элементов последовательности, в которых сумма элементов не менее 100 и хотя бы одно число в паре отрицательное, затем максимальное из произведений элементов таких пар.\nВ данной задаче под парой подразумевается два подряд идущих элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2400_NSE-Nyyaf.txt"
        ],
        "answer": "1137"
    },
    {
        "id": 2399,
        "difficulty": "Уровень: Средний",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 0 до 10 000 включительно. Определите количество пар чисел, в которых ровно один из двух элементов больше, чем сумма цифр всех чисел в файле, делящихся на 35, а шестнадцатеричная запись другого оканчивается на EF. В ответе запишите два числа: сначала количество найденных пар, а затем – минимальную сумму элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2399_DzyFhntB7.txt"
        ],
        "answer": "15"
    },
    {
        "id": 2398,
        "difficulty": "Уровень: Средний",
        "task": "В файле содержится последовательность целых чисел, которые принимают значения от -10000 до 10000 включительно. Тройка идущих подряд чисел последовательности называется уникальной, если только второе из них является положительным числом, заканчивающимся на 9. Определите количество уникальных троек чисел, а затем – максимальную из всех сумм таких троек.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2398_kXLX0qahh.txt"
        ],
        "answer": "206"
    },
    {
        "id": 2388,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать значения от -10000 до 10000 включительно. Определите и запишите в ответе сначала количество пар элементов последовательности, в которых оба числа делятся нацело на 5, но не делятся на 3, затем минимальную положительную сумму из сумм таких пар. В данной задаче под парой подразумевается два подряд идущих числа. \nНапример, для чисел 5 25 125 -5 1 4 ответ 3 30.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2388_9JHsW85po.txt"
        ],
        "answer": "93"
    },
    {
        "id": 2312,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые положительные значения до 10 000 включительно. Затем программа должна найти и вывести количество и наименьшую сумму пар среди соседних элементов последовательности с чётной суммой, большей чем сумма максимального и минимального нечётного числа.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2312_svaOjWIz4.txt"
        ],
        "answer": "250"
    },
    {
        "id": 2311,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые положительные значения до 10 000 включительно. Программа должна найти и вывести количество и наименьшую сумму пар среди соседних элементов последовательности, удвоенная сумма которых больше максимального нечётного элемента в последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2311_bSs0-wZsh.txt"
        ],
        "answer": "894"
    },
    {
        "id": 2310,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые положительные значения до 10 000 включительно. Необходимо найти сумму минимального и максимального числа среди оканчивающихся на 4 элементов последовательности. Затем программа должна найти и вывести количество пар соседних элементов последовательности, сумма которых меньше найденной суммы, а также наибольшую сумму среди них.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2310_l5maHPkpd.txt"
        ],
        "answer": "503"
    },
    {
        "id": 2309,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые положительные значения до 10 000 включительно. Необходимо найти количество кратных 11 и количество кратных 17 элементов последовательности. Если количество кратных 11 больше, чем количество кратных 17, то программа должна вывести количество кратных 11, а также минимальный из них. В противном случае программа должна вывести количество кратных 17, а также максимальный из них.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2309__PdZlgY__.txt"
        ],
        "answer": "70"
    },
    {
        "id": 2308,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые положительные значения до 10 000 включительно. Необходимо найти максимальный чётный и максимальный нечётный элемент последовательности. Если максимальный чётный больше максимального нечётного, то программа должна вывести количество чётных, а также минимальный из них. В противном случае программа должна вывести количество нечётных, а также минимальный из них.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2308_hO3lrZLGM.txt"
        ],
        "answer": "507"
    },
    {
        "id": 2307,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые положительные значения до 10 000 включительно. Необходимо найти минимальный кратный 7 и минимальный кратный 13 элемент последовательности. Если минимальный кратный 7 больше минимального кратного 13, то программа должна вывести количество кратных 7, а также максимальный из них. В противном случае программа должна вывести количество кратных 13, а также максимальный из них.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2307_pN46RhRZ-.txt"
        ],
        "answer": "92"
    },
    {
        "id": 2239,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 0 до 10 000 включительно. Определите количество пар чисел, в которых хотя бы один из двух элементов больше, чем наибольшее из всех чисел в файле, делящихся на 19. В ответе запишите два числа: сначала количество найденных пар, а затем – минимальную сумму элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2239_rL3yA3Dr8.txt"
        ],
        "answer": "34"
    },
    {
        "id": 2238,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите количество троек, в которых хотя бы два из трёх элементов больше, чем среднее арифметическое всех чисел в файле. В ответе запишите два числа: сначала количество найденных троек, а затем – максимальную сумму элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2238_p1tufp-t9.txt"
        ],
        "answer": "5020"
    },
    {
        "id": 2155,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите и запишите в ответе сначала количество пар элементов последовательности, в которых хотя бы одно число делится на 3, но не равно максимальному делящемуся на 3 среди всех чисел, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности. \n\nНапример, для последовательности из пяти элементов: 6; 2; 9; 5; –3; 6 подходят 3 пары (6; 2), (5;-3), (-3; 6). Ответ: 3 8",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2155_EKdK1L3z2.txt"
        ],
        "answer": "2801"
    },
    {
        "id": 2125,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Богданов) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите и запишите в ответе сначала количество пар элементов последовательности, в которых разность элементов чётна и кратна 37, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2125_hGlzjdAsu.txt"
        ],
        "answer": "69"
    },
    {
        "id": 2076,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) В файле содержится последовательность целых чисел. Элементы последовательности могут принимать значения от 0 до 10000 включительно. Определите сначала количество троек элементов последовательности, из которых можно составить прямоугольный треугольник, а затем сумму всех гипотенуз треугольников в подходящих тройках. Под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2076_D8nZtLN-i.txt"
        ],
        "answer": "370"
    },
    {
        "id": 2017,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 0 до 10 000 включительно. Рассматривается элементы последовательности, которые удовлетворяют следующим условиям:\nа) Число в шестнадцатеричной записи оканчивается цифрой «B»;\nб) Число делится на 7, но не делится на 6, 13, 19.\nНайдите сумму таких чисел и их количество. Гарантируется, что искомая сумма не превосходит 107.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2017_1DfOkFVOA.txt"
        ],
        "answer": "74452"
    },
    {
        "id": 2016,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 0 до 10 000 включительно. Рассматривается множество элементов последовательности, которые при делении на 13 дают остаток 7, при этом не делятся ни на 7, ни на 11. Найдите разность наибольшего и наименьшего из таких чисел и их количество.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2016_r0vq65Xvt.txt"
        ],
        "answer": "8515"
    },
    {
        "id": 2015,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 0 до 10 000 включительно. Рассматривается множество элементов последовательности, которые оканчиваются на 5 или 7  и при этом не делятся ни на 9, ни на 11. Найдите количество таких чисел и сумму минимального и максимального из них.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2015_HmCelIDM1.txt"
        ],
        "answer": "337"
    },
    {
        "id": 2014,
        "difficulty": "Уровень: Средний",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 0 до 10 000 включительно. Рассматривается множество элементов последовательности, которые в пятеричной системе счисления оканчиваются на 3, в девятеричной – на 5 и не оканчиваются на 7 в восьмеричной системе счисления. В качестве ответа укажите два числа – количество найденных чисел и максимальное из них.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2014_0tDZErIxu.txt"
        ],
        "answer": "43"
    },
    {
        "id": 2013,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 0 до 10 000 включительно. Рассматривается множество элементов последовательности, которые оканчиваются либо на 2, либо на 7 и делятся на 3, 11. Найдите количество таких чисел и минимальное из них.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2013_23k3sJGR7.txt"
        ],
        "answer": "13"
    },
    {
        "id": 2007,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 0 до 10 000 включительно. Рассматривается множество элементов последовательности, которые удовлетворяют следующим условиям:\n− кратны 3, но не кратны 9;\n− последняя цифра не менее 4.\nНайдите количество таких чисел и целую часть их среднего арифметического.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2007_u6w7wSZIO.txt"
        ],
        "answer": "247"
    },
    {
        "id": 2005,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 0 до 10 000 включительно. Рассматривается множество элементов последовательности, которые удовлетворяют следующим условиям:\n− запись в троичной и пятеричной системах счисления заканчивается одинаковой цифрой;\n− кратны 31, 47 или 53.\nНайдите количество таких чисел и минимальное из них.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2005_3H3i6SelW.txt"
        ],
        "answer": "31"
    },
    {
        "id": 2004,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 0 до 10 000 включительно. Рассматривается множество элементов последовательности, которые удовлетворяют следующим условиям:\n− остаток от деления на 13 равен 4;\n− остаток от деления на 8 равен 1.\nНайдите наибольшее из таких чисел и их сумму. Гарантируется, что искомая сумма не превосходит 107.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2004_dr-9bYH2L.txt"
        ],
        "answer": "8649"
    },
    {
        "id": 2003,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 0 до 10 000 включительно. Рассматривается множество элементов последовательности, которые делятся на 3 и не делятся на 7, 17, 19, 27. Найдите количество таких чисел и максимальное из них.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2003_tt4aL-33Y.txt"
        ],
        "answer": "445"
    },
    {
        "id": 2002,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите и запишите в ответе сначала количество четвёрок элементов последовательности, в которых числа идут в порядке убывания, при этом разность наибольшего и наименьшего числа больше 1000, затем минимальную сумму элементов таких четвёрок. В данной задаче под четвёркой подразумевается четыре идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2002_fSPnJFbJE.txt"
        ],
        "answer": "181"
    },
    {
        "id": 2001,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите и запишите в ответе сначала количество четвёрок элементов последовательности, в которых чётность соседних чисел различна, затем максимальную сумму среди таких четвёрок. В данной задаче под четвёркой подразумевается четыре идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2001_c_sbWoamV.txt"
        ],
        "answer": "604"
    },
    {
        "id": 2000,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите и запишите в ответе сначала количество троек элементов последовательности, в которых числа расположены в порядке возрастания, затем минимальную из разностей наибольшего и наименьшего элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\2000_iwRuWf6ln.txt"
        ],
        "answer": "832"
    },
    {
        "id": 1999,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите и запишите в ответе сначала количество троек элементов последовательности, в которых хотя бы одно число кратно 12, а каждое число делится на 3, затем минимальное из средних арифметических элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\1999_WRF7C3Gc4.txt"
        ],
        "answer": "119"
    },
    {
        "id": 1998,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите и запишите в ответе сначала количество троек элементов последовательности, в которых произведение кратно 7, а сумма оканчивается на 5, затем максимальную из сумм элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\1998__DAj19Xk-.txt"
        ],
        "answer": "153"
    },
    {
        "id": 1997,
        "difficulty": "Уровень: Средний",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите и запишите в ответе сначала количество пар элементов последовательности, в которых чётность чисел различна, при этом чётное число делится на 4, а нечётное на 11, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\1997_PQEHAmVCg.txt"
        ],
        "answer": "126"
    },
    {
        "id": 1996,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите и запишите в ответе сначала количество пар элементов последовательности, в которых произведение нечётно, а среднее арифметическое делится на 7, затем минимальное из средних арифметических элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\1996_R2lDQPWiV.txt"
        ],
        "answer": "179"
    },
    {
        "id": 1995,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите и запишите в ответе сначала количество пар элементов последовательности, в которых сумма элементов делится на 2 и не оканчивается на 6, затем максимальное из средних арифметических элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\1995_9gWmWMHr2.txt"
        ],
        "answer": "1971"
    },
    {
        "id": 1994,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите и запишите в ответе сначала количество пар элементов последовательности, произведение которых положительно, а сумма кратна 7, затем минимальное из произведений элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\1994_YCtBkFMEz.txt"
        ],
        "answer": "359"
    },
    {
        "id": 1993,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите и запишите в ответе сначала количество пар элементов последовательности, сумма которых кратна 3 и не кратна 6, а произведение оканчивается на 8, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\1993_v2Rg5X_lm.txt"
        ],
        "answer": "140"
    },
    {
        "id": 1970,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите и запишите в ответе сначала количество пар элементов последовательности, в которых хотя бы одно число делится на 3, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности. \n\nНапример, для последовательности из пяти элементов: 6; 2; 9; –3; 6 – ответ: 4 11",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\1970_WuT6YIZf_.txt"
        ],
        "answer": "2802"
    },
    {
        "id": 19249,
        "difficulty": "Уровень: Базовый",
        "task": "В файле содержится последовательность целых чисел. Её элементы могут принимать целые значения от -100000 до 100000 включительно. Определите количество троек последовательности, в которых хотя бы один элемент является пятизначным числом и оканчивается на 43, а сумма квадратов элементов тройки не больше квадрата максимального элемента последовательности, являющегося пятизначным числом и оканчивающегося на 43.\nГарантируется, что такой элемент в последовательности есть.\nВ ответе запишите количество найденных троек, затем минимальную из сумм квадратов элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.",
        "images": [],
        "files": [
            "tasks_json\\task_17\\files\\19249_17.txt"
        ],
        "answer": "92 838850571"
    }
]