[
    {
        "id": 19240,
        "difficulty": "Уровень: Базовый",
        "task": "Все пятибуквенные слове, в составе которых могут быть только русские буквы Я, Н, В, А, Р, Ь, записаны в алфавитном порядке и пронумерованы, начиная с 1. Ниже приведено начало списка.\n1. ААААА\n2. ААААВ\n3. ААААН\n4. ААААР\n5. ААААЬ\n6. ААААЯ\n7. АААВА\n…\nПод каким номером в списке идёт последнее слово, которое не начинается с буквы Я, содержит не более одной буквы Ь и не содержит букв Я, стоящих рядом?",
        "images": [],
        "answer": "6406"
    },
    {
        "id": 18976,
        "difficulty": "Уровень: Средний",
        "task": "(О. Лысенков) Определите количество 20-ричных пятизначных чисел,в записи которых четные и нечетные цифры чередуются и сумма числовых значений крайних цифр данного числа равна 26",
        "images": [],
        "answer": "13000"
    },
    {
        "id": 18974,
        "difficulty": "Уровень: Средний",
        "task": "(О. Лысенков) Определите количество 25-ричных четырехзначных чисел, в записи которых ровно одна нечетная цифра и не более двух цифр с числовым значением, не превышающим 5",
        "images": [],
        "answer": "95700"
    },
    {
        "id": 18973,
        "difficulty": "Уровень: Средний",
        "task": "(О. Лысенков) Определите количество 25-ричных четырехзначных чисел, в записи которых хотя бы одна четная цифра и больше двух цифр с числовым значением, превышающим 15",
        "images": [],
        "answer": "50184"
    },
    {
        "id": 18972,
        "difficulty": "Уровень: Средний",
        "task": "(О. Лысенков) Определите количество 25-ричных четырехзначных чисел, в записи которых ровно одна четная цифра и не более двух цифр с числовым значением, превышающим 15",
        "images": [],
        "answer": "77184"
    },
    {
        "id": 18963,
        "difficulty": "Уровень: Базовый",
        "task": "(В. Лашин) Александр составляет 8-буквенные слова, в которых могут быть использованы только буквы К, О, Т, Б, У, С. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Слово должно содержать в себе подстроку КОТ и не должно начинаться с гласной буквы. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Александр?",
        "images": [],
        "answer": "33516"
    },
    {
        "id": 18942,
        "difficulty": "Уровень: Базовый",
        "task": "(Д. Бахтиев) Дионисий составляет 6-буквенные слова из букв своего имени, причём в слове обязательно должна присутствовать буква Д или буква Н, но не обе сразу. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем, но при этом в слове не должно быть двух одинаковых букв, стоящих рядом. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Дионисий?",
        "images": [],
        "answer": "8296"
    },
    {
        "id": 18923,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Попков) Когда Снежная королева поймала Кая, она заставила его составить все слова длиной 6 букв из букв слова ВЬЮГА, где каждая буква может встречаться любое количество раз или не встречаться совсем. А затем велела удалить все слова, в которых есть сочетание букв ЮГ. Сколько слов должен удалить Кай?",
        "images": [],
        "answer": "2976"
    },
    {
        "id": 18484,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Бахтиев) Павсикакий составляет шестибуквенные слова в алфавитном порядке из букв своего имени, но нумерует только те из них, которые содержат хотя бы две гласные, стоящие рядом.\nВот начало списка:\nАААААА\nАААААВ\nАААААИ\nАААААЙ\nАААААК\n...\nПод каким номером стоит слово КАКААА?",
        "images": [],
        "answer": "23611"
    },
    {
        "id": 18374,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) Чересчур любопытная Варвара решила посчитать количество двоичных цепочек, состоящих из  20 бит, содержащих ровно 0 < K < 20 нулей, и получила в итоге шестизначное число. Чему равно максимально возможное значение K ? В ответе укажите количество битовых цепочек, соответствующих данному значению K.",
        "images": [],
        "answer": "125970"
    },
    {
        "id": 18260,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) Определите количество 12-ричных шестизначных чисел, в записи которых содержится ровно одна цифра «B» и равное количество чётных и нечётных цифр.",
        "images": [],
        "answer": "297000"
    },
    {
        "id": 18133,
        "difficulty": "Уровень: Базовый",
        "task": "(В. Колчев) Все 5-буквенные слова, в составе которых могут быть только буквы К,О,Д,И,М, записаны в алфавитном порядке и пронумерованы.\nВот начало списка:\n1. ДДДДД\n2. ДДДДИ\n3. ДДДДК\n4. ДДДДМ\n5. ДДДДО\n…\nПод каким номером в списке идёт последнее слово, которое содержит ровно две буквы М и не содержит букв М, стоящих рядом?",
        "images": [],
        "answer": "3099"
    },
    {
        "id": 18120,
        "difficulty": "Уровень: Базовый",
        "task": "(Д. Бахтиев) Все пятибуквенные слова, в составе которых могут быть только русские буквы П, Р, Е, С, Т, О, Л, записаны в алфавитном порядке и пронумерованы начиная с 1.\nВот начало списка:\nЕЕЕЕЕ\nЕЕЕЕЛ\nЕЕЕЕО\nЕЕЕЕП\nЕЕЕЕР\n...\nСколько слов в списке с нечётным номером оканчиваются на гласную букву и содержат не более трёх согласных в своём составе?\nВ ответе укажите только число.",
        "images": [],
        "answer": "1776"
    },
    {
        "id": 18042,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) Ваня составляет 5-буквенные слова, в которых могут быть использованы только буквы Л, Ю, С, Т, Р, А, причём буква Ю используется не более двух раз. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Также слово не должно оканчиваться согласными буквами. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Ваня?",
        "images": [],
        "answer": "2400"
    },
    {
        "id": 17862,
        "difficulty": "Уровень: Базовый",
        "task": "Определите количество 12-ричных пятизначных чисел, в записи которых ровно одна цифра 7 и не более трёх цифр с числовым значением, превышающим 8.",
        "images": [],
        "answer": "67476"
    },
    {
        "id": 17799,
        "difficulty": "Уровень: Средний",
        "task": "(В. Зарянкин) Все четырёхбуквенные слова, в составе которых могут быть только русские буквы А, Р, Г, У, М, Е, Н, Т, записаны в алфавитном порядке и пронумерованы начиная с 1.\nВот начало списка:\n1. АААА\n2. АААГ\n3. АААЕ\n4. АААМ\n5. АААН\n...\nПод каким номером в списке идёт последнее слово, в котором все буквы различны и все символы располагаются в алфавитном порядке?",
        "images": [],
        "answer": "2424"
    },
    {
        "id": 17798,
        "difficulty": "Уровень: Базовый",
        "task": "(В. Зарянкин) Все четырёхбуквенные слова, в составе которых могут быть только русские буквы М, И, Н, У, С, записаны в алфавитном порядке и пронумерованы начиная с 1.\nВот начало списка:\n1. ИИИИ\n2. ИИИМ\n3. ИИИН\n4. ИИИС\n5. ИИИУ\n...\nПод каким номером в списке идёт последнее слово, в котором согласных букв не меньше, чем гласных?",
        "images": [],
        "answer": "619"
    },
    {
        "id": 17766,
        "difficulty": "Уровень: Базовый",
        "task": "(Д. Бахтиев) Все пятибуквенные слова, составленные из букв С, Е, Н, Т, Я, Б, Р, Ь записаны в алфавитном порядке и пронумерованы.\nНиже приведено начало списка.\nБББББ\nББББЕ\nББББН\nББББР\nББББС\nББББТ\nББББЬ\nББББЯ\nПод каким номером в списке стоит последнее слово с чётным номером, которое начинается с буквы Р и не содержит букву Ь?",
        "images": [],
        "answer": "16384"
    },
    {
        "id": 17671,
        "difficulty": "Уровень: Базовый",
        "task": "Все пятибуквенные слова, в составе которых могут быть только русские буквы Л, А, Й, М, записаны в алфавитном порядке и пронумерованы начиная с 1.\nВот начало списка:\n1. ААААА\n2. ААААЙ\n3. ААААЛ\n4. ААААМ\n5. АААЙА\n…\nПод каким номером в списке идёт последнее слово, которое не содержит ни одной буквы М, ни одной буквы Л и не содержит букв Й стоящих рядом?",
        "images": [],
        "answer": "274"
    },
    {
        "id": 17627,
        "difficulty": "Уровень: Базовый",
        "task": "Определите количество 15-ричных пятизначных чисел, в записи которых ровно одна цифра 8 и не менее двух цифр с числовым значением, превышающим 9.",
        "images": [],
        "answer": "83175"
    },
    {
        "id": 17549,
        "difficulty": "Уровень: Базовый",
        "task": "Все 5-буквенные слова, в составе которых могут быть только буквы Ф, О, К, У, С, записаны в алфавитном порядке и пронумерованы.\nВот начало списка:\n1. ККККК\n2. ККККО\n3. ККККС\n4. ККККУ\n5. ККККФ\n…\nПод каким номером в списке идёт последнее слово, которое не содержит букв Ф и содержит ровно две буквы У?",
        "images": [],
        "answer": "2313"
    },
    {
        "id": 17521,
        "difficulty": "Уровень: Базовый",
        "task": "Определите количество восьмеричных пятизначных чисел, которые не начинаются с нечётных цифр, не оканчиваются цифрами 2 или 6, а также содержат не более двух цифр 7.",
        "images": [],
        "answer": "9135"
    },
    {
        "id": 16255,
        "difficulty": "Уровень: Средний",
        "task": "(Е.Джобс) Определите количество семизначных чисел, записанных в девятеричной системе счисления, которые не начинаются с нечетных цифр, оканчиваются на цифры, не делящиеся на 3 без остатка, а также содержат в своей записи хотя бы одну цифру 6.",
        "images": [],
        "answer": "827352"
    },
    {
        "id": 15413,
        "difficulty": "Уровень: Средний",
        "task": "(А. Вдовин) Найдите количество четырехзначных чисел в девятеричной системе счисления, в которых есть ровна одна цифра 8, а сумма цифр слева от нее равна сумме цифр справа от нее.\nПримечание: если слева или справа от 8 цифр нет, то сумма считается равной нулю",
        "images": [],
        "answer": "64"
    },
    {
        "id": 15320,
        "difficulty": "Уровень: Базовый",
        "task": "Все 5-буквенные слова, в составе которых могут быть только буквы П, А, Р, У, С, записаны в алфавитном порядке и пронумерованы.\nВот начало списка:\n1.  ААААА\n2.  ААААП\n3.  ААААР\n4.  ААААС\n5.  ААААУ\n6.  АААПА\n…\nПод каким номером в списке идёт первое слово, которое содержит не более одной буквы У и не содержит букв А, стоящих рядом?",
        "images": [],
        "answer": "131"
    },
    {
        "id": 15012,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Кузнецов) Алексей составляет пятизначные числа в четырнадцатеричной системе счисления. Числа должны содержать ровно две различные цифры, при этом число должно оканчиваться на 0 или на 3. Сколько различных чисел может составить Алексей?",
        "images": [],
        "answer": "291"
    },
    {
        "id": 14415,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) Определите количество пятизначных чисел, записанных в двенадцатеричной системе счисления, в записи которых ровно две цифры A, и при этом никакая чётная цифра не стоит рядом с цифрой 7.",
        "images": [],
        "answer": "9780"
    },
    {
        "id": 14414,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) Определите количество семизначных чисел, записанных в девятеричной системе счисления, в записи которых только одна цифра 6, и при этом никакие две чётные или две нечётные цифры не стоят рядом.",
        "images": [],
        "answer": "25600"
    },
    {
        "id": 14413,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) Леонид составляет коды перестановкой букв слова СОРТИРОВКА. При этом в кодах никакие три согласные или три гласные буквы не должны стоять рядом. Сколько различных кодов может составить Леонид?",
        "images": [],
        "answer": "185760"
    },
    {
        "id": 14412,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) Вася составляет 6-буквенные слова, в которых могут быть использованы только буквы А, Л, Г, О, Р, И, Т, М, причём буква Л используется не более одного раза. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Слово не должно начинаться с буквы Р и оканчиваться согласными буквами. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?",
        "images": [],
        "answer": "75117"
    },
    {
        "id": 14411,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) Все пятибуквенные слова, составленные из букв слова СУБЛИМАЦИЯ, записаны в алфавитном порядке и пронумерованы.\nНиже приведено начало списка. \n1. ААААА\n2. ААААБ\n3. ААААИ\n4. ААААЛ\n5. ААААМ\n6. ААААС\n7. ААААУ\n8. ААААЦ\nПод каким номером в списке стоит последнее слово с нечётным номером, которое не заканчивается на букву Я и содержит ровно две гласные буквы?",
        "images": [],
        "answer": "58955"
    },
    {
        "id": 14410,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) Все шестибуквенные слова, составленные из букв С, О, Л, Н, Ц, Е, записаны в алфавитном порядке и пронумерованы.\nНиже приведено начало списка.\n1. ЕЕЕЕЕЕ\n2. ЕЕЕЕЕЛ\n3. ЕЕЕЕЕН\n4. ЕЕЕЕЕО\n5. ЕЕЕЕЕС\n6. ЕЕЕЕЕЦ\nОпределите в этом списке количество слов с чётными номерами, которые не начинаются с гласной буквы и при этом содержат в своей записи ровно две буквы Ц.",
        "images": [],
        "answer": "4025"
    },
    {
        "id": 13870,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) Сколько существует различных пятизначных чисел, записанных в восьмеричной системе счисления, в записи которых есть только три одинаковые цифры, причём стоящие рядом?",
        "images": [],
        "answer": "882"
    },
    {
        "id": 13823,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) Все пятибуквенные слова, составленные из букв М, И, З, А, Н, Т, Р, О, П, записаны в алфавитном порядке и пронумерованы.\nНиже приведено начало списка.\n1. ААААА\n2. ААААЗ\n3. ААААИ\n4. ААААМ\n5. ААААН\n6. ААААО\n7. ААААП\n8. ААААР\nПод каким номером в списке стоит последнее слово с чётным номером, которое начинается с буквы Н и содержит ровно две буквы Р?",
        "images": [],
        "answer": "32712"
    },
    {
        "id": 13298,
        "difficulty": "Уровень: Средний",
        "task": "(М. Паршиков) Алиса составила все пятибуквенные слова из букв П, Р, И, В, Ы, Ч, К, А,  записала их в алфавитном порядке и пронумеровала. После этого Алиса удалила каждое пятое слово и пронумеровала новый список.\nВот начало списка:\n1. ААААА\n2. ААААВ\n3. ААААИ\n4. ААААК\n5. ААААР (удалилось слово ААААП)\n\nПод каким номером идет первое слово, в котором все буквы различные и согласные?",
        "images": [],
        "answer": "4754"
    },
    {
        "id": 13253,
        "difficulty": "Уровень: Базовый",
        "task": "(Я. Рябков) Павел составляет два списка из слов: в одном всевозможные 5-буквенные слова, составленные из набора букв К, О, Н, Е, Ц, в другом всевозможные 5-буквенные слова, составленные из набора букв Д, Р, А, К, О, Н. Каждая из допустимых букв может встречаться в словах любое количество раз или не встречаться совсем.\nНайдите количество слов, которые присутствуют только в одном из списков.",
        "images": [],
        "answer": "10415"
    },
    {
        "id": 13252,
        "difficulty": "Уровень: Средний",
        "task": "(М. Попков) Какое количество 5-буквенных слов вы сможете составить из перестановки букв слова «КИДАЛА»?\nВ данной задаче нужно принять подходящими все возможные последовательности, вне зависимости от того, имеет или нет данный набор букв смысловое содержание.\nПри этом нельзя учитывать слова с двумя подряд одинаковыми буквами.",
        "images": [],
        "answer": "264"
    },
    {
        "id": 13251,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Попков) Какое кол-во 4-буквенных слов вы сможете составить из набора «КАЙФ»?\nВ данной задаче нужно принять подходящими все возможные последовательности, вне зависимости от того, имеет или нет данный набор букв смысловое содержание.\nЕсли буква используется в слове, то только 1 раз, при этом код не может заканчиваться буквой Й и не может содержать сочетание КФ.",
        "images": [],
        "answer": "14"
    },
    {
        "id": 13094,
        "difficulty": "Уровень: Средний",
        "task": "Сколько существует 9-значных девятеричных чисел, в записи которых не встречается цифра 0, любые две соседние цифры имеют разную чётность, и никакая цифра не повторяется больше 3 раз?",
        "images": [],
        "answer": "483840"
    },
    {
        "id": 12917,
        "difficulty": "Уровень: Базовый",
        "task": "Петя составляет слова путём перестановки букв в слове ПРОСТО. Сколько он сможет составить слов, если запрещено ставить рядом две одинаковые буквы?",
        "images": [],
        "answer": "240"
    },
    {
        "id": 12786,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Попков) Какое количество 6-буквенных слов вы сможете составить перестановкой букв слова «МАКАКА»? В данной задаче нужно принять подходящими все возможные последовательности, вне зависимости имеет или нет данный набор букв смысловое содержание. При этом необходимо избегать слов с двумя подряд одинаковыми буквами.",
        "images": [],
        "answer": "10"
    },
    {
        "id": 12783,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Попков) Какое количество 7-значных чисел в десятичной системе счисления вы можете составить? Число можно составить согласно данным правилам:\n1) Все цифры различны;\n2) Никакие две четные и две нечетные цифры не стоят рядом.",
        "images": [],
        "answer": "12960"
    },
    {
        "id": 12782,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Попков) Какое количество 5-буквенных слов вы сможете составить из набора букв слова «ЯЩЕР»? В данной задаче нужно принять подходящими все возможные последовательности, вне зависимости имеет или нет данный набор букв смысловое содержание. Также в данной задаче есть ограничение: буква Е используется в слове, но встречается в нём не более трёх раз, каждая другая буква может встречаться любое количество раз, а может и не встречаться совсем.",
        "images": [],
        "answer": "765"
    },
    {
        "id": 12724,
        "difficulty": "Уровень: Базовый",
        "task": "(C. Горбачёв) Все шестибуквенные слова, составленные из букв слова КАЛЕЙДОСКОП, записаны в обратном алфавитном порядке и пронумерованы.\nВот начало списка:\n\n0. СССССС\n1. СССССП\n2. СССССО\n3. СССССЛ\n4. СССССК\n5. СССССЙ\n6. СССССЕ\n\nПод каким номером в списке стоит первое слово с чётным номером, которое начинается с буквы К, содержит не менее двух букв Й и не содержит букв С и Е?",
        "images": [],
        "answer": "243698"
    },
    {
        "id": 12462,
        "difficulty": "Уровень: Базовый",
        "task": "Сколько существует различных трёхзначных и пятизначных чисел, записанных в шестнадцатеричной системе счисления, в записи которых цифры следуют слева направо в строго убывающем порядке?",
        "images": [],
        "answer": "4928"
    },
    {
        "id": 12453,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) Леонид составляет коды перестановкой букв слова СОВЕСТЬ. При этом в кодах не должно быть двух стоящих рядом гласных и двух стоящих рядом согласных одновременно. Сколько различных кодов может составить Леонид?\nПримечание: в этой задаче мягкий знак принять за гласную букву.",
        "images": [],
        "answer": "720"
    },
    {
        "id": 12240,
        "difficulty": "Уровень: Базовый",
        "task": "Сколько существует девятеричных пятизначных чисел, содержащих в своей записи ровно одну цифру 5, в которых никакие две одинаковые цифры не стоят рядом?",
        "images": [],
        "answer": "13377"
    },
    {
        "id": 12097,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Попков) Все шестибуквенные слова, составленные из букв Г, И, Р, Л, Я, Н, Д, А, записаны в алфавитном порядке и пронумерованы.\nВот начало списка:\n1. АААААА\n2. АААААГ\n3. АААААД\n4. АААААИ\n5. АААААЛ\n6. АААААН\n7. АААААР\nПод каким номером в списке стоит последнее слово с чётным номером, которое не начинается с буквы Я и содержит ровно три буквы Д?",
        "images": [],
        "answer": "226456"
    },
    {
        "id": 11827,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) Определите количество семизначных чисел, записанных в восьмеричной системе счисления, запись которых содержит ровно две чётные цифры, и при этом никакая нечётная цифра не стоит рядом с цифрой 7.",
        "images": [],
        "answer": "95904"
    },
    {
        "id": 11657,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) Сколько существует восьмеричных шестизначных чисел, не содержащих в своей записи цифру 3, в которых все цифры различны и хотя бы две чётные стоят рядом?",
        "images": [],
        "answer": "3852"
    },
    {
        "id": 11300,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Ишимов) Все 6-буквенные слова, составленные из букв Г, О, Н, Д, У, Б, Ш, записаны в алфавитном порядке и пронумерованы.\nВот начало списка:\n1. ББББББ\n2. БББББГ\n3. БББББД\n4. БББББН\n5. БББББО\n6. БББББУ\n...\nПод каким номером в списке стоит последнее слово с нечётным номером, которое не начинается с буквы Б, содержит не менее двух букв Н и не содержит букв У?",
        "images": [],
        "answer": "117625"
    },
    {
        "id": 11299,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Ишимов) Все 6-буквенные слова, составленные из букв Б, М, Ю, Р, Н, записаны в алфавитном порядке и пронумерованы.\nВот начало списка:\n1. ББББББ\n2. БББББМ\n3. БББББН\n4. БББББР\n5. БББББЮ\n6. ББББМБ\n...\nПод каким номером в списке стоит последнее слово с нечётным номером, которое не начинается с буквы М, содержит не менее двух букв Р и не содержит букв Ю?",
        "images": [],
        "answer": "11719"
    },
    {
        "id": 11298,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Ишимов) Все 6-буквенные слова, составленные из букв А, О, Ж, П, Ю, З, записаны в алфавитном порядке и пронумерованы.\nВот начало списка:\n1. АААААА\n2. АААААЖ\n3. АААААЗ\n4. АААААО\n5. АААААП\n6. АААААЮ\n...\nСколько существует слов в списке с чётными номерами, которые начинаются с буквы А и содержат не менее двух букв З?",
        "images": [],
        "answer": "513"
    },
    {
        "id": 11297,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Ишимов) Все 5-буквенные слова, составленные из букв Щ, Р, Ю, И, записаны в алфавитном порядке и пронумерованы.\nВот начало списка:\n1. ИИИИИ\n2. ИИИИР\n3. ИИИИЩ\n4. ИИИИЮ\n5. ИИИРИ\n6. ИИИРР\n...\nПод каким номером идёт последнее слово, которое начинается на букву Щ и заканчивается на букву И?",
        "images": [],
        "answer": "765"
    },
    {
        "id": 11296,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Ишимов) Все 6-буквенные слова, составленные из букв Д, О, С, Ж, записаны в алфавитном порядке и пронумерованы.\nВот начало списка:\n1. ДДДДДД\n2. ДДДДДЖ\n3. ДДДДДО\n4. ДДДДДС\n5. ДДДДЖД\n6. ДДДДЖЖ\n...\nПод каким номером идёт первое слово, которое начинается на буквы ЖС?",
        "images": [],
        "answer": "1793"
    },
    {
        "id": 11295,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Ишимов) Все 4-буквенные слова, составленные из букв Щ, Э, Д, С, Р, записаны в алфавитном порядке и пронумерованы.\nВот начало списка:\n1. ДДДД\n2. ДДДР\n3. ДДДС\n4. ДДДЩ\n5. ДДДЭ\n6. ДДРД\n...\nПод каким номером стоит слово ЩДЩД?",
        "images": [],
        "answer": "391"
    },
    {
        "id": 11294,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Ишимов) Артём составляет таблицу кодовых слов для передачи сообщений, каждому сообщению соответствует своё кодовое слово. В качестве кодовых слов Артём использует 6-буквенные слова, в которых могут быть только буквы Д, Г, Ш, Я, Б, Ж, причём буква Я появляется ровно 1 раз. Каждая из других допустимых букв может встречаться в кодовом слове любое количество раз или не встречаться совсем. Сколько различных кодовых слов может использовать Артём?",
        "images": [],
        "answer": "18750"
    },
    {
        "id": 11293,
        "difficulty": "Уровень: Средний",
        "task": "(М. Ишимов) Сколько существует тринадцатеричных шестизначных чисел, не содержащих в своей записи более одной цифры 5, в которых никакие две нечётные цифры не стоят рядом?",
        "images": [],
        "answer": "1666784"
    },
    {
        "id": 11292,
        "difficulty": "Уровень: Средний",
        "task": "(М. Ишимов) Сколько существует шестнадцатеричных пятизначных чисел, содержащих в своей записи ровно две цифры 6, при этом никакая чётная цифра не стоит рядом с цифрой 6?",
        "images": [],
        "answer": "4352"
    },
    {
        "id": 11291,
        "difficulty": "Уровень: Средний",
        "task": "(М. Ишимов) Сколько существует шестеричных семизначных чисел, содержащих в своей записи ровно одну цифру 2, при этом никакая чётная цифра не стоит рядом с цифрой 2?",
        "images": [],
        "answer": "40500"
    },
    {
        "id": 11290,
        "difficulty": "Уровень: Средний",
        "task": "(М. Ишимов) Сколько существует шестнадцатеричных четырёхзначных чисел, содержащих в своей записи ровно одну цифру 9, в которых никакие две чётные или две нечётные цифры не стоят рядом?",
        "images": [],
        "answer": "1680"
    },
    {
        "id": 11289,
        "difficulty": "Уровень: Средний",
        "task": "(М. Ишимов) Сколько существует девятеричных семизначных чисел, не содержащих в своей записи цифру 2, в которых все цифры различны и никакие две чётные или две нечётные цифры не стоят рядом?",
        "images": [],
        "answer": "1008"
    },
    {
        "id": 11227,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Ишимов) Все пятибуквенные слова, составленные из букв Л, О, Г, А, Р, И, Ф, М, записаны в алфавитном порядке и пронумерованы.\nВот начало списка:\n1. ААААА\n2. ААААГ\n3. ААААИ\n4. ААААЛ\n5. ААААМ\n6. ААААО\n7. ААААР\n…\nОпределите в этом списке количество слов с чётными номерами, которые не начинаются на ЛМ и при этом содержат в своей записи не менее двух букв И.",
        "images": [],
        "answer": "1288"
    },
    {
        "id": 11202,
        "difficulty": "Уровень: Средний",
        "task": "(С. Якунин) Полина составляет слова, переставляя буквы в слове АССЕМБЛЕР. Сколько слов может составить Полина, если известно, что сумма порядковых номеров гласных букв, в каждом из них, равна 9? Буквы нумеруются слева направо, начиная с единицы.",
        "images": [],
        "answer": "3240"
    },
    {
        "id": 11201,
        "difficulty": "Уровень: Средний",
        "task": "(С. Якунин) Полина составляет слова, переставляя буквы в слове ПАЙТОН. Сколько слов может составить Полина, если известно, что сумма порядковых номеров гласных букв, в каждом из них, равна 6? Буквы нумеруются слева направо, начиная с единицы.",
        "images": [],
        "answer": "96"
    },
    {
        "id": 10090,
        "difficulty": "Уровень: Базовый",
        "task": "Сколько существует восьмеричных пятизначных чисел, не содержащих в своей записи цифру 1, в которых все цифры различны и никакие две чётные или две нечётные цифры не стоят рядом?",
        "images": [],
        "answer": "180"
    },
    {
        "id": 9994,
        "difficulty": "Уровень: Базовый",
        "task": "(С. Чайкин) Все пятибуквенные слова, составленные из букв слова ШКОЛА, записаны в алфавитном порядке и пронумерованы.\nНиже приведено начало списка.\n1. ААААА\n2. ААААК\n3. ААААЛ\n4. ААААО\n5. ААААШ\nПод каким номером стоит слово ШАЛАШ?",
        "images": [],
        "answer": "2555"
    },
    {
        "id": 9849,
        "difficulty": "Уровень: Средний",
        "task": "(В. Ген) Даша составляет 6-буквенные слова, содержащие в себе только те заглавные буквы латинского алфавита, которые содержатся в шестнадцатиричной системе счисления. Сколько различных слов может составить Даша с учётом того, что гласная не может стоять в начале и в конце слова?",
        "images": [],
        "answer": "20736"
    },
    {
        "id": 9831,
        "difficulty": "Уровень: Базовый",
        "task": "Сколько существует шестнадцатеричных трёхзначных чисел, в которых все цифры различны и никакие две чётные или две нечётные цифры не стоят рядом?",
        "images": [],
        "answer": "840"
    },
    {
        "id": 9777,
        "difficulty": "Уровень: Базовый",
        "task": "Все пятибуквенные слова, составленные из букв К, О, М, П, Ь, Ю, Т, Е, Р, записаны в алфавитном порядке и пронумерованы.\nВот начало списка:\n1. ЕЕЕЕЕ\n2. ЕЕЕЕК\n3. ЕЕЕЕМ\n4. ЕЕЕЕО\n5. ЕЕЕЕП\n6. ЕЕЕЕР\n7. ЕЕЕЕТ\n8. ЕЕЕЕЬ\nПод каким номером в списке стоит последнее слово с нечётным номером, которое не начинается с буквы Ь и содержит ровно две буквы К?",
        "images": [],
        "answer": "58979"
    },
    {
        "id": 9739,
        "difficulty": "Уровень: Базовый",
        "task": "Все шестибуквенные слова, составленные из букв М, А, Н, Г, У, С, Т, записаны в алфавитном порядке и пронумерованы.\nВот начало начало списка:\n1. АААААА\n2. АААААГ\n3. АААААМ\n4. АААААН\n5. АААААС\n6. АААААТ\n7. АААААУ\n…\nПод каким номером в списке стоит последнее слово, которое не начинается с буквы У, содержит только две буквы М и не более одной буквы Г.",
        "images": [],
        "answer": "100810"
    },
    {
        "id": 9695,
        "difficulty": "Уровень: Базовый",
        "task": "(А.Богданов) Вася составляет пятибуквенные слова из букв слова УДАЧ. Каждая буква может не входить или входить в слово многократно. Первая буква может быть только гласной. Все различные слова пронумеровали в алфавитном порядке начиная с 1. Под каким номером стоит слово УДАЧА?",
        "images": [],
        "answer": "333"
    },
    {
        "id": 9538,
        "difficulty": "Уровень: Средний",
        "task": "Сколько существует 5-разрядных пятнадцатеричных чисел, в которых кратные 2 и кратные 3 разряды чередуются? \nНапример, число 40068 подходит под описание, число 40086 - нет.\nПримечание: кратными считаются значения, для которых при делении получается остаток 0.",
        "images": [],
        "answer": "17438"
    },
    {
        "id": 9363,
        "difficulty": "Уровень: Средний",
        "task": "Семён составляет слова путем перестановки букв в слове ХОЧУНАБЮДЖЕТ. Сколько слов может составить Семён, если известно, что слова с пятью подряд идущими гласными буквами запрещены?",
        "images": [],
        "answer": "474163200"
    },
    {
        "id": 9155,
        "difficulty": "Уровень: Базовый",
        "task": "Катя составляет 5-буквенные слова из букв слова АПРЕЛЬ и упорядочивает их в обратном алфавитном порядке. Вот начало списка:\n1.    ЬЬЬЬЬ\n2.    ЬЬЬЬР\n3.    ЬЬЬЬП\n4.    ЬЬЬЬЛ\n5.    ЬЬЬЬЕ\n6.    ЬЬЬЬА\n7.    ЬЬЬРЬ\nСколько слов, оканчивающихся на Ь, запишет Катя, если заполнит список до 387 позиции (включительно)?",
        "images": [],
        "answer": "65"
    },
    {
        "id": 9061,
        "difficulty": "Уровень: Базовый",
        "task": "(А.Богданов) Все пятибуквенные слова, составленные из букв Е, П, С, У, Х, записаны в алфавитном порядке и пронумерованы начиная с 1. Буквы могут входить в слово неоднократно или не входить вовсе. Но последней буквой может быть только согласная. Под каким номером стоит слово УСПЕХ?",
        "images": [],
        "answer": "1293"
    },
    {
        "id": 8945,
        "difficulty": "Уровень: Средний",
        "task": "(Е. Джобс) Сколько существует 7-разрядных чисел в двенадцатеричной системе счисления, в которых цифры кратные и некратные трём чередуются?",
        "images": [],
        "answer": "360448"
    },
    {
        "id": 8665,
        "difficulty": "Уровень: Средний",
        "task": "(М. Шагитов) Определите количество семизначных чисел, записанных в двенадцатеричной системе счисления, в записи которых ровно две цифры B, при этом чётные и нечётные цифры чередуются.",
        "images": [],
        "answer": "48600"
    },
    {
        "id": 8664,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Шагитов) Все пятибуквенные слова, составленные из букв С, У, М, К, А, записаны в алфавитном порядке и пронумерованы начиная с 1.\nНиже приведено начало списка.\n1. ААААА\n2. ААААК\n3. ААААМ\n4. ААААС\n5. ААААУ\n6. АААКА\n…\nПод каким номером стоит слово КУМАС?",
        "images": [],
        "answer": "1179"
    },
    {
        "id": 8602,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) Все шестибуквенные слова, в составе которых могут быть только русские буквы А, Е, К, Н, С записаны в алфавитном порядке и пронумерованы начиная с 1. Ниже приведено начало списка.\n1. АААААА\n2. АААААЕ\n3. АААААК\n4. АААААН\n5. АААААС\n6. ААААЕА\nПод каким номером в списке идёт слово СЕНЕКА?",
        "images": [],
        "answer": "13536"
    },
    {
        "id": 8553,
        "difficulty": "Уровень: Средний",
        "task": "(В. Рыбальченко)Все шестибуквенные слова, в составе которых могут быть только русские буквы Н, О, Р, М, А, Л, Ь, Е записаны в алфавитном порядке и пронумерованы начиная с 1.\nНиже приведено начало списка\n    1. АААААА\n    2. АААААЕ\n    3. АААААЛ\n    4. АААААМ\n    5. АААААН\n    6. АААААО\n    7. АААААР\n    8. АААААЬ\nОпределите сколько слов находится между первым словом начинающимся на «НОРМ» и словом «НЕНОРМ» (не включая эти слова)",
        "images": [],
        "answer": "17228"
    },
    {
        "id": 8496,
        "difficulty": "Уровень: Базовый",
        "task": "Все шестибуквенные слова, составленные из букв А, В, О, Р, Т, записаны в алфавитном порядке и пронумерованы начиная с 1.\nНиже приведено начало списка.\n1. АААААА\n2. АААААВ\n3. АААААО\n4. АААААР\n5. АААААТ\n6. ААААВА\n…\nПод каким номером стоит слово ВОРОТА?",
        "images": [],
        "answer": "4821"
    },
    {
        "id": 8466,
        "difficulty": "Уровень: Средний",
        "task": "(В. Рыбальченко) Определите количество шестизначных чисел, записанных в семеричной системе счисления, которые не оканчиваются на цифры, меньшие 4, а также содержат поровну четных и нечетных цифр.",
        "images": [],
        "answer": "12672"
    },
    {
        "id": 8417,
        "difficulty": "Уровень: Базовый",
        "task": "Ярослав составляет коды из букв, входящих в слово ЯРОСЛАВ. Код должен состоять из 5 букв, буквы в коде не должны повторяться, согласных в коде должно быть больше, чем гласных, две гласные буквы нельзя ставить рядом.\nСколько кодов может составить Ярослав?",
        "images": [],
        "answer": "1224"
    },
    {
        "id": 8152,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Рогов) Все четырехбуквенные слова, в составе которых могут быть только русские буквы Л, И, Н, К, О, Р, записаны в алфавитном порядке и пронумерованы начиная с 1.\nНиже приведено начало списка.\n1. ИИИИ\n2. ИИИК\n3. ИИИЛ\n4. ИИИН\n5. ИИИО\n6. ИИИР\n…\nПод каким номером стоит слово КИНО?",
        "images": [],
        "answer": "239"
    },
    {
        "id": 7994,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) Все пятибуквенные слова, в составе которых могут быть только русские буквы А, К, Л, М, Н, Я, записаны в алфавитном порядке и пронумерованы, начиная с 1.\nНиже приведено начало списка.\n1. ААААА\n2. ААААК\n3. ААААЛ\n4. ААААМ\n5. ААААН\n6. ААААЯ\n7. АААКА\n…\nСколько слов находится между первым и последним словами, начинающимися на МН?",
        "images": [],
        "answer": "214"
    },
    {
        "id": 7836,
        "difficulty": "Уровень: Базовый",
        "task": "(А.Богданов) Все шестибуквенные слова, в составе которых могут быть только буквы слова ГРАНТ, записаны в алфавитном порядке и пронумерованы с 1. Под каким номером стоит слово ГРАНАТ?",
        "images": [],
        "answer": "5055"
    },
    {
        "id": 7810,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Ишимов) Игорь составляет таблицу кодовых слов для передачи сообщений, каждому сообщению соответствует своё кодовое слово. В качестве кодовых слов Игорь использует 6-буквенные слова, в которых есть только буквы М, А, С, Л, О, причём в кодовом слове должна встречаться ровно одна гласная, согласные буквы могут встречаться в кодовом слове любое количество раз или не встречаться совсем. Сколько различных кодовых слов может использовать Игорь?",
        "images": [],
        "answer": "2916"
    },
    {
        "id": 7673,
        "difficulty": "Уровень: Базовый",
        "task": "(В. Рыбальченко) Из символов Е, Г, Э, 2, 0, 3 составляют 7-буквенные слова, записанные в алфавитном порядке (Буквы вначале, цифры после). Вот начало этого списка:\n1.    ГГГГГГГ\n2.    ГГГГГГЕ\n3.    ГГГГГГЭ\n4.    ГГГГГГ0\n5.    ГГГГГГ2\n6.    ГГГГГГ3\n7.     ГГГГГЕГ\nКакое количество слов находятся между словами ЕГЭ2023 и 2023ЕГЭ (исключая эти слова)?",
        "images": [],
        "answer": "166004"
    },
    {
        "id": 7610,
        "difficulty": "Уровень: Базовый",
        "task": "Все пятибуквенные слова, в составе которых могут быть только русские буквы А, К, Л, М, Н, Я, записаны в алфавитном порядке и пронумерованы начиная с 1.\nНиже приведено начало списка.\n1. ААААА\n2. ААААК\n3. ААААЛ\n4. ААААМ\n5. ААААН\n6. ААААЯ\n7. АААКА\n…\nПод каким номером в списке идёт первое слово, которое начинается на буквы КМ?",
        "images": [],
        "answer": "1945"
    },
    {
        "id": 7587,
        "difficulty": "Уровень: Базовый",
        "task": "Все четырехбуквенные слова, в составе которых могут быть только русские буквы А, В, Л, О, Р записаны в алфавитном порядке и пронумерованы начиная с 1. Ниже приведено начало списка.\n1. АААА\n2. АААВ\n3. АААЛ\n4. АААО\n5. АААР\n6. ААВА\nПод каким номером идет первое слово, начинающееся на Л?",
        "images": [],
        "answer": "251"
    },
    {
        "id": 7334,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Шагитов) Найдите порядковый номер предпоследнего слова, начинающегося на буквы \"ЫЫ\", в списке всех пятибуквенных слов, состоящих из русских букв М, Ы, С, Л, Ь, записанных в алфавитном порядке, где буквы могут повторяться или вообще не встречаться.",
        "images": [],
        "answer": "2374"
    },
    {
        "id": 7029,
        "difficulty": "Уровень: Базовый",
        "task": "(А.Богданов) Марина собирает восьмибуквенные слова из букв своего имени. Все буквы могут многократно повторяться. На каком месте окажется имя МАРИАННА в отсортированном по алфавиту списке сгенерированных слов? Нумерация начинается с 1.",
        "images": [],
        "answer": "169466"
    },
    {
        "id": 6998,
        "difficulty": "Уровень: Средний",
        "task": "Генератор паролей составляет пароль длиной 7 символов из набора букв {Q, W, E, R, T, Y, N, O}.\nПри генерации пароля отбрасываются пароли, в которых содержится подстрока QWERTY и все пароли, в которых один и тот же символ встречается более чем 2 раза.\nСколько всего различных паролей может составить данный генератор?",
        "images": [],
        "answer": "1345664"
    },
    {
        "id": 6985,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Статный) Все шестибуквенные слова, в составе которых могут быть только русские буквы М, А, Р, К, С, Л записаны в алфавитном порядке и пронумерованы начиная с 1.\n\nНиже приведено начало списка.\n\n1. АААААА\n2. АААААК\n3. АААААЛ\n4. АААААМ\n5. АААААР\n6. АААААС\n\nПод каким последним номером идёт слово, в котором буквы К не стоят рядом с буквой С и одна буква повторяется трижды, а остальные не повторяются?",
        "images": [],
        "answer": "46605"
    },
    {
        "id": 6901,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Статный) Все пятибуквенные слова, в составе которых могут быть только буквы слова БАРАШ, записаны в алфавитном порядке и пронумерованы начиная с 1.\n\nНиже приведено начало списка.\n\n1. ААААА\n2. ААААБ\n3. ААААР\n4. ААААШ\n5. АААБА\n...\n\nПод каким последним номером идёт слово, в котором не более 3-х согласных и только одна буква повторяется дважды, а остальные не повторяются?",
        "images": [],
        "answer": "913"
    },
    {
        "id": 6894,
        "difficulty": "Уровень: Базовый",
        "task": "Все пятибуквенные слова, в составе которых могут быть только русские буквы Ц, А, П, Л, Я, записаны в алфавитном порядке и пронумерованы начиная с 1.\nНиже приведено начало списка.\n1. ААААА\n2. ААААЛ\n3. ААААП\n4. ААААЦ\n5. ААААЯ\n6. АААЛА\n…\nПод каким номером в списке идёт первое слово, которое содержит не более одной буквы А, ровно две буквы Ц, не содержит ни одной буквы Л?",
        "images": [],
        "answer": "319"
    },
    {
        "id": 6892,
        "difficulty": "Уровень: Базовый",
        "task": "Определите количество шестизначных чисел, записанных в шестеричной системе счисления, в записи которых ровно одна цифра 2, при этом никакая нечётная цифра не стоит рядом с цифрой 2.",
        "images": [],
        "answer": "3700"
    },
    {
        "id": 6782,
        "difficulty": "Уровень: Средний",
        "task": "(PRO100 ЕГЭ) Определите количество шестизначных чисел, записанных в восьмеричной системе счисления, в записи которых есть ровно две цифры 6, при этом никакая нечётная цифра не стоит рядом с цифрой 6.\nПример шестизначного числа, записанного в восьмеричной системе счисления – 1234568.",
        "images": [],
        "answer": "5229"
    },
    {
        "id": 6743,
        "difficulty": "Уровень: Базовый",
        "task": "Все пятибуквенные слова, в составе которых могут быть только русские буквы С, О, Й, К, А, записаны в алфавитном порядке и пронумерованы начиная с 1.\n\nНиже приведено начало списка.\n\n1. ААААА\n2. ААААЙ\n3. ААААК\n4. ААААО\n5. ААААС\n6. АААЙА\n...\n\nПод каким номером в списке идёт последнее слово, которое содержит не более одной буквы О и не содержит букв С, стоящих рядом?",
        "images": [],
        "answer": "2990"
    },
    {
        "id": 6591,
        "difficulty": "Уровень: Средний",
        "task": "Определите количество пятизначных чисел, записанных в семеричной системе счисления, в записи которых:\n1. только одна цифра 6;\n2. сумма четных цифр числа меньше суммы нечетных цифр числа.",
        "images": [],
        "answer": "1390"
    },
    {
        "id": 6536,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Статный, М. Шагитов) Сколько существует восьмиразрядных чисел, записанных в шестнадцатеричной системе счисления и содержащих только 3 чётные цифры.",
        "images": [],
        "answer": "895483904"
    },
    {
        "id": 6496,
        "difficulty": "Уровень: Базовый",
        "task": "(И.Санников) Гатс составляет слово из букв Б, Е, Р, С, К. Слово может иметь длину от 5 до 7 букв. Сколько слов может составить Гатс?",
        "images": [],
        "answer": "96875"
    },
    {
        "id": 6479,
        "difficulty": "Уровень: Базовый",
        "task": "(A. Поликарпова) Аня составляет 5-буквенные слова из букв К, A, Р, П, Ы. Каждая буква может встречаться ровно один раз. При этом в слове не могут стоять рядом две гласные буквы, а буква Р не может стоять на первом или последнем месте. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько слов может составить Аня?",
        "images": [],
        "answer": "48"
    },
    {
        "id": 6478,
        "difficulty": "Уровень: Базовый",
        "task": "(A. Поликарпова) Лена составляет 5-буквенные слова, она может использовать все буквы из слова «МОЛЬ». При этом каждая буква может встречаться любое количество раз либо не встречаться вовсе. Мягкий знак может стоять только после согласной буквы. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько слов может составить Лена?",
        "images": [],
        "answer": "495"
    },
    {
        "id": 6477,
        "difficulty": "Уровень: Базовый",
        "task": "(A. Поликарпова) Гарри решил составлять слова с помощью перестановки букв в слове «ЛЕВИОСА». Слово не может начинаться с гласной, а в центре не может стоять согласная буква. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько слов может составить Гарри?",
        "images": [],
        "answer": "1440"
    },
    {
        "id": 6261,
        "difficulty": "Уровень: Средний",
        "task": "(А.Богданов) Определите количество десятизначных чисел, записанных в восьмеричной системе счисления, в записи которых ровно пять цифр 7 и при этом никакая нечетная цифра не стоит рядом с цифрой 7.",
        "images": [],
        "answer": "5888"
    },
    {
        "id": 6080,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Рогов) Все пятибуквенные слова, в составе которых могут быть только русские буквы К, О, Ф, Е, записаны в алфавитном порядке и пронумерованы начиная с 1.\nНиже приведено начало списка.\n1. ЕЕЕЕЕ\n2. ЕЕЕЕК\n3. ЕЕЕЕО\n4. ЕЕЕЕФ\n5. ЕЕЕКЕ\n…\nОпределите сумму номеров первого и последнего слов в списке, в которых только одна буква О и при этом никакая согласная буква не стоит рядом с буквой О.",
        "images": [],
        "answer": "1014"
    },
    {
        "id": 6040,
        "difficulty": "Уровень: Базовый",
        "task": "Определите количество шестизначных чисел, записанных в семеричной системе счисления, в записи которых ровно одна цифра 6, при этом чётные и нечётные цифры чередуются.",
        "images": [],
        "answer": "1296"
    },
    {
        "id": 6015,
        "difficulty": "Уровень: Базовый",
        "task": "Определите количество семизначных чисел, записанных в девятеричной системе счисления, в записи которых ровно одна цифра 8, при этом числа не начинаются с нечётных цифр и не оканчиваются чётными цифрами.",
        "images": [],
        "answer": "376832"
    },
    {
        "id": 5732,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Тараскин) Робот передвигается по доске 11 x 11 клеток. Ходить он может только двумя способами:\n1) ВПРАВО на 1 клетку.\n2) ВНИЗ на 1 клетку.\nРобот начинает движение в левом верхнем углу поля, заканчивает в правом нижнем. Вопрос: сколько существует способов добраться из стартовой позиции в финишную?",
        "images": [],
        "answer": "184756"
    },
    {
        "id": 5715,
        "difficulty": "Уровень: Базовый",
        "task": "(Д. Тараскин) На шоколадной фабрике собирают новогодние подарки. В подарок могут попасть: печенье, конфеты, батончики. Т.к. фабрика хочет сэкономить, то было решено, что в каждом подарке количество конфет > количества печенья > количества батончиков и суммарно должно быть не более 15 сладостей. Сколько способов существует собрать новогодние подарки?\nP.S. - необязательно использовать сладость каждого вида",
        "images": [],
        "answer": "102"
    },
    {
        "id": 5713,
        "difficulty": "Уровень: Базовый",
        "task": "(Д. Тараскин) Инженер Петр пишет программу для банкомата, чтобы он мог разменивать денежные средства. В распоряжении у банкомата имеются монеты номиналом 1 рубль, 2, 5 и 10. Количество монет каждого вида не ограничено. Сколько существует способов разменять сумму 100 рублей? При размене необязательно использовать монеты каждого номинала",
        "images": [],
        "answer": "2156"
    },
    {
        "id": 5698,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Тараскин) Коля каждый день добирается до школы на автобусе, в котором выдают билетики за проезд.\nНа каждом билетике написано 6 цифр (в том числе с ведущими нулями). Счастливым называется билетик в котором:\n1) Сумма цифр в левой и правой частях равны.\n2) Все цифры в левой и правой частях различны.\n3) У левой и правой части есть хотя бы одна общая цифра.\n4) Левая и правая части не могут совпадать полностью.\nНапример, билетик 156-624 является счастливым. Помогите Коле посчитать сколько всего счастливых билетиков ему может попасться, пока он катается на автобусе?",
        "images": [],
        "answer": "25200"
    },
    {
        "id": 5689,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Тараскин) Сколько различных 16-значных чисел в двоичной системе счисления можно составить таким образом, чтобы сумма цифр в каждом из них была кратна 3?",
        "images": [],
        "answer": "10923"
    },
    {
        "id": 5688,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Тараскин) В группе по подготовке к экзамену по информатике занимаются 16 человек. Преподаватель каждый урок выборочно проверяет домашнее задание и всегда опрашивает НЕЧЕТНОЕ количество учащихся. Сколькими различными способами преподаватель может провести опрос?",
        "images": [],
        "answer": "32768"
    },
    {
        "id": 5687,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Тараскин) Сколько различных чисел-палиндромов, состоящих из 36 цифр, в которых каждая половинка числа (слева и справа от середины) в свою очередь тоже является палиндромом, можно составить в двоичной системе счисления?\nПримечание: число-палиндром это такое число, которое справа налево и слева направо читается одинаково. К примеру, 12344321 является числом-палиндромом. Число 123321123321 в десятичной системе подходит под условие задачи.",
        "images": [],
        "answer": "256"
    },
    {
        "id": 5686,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Тараскин) Робот двигается по полю 100 х 100 клеток. Он начинает движение в левой верхней клетке, заканчивает в правой нижней. Ходить робот может только двумя способами:\n1) ВНИЗ на 1 клетку\n2) ВПРАВО на 1 клетку.\nСколько различных программ можно написать для робота, чтобы попасть из стартовой клетки в финишную, при этом НЕЛЬЗЯ, чтобы робот ходил ДВА РАЗА ПОДРЯД ВПРАВО?",
        "images": [],
        "answer": "100"
    },
    {
        "id": 5685,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Тараскин) Вася очень общительный ребенок и он дружит со всеми своими одноклассниками, которых у него аж 30 человек.\nВ конце учебного года Вася решил устроить вечеринку и начал всем рассылать приглашения. Кто-то из друзей соглашался прийти, кто-то отказывался. И т.к. Вася очень любит комбинаторику он призадумался: а сколько же есть всего способов, чтобы собрать друзей на вечеринку? К нему может никто не прийти, могут прийти все 30 друзей, может прийти только один друг, двое и т.д.",
        "images": [],
        "answer": "1073741824"
    },
    {
        "id": 5626,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Ишимов) Определите количество пятизначных чисел, записанных в восьмеричной системе счисления, запись которых не начинается с нечётных цифр, не оканчивается цифрами 2 или 6, а также не содержит более двух цифр 7.",
        "images": [],
        "answer": "9135"
    },
    {
        "id": 5553,
        "difficulty": "Уровень: Базовый",
        "task": "Сколько можно составить различных кодов, в составе которых встречаются две подряд идущие гласные, путём перестановки букв слова СОТОЧКА?",
        "images": [],
        "answer": "1800"
    },
    {
        "id": 5488,
        "difficulty": "Уровень: Базовый",
        "task": "Полина составляет коды из букв слова ПОЛИНА. Код должен состоять из 8 букв, любую букву можно использовать произвольное число раз или не использовать вовсе. Полина хочет, чтобы согласных в каждом коде было больше, чем гласных. Сколько кодов, удовлетворяющих этому условию, она сможет составить?",
        "images": [],
        "answer": "610173"
    },
    {
        "id": 5283,
        "difficulty": "Уровень: Средний",
        "task": "(А. Рогов) Для составления цепочек используются бусины, помеченные буквами A, B, C, D, и E. В конце цепочки может стоять одна из бусин, помеченная согласной буквой. На втором месте — одна из бусин А, В, С, не стоящая в цепочке на первом месте. В начале — любая гласная, если третья буква согласная, и любая согласная, если третья гласная. Каждая из допустимых бусин может встречаться в цепочке любое количество раз или не встречаться совсем.\nСколько цепочек длины 4 можно составить по данным правилам?",
        "images": [],
        "answer": "87"
    },
    {
        "id": 5270,
        "difficulty": "Уровень: Базовый",
        "task": "(С. Якунин) Дмитрий составляет слова, переставляя буквы в слове АМФИБРАХИЙ. Сколько слов, в которых есть, хотя бы, 2 подряд идущие гласные может составить Дмитрий?",
        "images": [],
        "answer": "756000"
    },
    {
        "id": 5269,
        "difficulty": "Уровень: Базовый",
        "task": "(С. Якунин) Дмитрий составляет слова, переставляя буквы в слове АМФИБРАХИЙ. Сколько слов, в середине которых находится сочетание БР, может составить Дмитрий?",
        "images": [],
        "answer": "10080"
    },
    {
        "id": 5268,
        "difficulty": "Уровень: Средний",
        "task": "(С. Якунин) Дмитрий составляет слова, переставляя буквы в слове АМФИБРАХИЙ. Сколько различных слов, содержащих ИИФАА или ААФИИ, может составить Дмитрий?",
        "images": [],
        "answer": "1440"
    },
    {
        "id": 5267,
        "difficulty": "Уровень: Базовый",
        "task": "(С. Якунин) Дмитрий составляет слова, переставляя буквы в слове АМФИБРАХИЙ. Сколько слов, начинающихся на АМ и заканчивающихся на ИЙ может составить Дмитрий?",
        "images": [],
        "answer": "720"
    },
    {
        "id": 5234,
        "difficulty": "Уровень: Средний",
        "task": "Сколько можно составить палиндромических кодов длины 11 из символов латинского алфавита?\nПримечание:\n* в латинском алфавите 26 символов;\n* палиндромический код - код, который читается одинаково и слева направо, и справа налево, например: \"шалаш\".",
        "images": [],
        "answer": "308915776"
    },
    {
        "id": 5218,
        "difficulty": "Уровень: Базовый",
        "task": "Василий составляет 6-буквенные слова из букв А, Р, Б, У, З. Каждую букву можно использовать любое количество раз, при этом слово содержит три буквы А, две из которых стоят рядом, а третья отдельно от них. Сколько различных слов может составить Василий?",
        "images": [],
        "answer": "768"
    },
    {
        "id": 5114,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Рогов) Определите количество пятизначных чисел, записанных в семеричной системе счисления, в записи которых ровно одна цифра 5, при этом никакая четная цифра не стоит рядом с цифрой 5.",
        "images": [],
        "answer": "1176"
    },
    {
        "id": 4957,
        "difficulty": "Уровень: Базовый",
        "task": "Леонид составляет 9-буквенные коды перестановкой букв слова АНАСТАСИЯ. При этом в кодах не должно быть трёх стоящих рядом гласных и трёх стоящих рядом согласных одновременно. Сколько различных кодов может составить Леонид?",
        "images": [],
        "answer": "23040"
    },
    {
        "id": 4696,
        "difficulty": "Уровень: Базовый",
        "task": "Определите количество пятизначных чисел, записанных в восьмеричной системе счисления, в записи которых только одна цифра 6, при этом никакая нечётная цифра не стоит рядом с цифрой 6.",
        "images": [],
        "answer": "2961"
    },
    {
        "id": 4668,
        "difficulty": "Уровень: Базовый",
        "task": "Определите количество пятизначных чисел, записанных в семеричной системе счисления, которые начинаются с четных цифр, не оканчиваются на цифры, меньшие 3, а также содержат в своей записи не более одной цифры 4.",
        "images": [],
        "answer": "3024"
    },
    {
        "id": 4613,
        "difficulty": "Уровень: Базовый",
        "task": "Определите количество пятизначных чисел, записанных в девятеричной системе счисления, которые не начинаются с нечетных цифр, не оканчиваются цифрами 1 или 8, а также содержат в своей записи не более одной цифры 3.",
        "images": [],
        "answer": "18944"
    },
    {
        "id": 4588,
        "difficulty": "Уровень: Базовый",
        "task": "Определите количество пятизначных чисел, записанных в восьмеричной системе счисления, в записи которых ровно одна цифра 6, при этом никакая нечётная цифра не стоит рядом с цифрой 6.",
        "images": [],
        "answer": "2961"
    },
    {
        "id": 4566,
        "difficulty": "Уровень: Средний",
        "task": "(А.Н. Носкин) Пётр составляет слова длиной 6 букв, которые начинаются с гласной буквы. Всего он смог составить 6250 комбинаций слов. Сколько согласных букв использует Петр для составления слов, если известно, что в используемом алфавите только две гласные? Каждая буква может входить в слово несколько раз.",
        "images": [],
        "answer": "3"
    },
    {
        "id": 4538,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Богданов) Оля составляет слова перестановкой букв слова СПОРТЛОТО. Отбросив одинаковые слова и слова начинающиеся и заканчивающиеся гласной Оля отсортировала их и пронумеровала начиная с 1. Под каким номером находится последнее слово?",
        "images": [],
        "answer": "12600"
    },
    {
        "id": 4465,
        "difficulty": "Уровень: Базовый",
        "task": "Все четырехбуквенный слова, в составе которых могут быть только буквы П, Я, Т, Ь, Д, Н, Е, Й, записаны в алфавитном порядке и пронумерованы начиная с 1.\nНиже приведено начало списка.\n1. ДДДД\n2. ДДДЕ\n3. ДДДЙ\n4. ДДДН\n5. ДДДП\n6. ДДДТ\n7. ДДДЬ\n8. ДДДЯ\n9. ДДЕД\n…\nПод каким номером в списке идёт последнее слово, которое не содержит ни одной гласной и все буквы в нем различны?",
        "images": [],
        "answer": "3428"
    },
    {
        "id": 4320,
        "difficulty": "Уровень: Средний",
        "task": "Сколько существует восьмеричных шестизначных чисел, в которых все цифры различны, никакие две чётные или две нечётные цифры не стоят рядом и десятичная запись которых делится на 5?",
        "images": [],
        "answer": "208"
    },
    {
        "id": 4258,
        "difficulty": "Уровень: Базовый",
        "task": "Вася составляет 6-буквенные слова, в которых могут быть использованы только буквы Л, Е, Г, К, О, причём буква О используется не более одного раза. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Слово не должно начинаться с буквы Г и оканчиваться гласными буквами. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?",
        "images": [],
        "answer": "5376"
    },
    {
        "id": 4189,
        "difficulty": "Уровень: Базовый",
        "task": "Все пятибуквенные слова, в составе которых могут быть только буквы Б, А, Т, Ы, Р, записаны в алфавитном порядке и пронумерованы начиная с 1.\nНиже приведено начало списка.\n\n1. ААААА\n2. ААААБ\n3. ААААР\n4. ААААТ\n5. ААААЫ\n6. АААБА\n…\n\nПод каким номером в списке идёт первое слово, которое не содержит ни одной буквы Ы и не содержит букв А, стоящих рядом?",
        "images": [],
        "answer": "131"
    },
    {
        "id": 4099,
        "difficulty": "Уровень: Базовый",
        "task": "Все четырёхбуквенные слова, в составе которых могут быть только русские буквы Б, У, Л, К, А записаны в алфавитном порядке и пронумерованы начиная с 1.\nНиже приведено начало списка.\n1. АААА\n2. АААБ\n3. АААК\n4. АААЛ\n5. АААУ\n6. ААБА\n...\nПод каким номером в списке идёт последнее слово, в котором все буквы различны?",
        "images": [],
        "answer": "587"
    },
    {
        "id": 3886,
        "difficulty": "Уровень: Средний",
        "task": "Петя составляет четырехбуквенные слова из символов КЕГЭ2023 и записывает их в алфавитном порядке в список. Вот начало списка\n1.      ГГГГ\n2.      ГГГЕ\n3.      ГГГК\n4.      ГГГЭ\n5.      ГГГ0\n6.      ГГГ2\n7.      ГГГ3\n8.      ГГЕГ\nНа какой позиции будет стоять первое слово, начинающееся с цифры, и не содержащее двух подряд идущих одинаковых символов?",
        "images": [],
        "answer": "1380"
    },
    {
        "id": 3729,
        "difficulty": "Уровень: Средний",
        "task": "Петя составляет пятибуквенные слова из слова УЖЕМАЙ и записывает их в алфавитном порядке в список. Вот начало списка\n1.      ААААА\n2.      ААААЕ\n3.      ААААЖ\n4.      ААААЙ\n5.      ААААМ\n6.      ААААУ\n7.      АААЕА\nСколько существует слов, стоящих на четных позициях, в которых нет двух одинаковых подряд идущих букв?",
        "images": [],
        "answer": "1875"
    },
    {
        "id": 3570,
        "difficulty": "Уровень: Базовый",
        "task": "Все пятибуквенные слова, в составе которых могут быть только русские буквы С, О, Л, Н, Ц, Е, записаны в алфавитном порядке и пронумерованы начиная с 1.\nНиже приведено начало списка.\n1. ЕЕЕЕЕ\n2. ЕЕЕЕЛ\n3. ЕЕЕЕН\n4. ЕЕЕЕО\n5. ЕЕЕЕС\n6. ЕЕЕЕЦ\n7. ЕЕЕЛЕ\n...\nПод каким номером в списке идёт первое слово, которое содержит не более 1 буквы Е и не содержит букв Л?",
        "images": [],
        "answer": "519"
    },
    {
        "id": 3361,
        "difficulty": "Уровень: Средний",
        "task": "Петя составляет четырехбуквенные слова из слова СТЕПУХА и записывает их в алфавитном порядке в список. Вот начало списка\n1.      АААА\n2.      АААЕ\n3.      АААП\n4.      АААС\n5.      АААТ\n6.      АААУ\n7.      АААХ\n8.      ААЕА\n\nСколько существует слов, стоящих на позициях с номером большим 1000, в которых нет двух одинаковых подряд идущих букв?",
        "images": [],
        "answer": "883"
    },
    {
        "id": 3214,
        "difficulty": "Уровень: Базовый",
        "task": "Петя составляет слова из слова ПАРУС и записывает их в алфавитном порядке в список. Вот начало списка\n1.  ААААА\n2.  ААААП\n3.  ААААР\n4.  ААААС\n5.  ААААУ\n6.  АААПА\nПод каким номером идет первое слово в списке, начинающегося на У, в котором две буквы А не стоят рядом?",
        "images": [],
        "answer": "2527"
    },
    {
        "id": 3149,
        "difficulty": "Уровень: Средний",
        "task": "Определите количество пятизначных чисел, записанных в десятичной системе счисления, учитывая, что числа не могут заканчиваться на цифры 3, 4 и 7 и не должны содержать тройки соседних одинаковых цифр (например, 000).",
        "images": [],
        "answer": "61236"
    },
    {
        "id": 3029,
        "difficulty": "Уровень: Средний",
        "task": "Определите количество семизначных чисел, записанных в девятеричной системе счисления, учитывая, что числа не могут заканчиваться на цифры 3, 4 и 7 и не должны содержать тройки соседних одинаковых цифр (например, 000).",
        "images": [],
        "answer": "2676053"
    },
    {
        "id": 3028,
        "difficulty": "Уровень: Средний",
        "task": "Определите количество семизначных чисел, записанных в девятеричной системе счисления, учитывая, что числа не могут начинаться с цифр 3 и 7 и не должны содержать пары соседних одинаковых цифр (например, 00).",
        "images": [],
        "answer": "1572864"
    },
    {
        "id": 2928,
        "difficulty": "Уровень: Средний",
        "task": "Определите количество семизначных чисел, записанных в семеричной системе счисления, учитывая, что числа не могут начинаться с цифр 3 и 5 и не должны содержать сочетания цифр 22 и 44 одновременно.",
        "images": [],
        "answer": "466456"
    },
    {
        "id": 2854,
        "difficulty": "Уровень: Средний",
        "task": "Светлана составляет коды из букв слова РОСОМАХА. Код должен состоять из 8 букв, и каждая буква в нём должна встречаться столько же раз, сколько в заданном слове. Кроме того, в коде не должны стоять рядом две гласные и две согласные буквы. Сколько кодов может составить Светлана?",
        "images": [],
        "answer": "288"
    },
    {
        "id": 2798,
        "difficulty": "Уровень: Базовый",
        "task": "Светлана составляет коды из букв своего имени. Код должен состоять из 8 букв, и каждая буква в нём должна встречаться столько же раз, сколько в имени Светлана. Кроме того, одинаковые буквы в коде не должны стоять рядом. Сколько кодов может составить Светлана?",
        "images": [],
        "answer": "15120"
    },
    {
        "id": 2701,
        "difficulty": "Уровень: Базовый",
        "task": "Все шестибуквенные слова, в составе которых могут быть только буквы ФЕВРАЛЬ, записаны в алфавитном порядке и пронумерованы, начиная с 1. \nНиже приведено начало списка. \n1. АААААА\n2. АААААВ\n3. АААААЕ\n4. АААААЛ\n5. АААААР\n6. АААААФ\n7. АААААЬ\n8. ААААВА\n… \nПод каким номером в списке идёт первое слово, в котором нет ни одной гласной буквы?",
        "images": [],
        "answer": "19609"
    },
    {
        "id": 2670,
        "difficulty": "Уровень: Базовый",
        "task": "Федор составляет 5-буквенные слова, в которых встречаются только буквы С, Н, Е, Г, О, В, И, К, причём на первом и последнем месте в слове могут стоять только согласные буквы. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?",
        "images": [],
        "answer": "12800"
    },
    {
        "id": 2563,
        "difficulty": "Уровень: Средний",
        "task": "Алевтина составляет восьмибуквенные слова из букв А, К, Ц, Е. Н, Т. Слова не могут начинаться с гласной и не должны оканчиваться согласной буквой. В словах обязательно должны хотя бы один раз встречаться пара одинаковых согласных, стоящих рядом: КК, ЦЦ, НН, ТТ. Словом считается произвольная последовательность, составленная из данных букв, не обязательно имеющая смысл. Каждая буква может использоваться в слове произвольное количество раз или не использоваться совсем.\nОпределите количество слов, которое может составить Алевтина.",
        "images": [],
        "answer": "193384"
    },
    {
        "id": 2540,
        "difficulty": "Уровень: Базовый",
        "task": "Все четырёхбуквенные слова, в составе которых могут быть только буквы А, В, Т, О, Р, записаны в алфавитном порядке и пронумерованы, начиная с 1. Ниже приведено начало списка:\n1. АААА\n2. АААВ\n3. АААО\n4. АААР\n5. АААТ\n6. ААВА\n\nПод каким номером в списке идёт слово ВАТА?",
        "images": [],
        "answer": "146"
    },
    {
        "id": 2464,
        "difficulty": "Уровень: Базовый",
        "task": "Ученица составляет 7-буквенные слова из букв НИЧЬЯ, так что в каждом слове ровно две гласных, не стоящих рядом.  Каждая из других допустимых букв может встречаться в кодовом слове любое количество раз или не встречаться совсем. Какое количество слов может составить ученица?",
        "images": [],
        "answer": "14580"
    },
    {
        "id": 2379,
        "difficulty": "Уровень: Базовый",
        "task": "Вася составляет 4-буквенные слова, в которых встречаются только буквы В, З, Г, Л, Я, Д, причём буква З появляется ровно 1 или 2 раза.  Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?",
        "images": [],
        "answer": "650"
    },
    {
        "id": 2350,
        "difficulty": "Уровень: Базовый",
        "task": "Шифр кодового замка представляет собой последовательность из шести символов, каждый из которых является цифрой от 1 до 9. Сколько различных вариантов шифра, не начинающихся с цифры 5, можно задать, если известно что цифра 2 должна встречаться в коде ровно два раза. Все цифры кроме двойки могут встречаться в шифре любое количество раз или не встречаться совсем.",
        "images": [],
        "answer": "56320"
    },
    {
        "id": 2210,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Калинин) Дракула составляет таблицу кодовых слов для передачи сообщений, каждому сообщению соответствует своё кодовое слово. В качестве кодовых слов Дракула использует пятибуквенные слова, в которых могут быть только буквы К, Р, О, В, Ь, причём слово не может начинаться с буквы Ь и не может содержать сочетаний ЬО и ОЬ. Каждая буква повторяется в слове ровно один раз. Сколько различных кодовых слов может использовать Дракула?",
        "images": [],
        "answer": "54"
    },
    {
        "id": 2117,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Богданов) МАРИНА из букв своего имени составила кодовые слова перестановкой исходных букв. Сколько кодовых слов можно составить, если первая буква не может быть гласной?",
        "images": [],
        "answer": "180"
    },
    {
        "id": 1985,
        "difficulty": "Уровень: Средний",
        "task": "Петя составляет 8-буквенные слова из букв А, Б, И, К, О, Л, У, Н. Каждую букву нужно использовать ровно 1 раз, при этом нельзя ставить подряд две гласные или две согласные. Сколько различных кодов может составить Петя?",
        "images": [],
        "answer": "1152"
    },
    {
        "id": 1984,
        "difficulty": "Уровень: Базовый",
        "task": "Вася составляет 5-буквенные коды из букв И, Г, Р, О, К. Каждую букву нужно использовать ровно 1 раз, при этом код не может начинаться с буквы К и не может содержать сочетания РОК. Сколько различных кодов может составить Вася?",
        "images": [],
        "answer": "90"
    },
    {
        "id": 1983,
        "difficulty": "Уровень: Базовый",
        "task": "Вася составляет шестибуквенные слова, в которых есть только буквы С, А, Л, О, причём в каждом слове используется буква О, но не более 3-х раз. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?",
        "images": [],
        "answer": "3213"
    },
    {
        "id": 1982,
        "difficulty": "Уровень: Базовый",
        "task": "Вася составляет 4-буквенные слова, в которых есть только буквы Л, О, Д, К, А причём буква О используется в каждом слове не менее двух раз. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?",
        "images": [],
        "answer": "113"
    },
    {
        "id": 1981,
        "difficulty": "Уровень: Базовый",
        "task": "Вася составляет 6-буквенные слова, в которых есть только буквы П, У, Л, Я причём буква У используется в каждом слове ровно 2 раза. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?",
        "images": [],
        "answer": "1215"
    },
    {
        "id": 1980,
        "difficulty": "Уровень: Базовый",
        "task": "Иван составляет 6-буквенные слова из букв A, B, C, W, X, Y, Z. Первой и последней буквами этого слова могут быть только буквы W, X, Y, и Z, на остальных позициях эти буквы не встречаются. Сколько различных кодовых слов может составить Иван?",
        "images": [],
        "answer": "1296"
    },
    {
        "id": 1979,
        "difficulty": "Уровень: Базовый",
        "task": "Сколько слов длины 4, начинающихся с согласной буквы и заканчивающихся гласной буквой, можно составить из букв К, Р, Е, С, Л, О? Каждая буква может входить в слово несколько раз. Слова не обязательно должны быть осмысленными словами русского языка.",
        "images": [],
        "answer": "288"
    },
    {
        "id": 1961,
        "difficulty": "Уровень: Базовый",
        "task": "Все четырёхбуквенные слова, в составе которых могут быть только буквы Л, Е, М, У, Р, записаны в алфавитном порядке и пронумерованы, начиная с 1. \nНиже приведено начало списка. \n1. ЕЕЕЕ\n2. ЕЕЕЛ\n3. ЕЕЕМ\n4. ЕЕЕР\n5. ЕЕЕУ\n6. ЕЕЛЕ\n… \nПод каким номером в списке идёт первое слово, которое начинается с буквы Л?",
        "images": [],
        "answer": "126"
    },
    {
        "id": 1951,
        "difficulty": "Уровень: Базовый",
        "task": "(И. Женецкий) Федя составляет 7-буквенные слова из букв П, Л, Ю, С, Ё, Н, О, К, причём согласная буква не может стоять в начале слова, а также рядом с буквой Ё. Буквы в слове могут повторяться. Сколько таких слов может составить Федя?",
        "images": [],
        "answer": "317167"
    },
    {
        "id": 1950,
        "difficulty": "Уровень: Базовый",
        "task": "(И. Женецкий) Абдурахман составляет 8-буквенные слова из букв П, И, Т, О, Н, Я, Г, А, причём гласная буква не может стоять в начале слова, а также рядом с гласной буквой. Буквы в слове могут повторяться. Сколько таких слов может составить Абдурахман?",
        "images": [],
        "answer": "2228224"
    },
    {
        "id": 1948,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Оля составляет пятибуквенные слова из букв К, У, С, А, Т, Ь, причём слова не должны начинаться на мягкий знак и содержать сочетание СУК. Буквы в слове не должны повторяться. Сколько различных слов может составить Оля?",
        "images": [],
        "answer": "586"
    },
    {
        "id": 1947,
        "difficulty": "Уровень: Средний",
        "task": "(А. Куканова) Мила составляет четырёхзначные числа в восьмеричной системе. Сколько различных чисел, делящихся на 4 без остатка, может составить Мила?",
        "images": [],
        "answer": "896"
    },
    {
        "id": 1946,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Полина составляет пятизначные числа в пятеричной системе счисления, которые содержат не более трёх чётных цифр. Сколько различных чисел может составить Полина?",
        "images": [],
        "answer": "1744"
    },
    {
        "id": 1945,
        "difficulty": "Уровень: Средний",
        "task": "(А. Куканова) Евгения составляет четырёхзначные числа в восьмеричной системе счисления. Числа должны начинаться с чётной цифры, и цифры в них располагаются в невозрастающем порядке. Сколько различных чисел может составить Евгения?",
        "images": [],
        "answer": "129"
    },
    {
        "id": 1944,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Аня составляет слова, переставляя буквы в слове ОДЕКОЛОН, избегая слов, где соседние буквы — одинаковые. Сколько различных слов, включая исходное, может составить Аня?",
        "images": [],
        "answer": "2400"
    },
    {
        "id": 1943,
        "difficulty": "Уровень: Средний",
        "task": "(А. Куканова) Маша составляет шестибуквенные слова из букв З, Е, Р, К, А, Л, О, содержащие букву К, но не более четырёх раз. Остальные буквы не могут повторяться. Сколько различных слов может составить Маша?",
        "images": [],
        "answer": "12570"
    },
    {
        "id": 1942,
        "difficulty": "Уровень: Средний",
        "task": "(А. Куканова) Лиза составляет слова из букв О, Н, И, К, С, причём буква С должна встречаться в этих словах ровно три раза, а буква О — ровно один раз. Длина слова составляет от 4 до 6 букв. Сколько различных слов может составить Лиза?",
        "images": [],
        "answer": "604"
    },
    {
        "id": 1941,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Лиля составляет пятибуквенные слова из букв С, О, Т, К, А, П, Л, З. Слово не должно заканчиваться на гласную и содержать сочетания ЗЛО. Буквы в слове не повторяются. Сколько слов может составить Лиля?",
        "images": [],
        "answer": "5008"
    },
    {
        "id": 1940,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Марта составляет шестибуквенные слова из букв И, Н, Ф, А, причём буква Ф должна встречаться в слове ровно два раза. Остальные буквы могут встречаться любое количество раз или не встречаться вообще. Сколько слов может составить Марта?",
        "images": [],
        "answer": "1215"
    },
    {
        "id": 1939,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Агата составляет пятибуквенные слова из букв П, И, К, А, Ч, У, причём буква У должна встречаться в слове хотя бы два раза. Остальные буквы могут встречаться любое число раз, в том числе не встречаться вообще. Сколько слов может составить Агата?",
        "images": [],
        "answer": "1526"
    },
    {
        "id": 1938,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Леся составляет слова, содержащие ровно три буквы М, из букв Ч, О, А, Н, И, М, Е. Слово может иметь длину от 4 до 6 букв. Сколько слов может составить Леся?",
        "images": [],
        "answer": "4704"
    },
    {
        "id": 1937,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Света составляет шестибуквенные слова из букв С, О, Л, Н, Ц, Е, причём буква О встречается в слове не более 2 раз, а буква Ц — ровно 1 раз. Буквы могут повторяться. Сколько таких слов может составить Света?",
        "images": [],
        "answer": "17664"
    },
    {
        "id": 1936,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Рита составляет четырёхбуквенные слова из букв П, С, К, А, Л, Ь, причём мягкий знак, если встречается, не может стоять в начале слова, а также рядом с ещё одним мягким знаком. Буквы в слове могут повторяться. Сколько таких слов может составить Рита?",
        "images": [],
        "answer": "1025"
    },
    {
        "id": 1935,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Вика составляет четырёхбуквенные слова из букв В, А, Й, Ф, У, причём слово не может начинаться с буквы Й и не должно содержать сочетаний ВФ и ФВ. Все буквы в слове различны. Сколько таких слов может составить Вика?",
        "images": [],
        "answer": "68"
    },
    {
        "id": 1934,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Настя составляет шестибуквенные слова из букв Т, Ь, Ю, Р, И, Н, Г, причём мягкий знак не может стоять в начале слова и после гласной. Все буквы слова различны. Сколько таких слов может составить Настя?",
        "images": [],
        "answer": "3120"
    },
    {
        "id": 1933,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Вероника составляет слова, меняя местами буквы в слове КЛАБХАУС так, что любые две соседние буквы различны между собой. Сколько слов, включая исходное, может составить Вероника?",
        "images": [],
        "answer": "15120"
    },
    {
        "id": 1932,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Даша составляет слова, меняя местами буквы в слове ТИКТОК так, что любые две соседние буквы должны быть различны между собой. Сколько слов, включая исходное, может составить Даша?",
        "images": [],
        "answer": "84"
    },
    {
        "id": 1931,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Ксюша составляет слова, меняя местами буквы в слове МИМИКРИЯ. Сколько различных слов, включая исходное, может составить Ксюша?",
        "images": [],
        "answer": "3360"
    },
    {
        "id": 1930,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Ася составляет семибуквенные слова из букв А, П, Е, Л, Ь, С, И, Н. Все буквы слова различны. Буква Ь, если встречается, стоит между двумя согласными. Сколько таких слов может составить Ася?",
        "images": [],
        "answer": "12240"
    },
    {
        "id": 1929,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Ада составляет шестибуквенные слова из букв Д, Е, Й, К, С, Т, Р, А. Буква Й встречается в слове ровно один раз, и после неё обязательно идёт согласная. Буквы в слове не повторяются. Сколько слов может составить Ада?",
        "images": [],
        "answer": "9000"
    },
    {
        "id": 1928,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Полина составляет шестибуквенные слова из букв Р, Е, Ж, И, М, Д, Н, О, причём слово должно начинаться с согласной, после которой идёт гласная, и заканчиваться на гласную. Буквы в слове не повторяются. Сколько таких слов может составить Полина?",
        "images": [],
        "answer": "1800"
    },
    {
        "id": 1927,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Лена составляет пятибуквенные слова из букв Я, С, Н, О, В, И, Д, Е, Ц, причём слово должно начинаться с согласной и заканчиваться гласной. Первая и последняя буквы слова встречаются в нем только один раз; остальные буквы могут повторяться. Сколько слов может составить Лена?",
        "images": [],
        "answer": "6860"
    },
    {
        "id": 1926,
        "difficulty": "Уровень: Средний",
        "task": "(А. Куканова) Василиса составляет пятизначные числа в шестиричной системе счисления. Цифры в числе могут повторяться, но никакие две четные или две нечетные цифры не должны стоять рядом. Сколько чисел может составить Василиса?",
        "images": [],
        "answer": "405"
    },
    {
        "id": 1925,
        "difficulty": "Уровень: Средний",
        "task": "(А. Куканова) Аня составляет шестизначные числа в десятичной системе счисления. Цифры в числе не должны повторяться, и никакие две четные или две нечетные цифры не должны стоять рядом. Сколько чисел может составить Аня?",
        "images": [],
        "answer": "6480"
    },
    {
        "id": 1924,
        "difficulty": "Уровень: Средний",
        "task": "(А. Куканова) Лера составляет пятибуквенные слова из букв Л, О, Г, А, Р, И, Ф, М, причём никакие две гласные или две согласные не должны стоять рядом. Буквы в слове не должны повторяться. Сколько слов может составить Лера?",
        "images": [],
        "answer": "480"
    },
    {
        "id": 1923,
        "difficulty": "Уровень: Средний",
        "task": "(А. Куканова) Маша составляет четырёхбуквенные слова из букв П, И, Т, О, Н, причём никакие две гласные или две согласные не должны стоять рядом. Каждая буква может использоваться несколько раз или не использоваться вообще. Сколько слов может составить Маша?",
        "images": [],
        "answer": "72"
    },
    {
        "id": 1922,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Варя составляет пятизначные числа в шестнадцатеричной системе счисления, в которых цифры расположены в порядке не убывания. Сколько различных чисел может составить Варя?",
        "images": [],
        "answer": "11628"
    },
    {
        "id": 1921,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Аня составляет трёхзначные числа в десятичной системе счисления, в которых цифры расположены в порядке неубывания. Сколько различных чисел может составить Аня?",
        "images": [],
        "answer": "165"
    },
    {
        "id": 1919,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Куканова) Катя составляет трёхбуквенные слова из букв А, Б, В, Г, Д, причём буквы могут повторяться, но следуют друг за другом в алфавитном порядке. Сколько различных слов может составить Катя?",
        "images": [],
        "answer": "35"
    },
    {
        "id": 1852,
        "difficulty": "Уровень: Базовый",
        "task": "Ученица составляет 5-буквенные слова из букв ГЕПАРД. При этом в каждом слове ровно одна буква Г, слово не может начинаться на букву А и заканчиваться буквой Е. Какое количество слов может составить ученица?",
        "images": [],
        "answer": "2200"
    },
    {
        "id": 1747,
        "difficulty": "Уровень: Средний",
        "task": "(А. Богданов) МАРИНА из букв своего имени составила алфавит для генерации пятибуквенных слов. Буквы в слова могут входить любое количество раз, либо не входить совсем. Все слова записали в алфавитном порядке и пронумеровали с 1. На каком месте будет стоять слово НАИРИ ?",
        "images": [],
        "answer": "1922"
    },
    {
        "id": 1415,
        "difficulty": "Уровень: Базовый",
        "task": "Шифр кодового замка представляет собой последовательность из восьми символов, каждый из которых является либо буквой (A или B), либо цифрой (1, 2 или 3). Сколько различных вариантов шифра можно задать, если известно, что в коде присутствует ровно две буквы, а все другие символы являются цифрами.",
        "images": [],
        "answer": "81648"
    },
    {
        "id": 1288,
        "difficulty": "Уровень: Базовый",
        "task": "Вася составляет 6-буквенные слова, в которых могут быть использованы только буквы В, И, Ш, Н, Я, причём буква В используется не более одного раза. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Слово не должно начинаться с буквы Ш и оканчиваться гласными буквами. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?",
        "images": [],
        "answer": "4352"
    },
    {
        "id": 1241,
        "difficulty": "Уровень: Базовый",
        "task": "Руслан составляет 5-буквенные коды из букв Р, У, С, Л, А, Н. Каждая допустимая гласная буква может входить в код не более одного раза. Сколько кодов может составить Руслан?",
        "images": [],
        "answer": "4864"
    },
    {
        "id": 1216,
        "difficulty": "Уровень: Базовый",
        "task": "Определите количество шестизначных чисел в пятеричной системе счисления, которые не оканчиваются цифрами 3 и 4 и не начинаются с цифры 1.",
        "images": [],
        "answer": "5625"
    },
    {
        "id": 1191,
        "difficulty": "Уровень: Базовый",
        "task": "Определите количество пятизначных чисел в шестнадцатеричной системе счисления, которые не оканчиваются чётными цифрами и не начинаются с цифры 1.",
        "images": [],
        "answer": "458752"
    },
    {
        "id": 1050,
        "difficulty": "Уровень: Средний",
        "task": "Сколько шестнадцатеричных чисел длиной 15 можно составить, если известно, что четные и нечетные цифры чередуются и идут в порядке убывания?",
        "images": [],
        "answer": "2"
    },
    {
        "id": 989,
        "difficulty": "Уровень: Базовый",
        "task": "Маша выписывает в алфавитном порядке буквенные комбинации длиной 4, составленные из букв М, А, Р, И, Я. Какая комбинация записана под номером 211?  \nВот начало списка: \n1. АААА\n2. АААИ\n3. АААМ\n4. АААР\n5. АААЯ\n6. ААИА",
        "images": [],
        "answer": null
    },
    {
        "id": 988,
        "difficulty": "Уровень: Базовый",
        "task": "Маша выписывает в алфавитном порядке буквенные комбинации длиной 4, составленные из букв М, А, Р, И, Я. На какой позиции от начала списка будет комбинация АРИЯ?  \nВот начало списка: \n1. АААА\n2. АААИ\n3. АААМ\n4. АААР\n5. АААЯ\n6. ААИА",
        "images": [],
        "answer": "85"
    },
    {
        "id": 987,
        "difficulty": "Уровень: Средний",
        "task": "Семен составляет слова путем перестановки букв в слове КОБУРА. Сколько слов может составить Семен, если гласные и согласные буквы должны чередоваться? Под словом понимается любая буквенная последовательность, не обязательно осмысленная.",
        "images": [],
        "answer": "72"
    },
    {
        "id": 986,
        "difficulty": "Уровень: Базовый",
        "task": "Семен составляет слова из букв К, О, М, П, Е, Г, Э. Сколько слов длиной 6 может составить Семен? Если на первой и последних позициях могут быть только гласные буквы, на остальных – только согласные. Под словом понимается любая буквенная последовательность, не обязательно осмысленная. Каждая буква может входить в слово любое количество раз.",
        "images": [],
        "answer": "2304"
    },
    {
        "id": 985,
        "difficulty": "Уровень: Базовый",
        "task": "Семен составляет слова путем перестановки букв в слове БИТКОИН. Сколько слов может получить Семен? Под словом понимается любая буквенная последовательность, не обязательно осмысленная.",
        "images": [],
        "answer": "2520"
    },
    {
        "id": 947,
        "difficulty": "Уровень: Базовый",
        "task": "Петя составляет четырёхбуквенные коды из букв A, B, C, D, притом символы следуют слева направо в алфавитном порядке (буквы могут повторяться). Сколько различных кодовых слов может составить Петя?",
        "images": [],
        "answer": "35"
    },
    {
        "id": 920,
        "difficulty": "Уровень: Базовый",
        "task": "Евгения составляет буквенные последовательности из букв слова КРЕМНИЙ. Сколько комбинаций длиной 5 может составить Евгения, если известно, что в слове четное положительное количество гласных и буква Й встречается не более 2 раз или не встречается вовсе",
        "images": [],
        "answer": "5360"
    },
    {
        "id": 873,
        "difficulty": "Уровень: Базовый",
        "task": "Сергей составляет 6-буквенные коды из букв К, А, Л, И, Й. Буква Й может использоваться в коде не более одного раза, при этом она не может стоять на первом месте, на последнем месте и рядом с буквой И. Все остальные буквы могут встречаться произвольное количество раз или не встречаться совсем. Сколько различных кодов может составить Сергей?",
        "images": [],
        "answer": "6400"
    },
    {
        "id": 822,
        "difficulty": "Уровень: Средний",
        "task": "Катя составляет палиндромы – последовательности букв, которые читаются одинаково как слева направо, так и справа налево – путем перестановки букв фразы «Не гни папин ген». Сколько последовательностей может составить Катя?",
        "images": [],
        "answer": "360"
    },
    {
        "id": 797,
        "difficulty": "Уровень: Базовый",
        "task": "Иммануил составляет таблицу кодовых слов для передачи сообщений, каждому сообщению соответствует своё кодовое слово. В качестве кодовых слов Иммануил использует пятибуквенные слова, в которых могут быть буквы Ч, И, С, Т, Ы, Й, Р, А, З, У, М, причем буква Й может встречаться ровно один раз или не встречаться вовсе. Каждая из других допустимых букв может встречаться в кодовом слове любое количество раз или не встречаться совсем. Сколько различных кодовых слов может составить Иммануил?",
        "images": [],
        "answer": "150000"
    },
    {
        "id": 772,
        "difficulty": "Уровень: Базовый",
        "task": "Леонид составляет слова путем перестановки букв в слове ПРОБНИК. Известно, что любая последовательность должна начинаться и заканчиваться согласной буквой и не содержать двух подряд идущих гласных букв.Сколько последовательностей длиной 7 может составить Леонид?",
        "images": [],
        "answer": "1440"
    },
    {
        "id": 716,
        "difficulty": "Уровень: Базовый",
        "task": "Сколько существует способов разместить на книжной полке шесть книг, среди которых имеются четыре тома романа «Война и мир», которые должны стоять рядом (но не обязательно по порядку)?",
        "images": [],
        "answer": "144"
    },
    {
        "id": 691,
        "difficulty": "Уровень: Базовый",
        "task": "Все пятибуквенные слова, составленные из букв В, Е, Н, О, К, записаны в алфавитном порядке и пронумерованы, начиная с 1. Начало списка выглядит так:\n1. ВВВВВ\n2. ВВВВЕ\n3. ВВВВК\n4. ВВВВН\n5. ВВВВО\n6. ВВВЕВ\n…\nПод каким номером в списке идёт последнее слово, в котором буквы Н и К встречаются ровно по два раза?",
        "images": [],
        "answer": "2963"
    },
    {
        "id": 665,
        "difficulty": "Уровень: Базовый",
        "task": "Из букв слова КАНКАН составляются 6-буквенные последовательности.Сколько можно составить различных последовательностей, если известно, что в каждой из них содержится не менее 3 согласных?",
        "images": [],
        "answer": "656"
    },
    {
        "id": 620,
        "difficulty": "Уровень: Средний",
        "task": "Сколько существует чисел, восьмеричная запись которых содержит 7 цифр, причём все цифры различны и никакие две чётные и две нечётные цифры не стоят рядом.",
        "images": [],
        "answer": "1008"
    },
    {
        "id": 573,
        "difficulty": "Уровень: Средний",
        "task": "Определите, каких чисел больше.\n1. Шестизначных десятичных чисел, где все цифры разные и четные чередуются с нечетными цифрами.\n2. Четырехзначных десятичных чисел, где нет подряд идущих одинаковых цифр.\nВ ответ запишите номер варианта, для которого чисел больше, и разницу в количестве.\nНапример, если шестизначных десятичных чисел больше на 20, необходимо записать в ответ 120.",
        "images": [],
        "answer": "281"
    },
    {
        "id": 491,
        "difficulty": "Уровень: Базовый",
        "task": "Все 4-буквенные слова, составленные из букв П, Р, А, В, Д записаны в алфавитном порядке и пронумерованы.Вот начало списка:\n1.      АААА\n2.      АААВ\n3.      АААД\n4.      АААП\n5.      АААР\n6.      ААВА\n…\nНайдите номер первого слова в этом списке, которое не содержит гласных и одинаковых букв.",
        "images": [],
        "answer": "195"
    },
    {
        "id": 425,
        "difficulty": "Уровень: Базовый",
        "task": "Женя составляет слова переставляя буквы З, А, П, И, С, Ь. Сколько слов может составить Женя, если известно, что Ь не может стоять на первом месте и после гласной?",
        "images": [],
        "answer": "360"
    },
    {
        "id": 399,
        "difficulty": "Уровень: Базовый",
        "task": "Артур составляет 6-буквенные коды перестановкой букв слова ВОРОТА. При этом нельзя ставить рядом две гласные. Сколько различных кодов может составить Артур?",
        "images": [],
        "answer": "72"
    },
    {
        "id": 366,
        "difficulty": "Уровень: Средний",
        "task": "Иннокентий составляет 12-буквенные слова из букв О, С, Е, Н, Ь, Ю, П, Р, И, З, Ы, В. Каждую букву нужно использовать ровно 1 раз, при этом необходимо, чтобы гласные и согласные буквы шли попарно. Например, ОЕСНЬЮПРИЫЗВ. В рамках задачи мягкий знак считается гласной.\nСколько различных кодов может составить Иннокентий?",
        "images": [],
        "answer": "1036800"
    },
    {
        "id": 365,
        "difficulty": "Уровень: Базовый",
        "task": "Ипполит составляет 6-буквенные слова, в которых есть только буквы М, Е, Ч, Т, А, причём буква А используется в каждом слове хотя бы 3 раза. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Ипполит?",
        "images": [],
        "answer": "1545"
    },
    {
        "id": 364,
        "difficulty": "Уровень: Базовый",
        "task": "Стасик выписывает все шестисимвольные комбинации, составленные из букв А, Б, Г, О, Щ. При этом упорядочивая их в обратном алфавитном порядке.\nВот начало списка:\n1. ЩЩЩЩЩЩ\n2. ЩЩЩЩЩО\n3. ЩЩЩЩЩГ\n4. ЩЩЩЩЩБ\n5. ЩЩЩЩЩА\n6. ЩЩЩЩОЩ\n…\nОпределите, на какой позиции будет стоять слово ОБЩАГА",
        "images": [],
        "answer": "5115"
    },
    {
        "id": 363,
        "difficulty": "Уровень: Базовый",
        "task": "Стасик выписывает все пятисимвольные комбинации, составленные из букв Ш, К, О, Л, А. При этом упорядочивая их по алфавиту.\nВот начало списка:\nААААА\nААААК\nААААЛ\nААААО\nААААШ\n…\nОпределите, сколько слов хотя бы с одной гласной напишет Стасик.",
        "images": [],
        "answer": "2882"
    },
    {
        "id": 362,
        "difficulty": "Уровень: Базовый",
        "task": "Настя составляет 6-буквенные слова, в которых есть только буквы Д, Ж, О, Б, С, причём буквы Д, О, С встречатся строго по одному разу. Буква Ж всречается не более 2 раз. Б может встречаться любое количество раз или не встречаться вовсе. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может составить Настя?",
        "images": [],
        "answer": "840"
    },
    {
        "id": 361,
        "difficulty": "Уровень: Базовый",
        "task": "Вася составляет 4-буквенные слова, в которых есть только буквы С, Ч, И, Т, А, Й, причём буква А может встретиться в каждом слове не более 1 раза. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?",
        "images": [],
        "answer": "1125"
    },
    {
        "id": 360,
        "difficulty": "Уровень: Средний",
        "task": "Вася составляет 4 буквенные слова из букв И, Н, С, Т, А, В, К и упорядочивает их по алфавиту. При этом на первом месте может быть только согласная, на последнем – гласная. Укажите номер слова НИКА?\nНачало списка:\n1)      ВААА\n2)      ВААИ\n3)      ВАВА\n….",
        "images": [],
        "answer": "231"
    },
    {
        "id": 300,
        "difficulty": "Уровень: Базовый",
        "task": "Вася составляет 7-буквенные коды из букв К, А, Б, И, Н, Е, Т. Каждую букву нужно использовать ровно 1 раз, при этом код не может начинаться с буквы Б и не может содержать сочетания ЕА. Сколько различных кодов может составить Вася?",
        "images": [],
        "answer": "3720"
    },
    {
        "id": 265,
        "difficulty": "Уровень: Базовый",
        "task": "Все четырёхбуквенные слова, составленные из букв А, Л, Г, О, Р, И, Т, М записаны в алфавитном порядке и пронумерованы, начиная с 1. Начало списка выглядит так:\n1. АААА\n2. АААГ\n3. АААИ\n4. АААЛ\n5. АААМ\n6. АААО\n7. АААР\n8. АААТ\n9. ААГА\n…\nПод каким номером в списке идёт последнее слово, которое заканчивается на ИМ?",
        "images": [],
        "answer": "4053"
    },
    {
        "id": 209,
        "difficulty": "Уровень: Средний",
        "task": "Сколько существует чисел, делящихся на 5, десятичная запись которых содержит 7 цифр, причём все цифры различны и никакие две чётные и две нечётные цифры не стоят рядом.",
        "images": [],
        "answer": "2880"
    },
    {
        "id": 201,
        "difficulty": "Уровень: Базовый",
        "task": "Маша составляет 7-буквенные коды из букв П, Е, С, К, А, Р, Ь. Каждую букву нужно использовать ровно 1 раз, при этом код буква Ь не может стоять на первом месте, а также перед буквами Е, А и Р. Сколько различных кодов может составить Маша?",
        "images": [],
        "answer": "2520"
    },
    {
        "id": 200,
        "difficulty": "Уровень: Средний",
        "task": "Петя составляет 6-буквенные слова из букв К, О, М, Е, Т, А. Каждую букву нужно использовать ровно 1 раз, при этом нельзя ставить подряд две гласные или две согласные. Сколько различных кодов может составить Петя?",
        "images": [],
        "answer": "72"
    },
    {
        "id": 199,
        "difficulty": "Уровень: Средний",
        "task": "Петя составляет 5-буквенные слова из букв К, О, Л, У, Н. Каждую букву нужно использовать ровно 1 раз, при этом код при этом нельзя ставить подряд две гласные или две согласные. Сколько различных кодов может составить Петя?",
        "images": [],
        "answer": "12"
    },
    {
        "id": 198,
        "difficulty": "Уровень: Базовый",
        "task": "Вася составляет 5-буквенные коды из букв Н, И, Ч, Ь, Я. Каждую букву нужно использовать ровно 1 раз, при этом код не может начинаться с буквы Ь и не может содержать сочетания ЬИЯ. Сколько различных кодов может составить Вася?",
        "images": [],
        "answer": "92"
    },
    {
        "id": 197,
        "difficulty": "Уровень: Базовый",
        "task": "Вася составляет 5-буквенные коды из букв К, А, Л, И, Й. Каждую букву нужно использовать ровно 1 раз, при этом код не может начинаться с буквы Й и не может содержать сочетания ИА. Сколько различных кодов может составить Вася?",
        "images": [],
        "answer": "78"
    },
    {
        "id": 196,
        "difficulty": "Уровень: Базовый",
        "task": "Василий составляет 4-буквенные коды из букв Б, Е, Р, К, Л, И, Й. Каждую букву можно использовать любое количество раз, при этом код не может начинаться с буквы Й и должен содержать хотя бы одну гласную. Сколько различных кодов может составить Василий?",
        "images": [],
        "answer": "1558"
    },
    {
        "id": 195,
        "difficulty": "Уровень: Базовый",
        "task": "(М.В. Кузнецова) Вася составляет 5-буквенные слова, в которых есть только буквы С, Л, О, Н, причём в каждом слове используется буква О, но не более 3-х раз. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?",
        "images": [],
        "answer": "765"
    },
    {
        "id": 194,
        "difficulty": "Уровень: Базовый",
        "task": "Вася составляет 3-буквенные слова, в которых есть только буквы К, А, Т, Е, Р, причём буква Р используется в каждом слове хотя бы 2 раза. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?",
        "images": [],
        "answer": "13"
    },
    {
        "id": 193,
        "difficulty": "Уровень: Базовый",
        "task": "Вася составляет 4-буквенные слова, в которых есть только буквы Л, Е, Т, О, причём буква Е используется в каждом слове хотя бы 1 раз. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?",
        "images": [],
        "answer": "175"
    },
    {
        "id": 192,
        "difficulty": "Уровень: Базовый",
        "task": "Иван составляет 5-буквенные слова из букв А, Б, В, Г, Д, Я. В каждом слове содержится ровно три буквы Я. Сколько различных кодовых слов может составить Иван?",
        "images": [],
        "answer": "250"
    },
    {
        "id": 191,
        "difficulty": "Уровень: Базовый",
        "task": "Вася составляет 6-буквенные слова, в которых есть только буквы К, А, Н, Т, причём буква К используется в каждом слове ровно 2 раза. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?",
        "images": [],
        "answer": "1215"
    },
    {
        "id": 190,
        "difficulty": "Уровень: Базовый",
        "task": "Игорь составляет таблицу кодовых слов для передачи сообщений, каждому сообщению соответствует своё кодовое слово. В качестве кодовых слов Игорь использует 4-буквенные слова, в которых есть только буквы A, B, C, D, X, причём буква X появляется ровно 1 раз. Каждая из других допустимых букв может встречаться в кодовом слове любое количество раз или не встречаться совсем. Сколько различных кодовых слов может использовать Игорь?",
        "images": [],
        "answer": "256"
    },
    {
        "id": 189,
        "difficulty": "Уровень: Базовый",
        "task": "Вася составляет 6-буквенные слова, в которых есть только буквы К, Р, О, Т, причём буква О используется в каждом слове ровно 1 раз. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?",
        "images": [],
        "answer": "1458"
    },
    {
        "id": 188,
        "difficulty": "Уровень: Базовый",
        "task": "Иван составляет 5-буквенные слова из букв А, Б, В, Г, Э, Ю, Я. Первой и последней буквами этого слова могут быть только буквы Э, Ю или Я, на остальных позициях эти буквы не встречаются. Сколько различных кодовых слов может составить Иван?",
        "images": [],
        "answer": "576"
    },
    {
        "id": 187,
        "difficulty": "Уровень: Базовый",
        "task": "Алексей составляет таблицу кодовых слов для передачи сообщений, каждому сообщению соответствует своё кодовое слово. В качестве кодовых слов Алексей использует 5-буквенные слова, в которых есть только буквы A, B, C, X, причём буква X может появиться на последнем месте или не появиться вовсе. Сколько различных кодовых слов может использовать Алексей?",
        "images": [],
        "answer": "324"
    },
    {
        "id": 186,
        "difficulty": "Уровень: Базовый",
        "task": "Сколько слов длины 4, начинающихся с согласной буквы и заканчивающихся гласной буквой, можно составить из букв М, Е, Т, Р, О? Каждая буква может входить в слово несколько раз. Слова не обязательно должны быть осмысленными словами русского языка.",
        "images": [],
        "answer": "150"
    },
    {
        "id": 185,
        "difficulty": "Уровень: Базовый",
        "task": "Сколько слов длины 5, начинающихся с согласной буквы и заканчивающихся гласной буквой, можно составить из букв К, У, М, А? Каждая буква может входить в слово несколько раз. Слова не обязательно должны быть осмысленными словами русского языка.",
        "images": [],
        "answer": "256"
    },
    {
        "id": 184,
        "difficulty": "Уровень: Базовый",
        "task": "Сколько слов длины 6, начинающихся с согласной буквы, можно составить из букв Т, О, К? Каждая буква может входить в слово несколько раз. Слова не обязательно должны быть осмысленными словами русского языка.",
        "images": [],
        "answer": "486"
    },
    {
        "id": 183,
        "difficulty": "Уровень: Базовый",
        "task": "Сколько слов длины 4, начинающихся с согласной буквы, можно составить из букв Л, Е, Т, О? Каждая буква может входить в слово несколько раз. Слова не обязательно должны быть осмысленными словами русского языка.",
        "images": [],
        "answer": "128"
    },
    {
        "id": 91,
        "difficulty": "Уровень: Базовый",
        "task": "Иннокентий составляет семибуквенные слова из букв Е, И, Й, К, Н, О, Т. Каждая из допустимых букв может встречаться в кодовом слове любое количество раз или не встречаться совсем.  Сколько слов может составить Иннокентий, если известно, что в каждом из них есть комбинация КОТ?",
        "images": [],
        "answer": "11984"
    },
    {
        "id": 52,
        "difficulty": "Уровень: Базовый",
        "task": "Василий составляет 4-буквенные коды из букв Г, А, Ф, Н, И, Й. Каждую букву можно использовать любое количество раз, при этом код не может начинаться с буквы Й и должен содержать хотя бы одну гласную. Сколько различных кодов может составить Василий?",
        "images": [],
        "answer": "888"
    },
    {
        "id": 7,
        "difficulty": "Уровень: Базовый",
        "task": "Игорь составляет таблицу кодовых слов для передачи сообщений, каждому сообщению соответствует своё кодовое слово. В качестве кодовых слов Игорь использует трёхбуквенные слова, в которых могут быть только буквы Ш, К, О, Л, А, причём буква К появляется ровно 1 раз. Каждая из других допустимых букв может встречаться в кодовом слове любое количество раз или не встречаться совсем. Сколько различных кодовых слов может использовать Игорь?",
        "images": [],
        "files": [],
        "answer": "48"
    }
]