[
    {
        "id": 19878,
        "difficulty": "Уровень: Средний",
        "task": "(М. Попков) Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– в строке ровно одно число повторяется трижды, остальные числа различны;\n– среднее арифметическое неповторяющихся чисел не больше повторяющегося числа.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\19878_Vh3gHxPGv.xlsx"
        ],
        "answer": "58"
    },
    {
        "id": 19702,
        "difficulty": "Уровень: Средний",
        "task": "(М. Попков) В исследовательском центре «Галактика» учёный Максим обнаружил файл электронной таблицы, содержащий в каждой строке шесть натуральных чисел. Его миссия — определить количество строк, в которых хотя бы четыре числа могут образовывать арифметическую прогрессию с ненулевой разностью. Только найденное количество строк позволит активировать защитный механизм станции. В ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\19702_skQbirhOo.xlsx"
        ],
        "answer": "52"
    },
    {
        "id": 19701,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Попков) В секретном агентстве «Ночной Щит» аналитик Максим получил зашифрованный файл электронной таблицы, в каждой строке которого содержится семь натуральных чисел. Его миссия — определить количество строк, в которых содержится значение, равное среднему арифметическому чисел этой строки. Только найденное количество строк позволит команде раскрыть международный заговор. В ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\19701_U4qlH3ZFX.xlsx"
        ],
        "answer": "104"
    },
    {
        "id": 19700,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Попков) Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– в строке только одно число повторяется дважды, остальные числа различны;\n– сумма наибольшего и наименьшего чисел меньше суммы трех оставшихся.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\19700_SJsulhCwa.xlsx"
        ],
        "answer": "1594"
    },
    {
        "id": 19699,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Попков) Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, в которых сумма наибольшего и наименьшего чисел не меньше суммы трех оставшихся.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\19699_M8toxliNK.xlsx"
        ],
        "answer": "835"
    },
    {
        "id": 19241,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите наибольший номер строки таблицы, для чисел которой выполнены оба условия:\n    – в строке есть ровно два числа, каждое из которых повторяется трижды, и одно число без повторений;\n    – среднее арифметическое повторяющихся чисел строки меньше неповторяющегося числа.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\19241_OZyftw5RLF.xlsx"
        ],
        "answer": "17975"
    },
    {
        "id": 19228,
        "difficulty": "Уровень: Средний",
        "task": "(А. Левченко) В файле электронной таблицы в каждой строке записаны шесть натуральных чисел. Определите количество строк таблицы, для которых\nвыполнены оба условия:\n– в строке только одно число повторяется 4 раза;\n– квадрат числа, которое повторяется 4 раза, меньше суммы оставшихся чисел строки.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\19228_spP0A6Z1n.xls"
        ],
        "answer": "2"
    },
    {
        "id": 19117,
        "difficulty": "Уровень: Средний",
        "task": "(В. Лашин) Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнено хотя бы одно условие:\n– В строке одно число повторяется дважды, остальные различны;\n– Выполнены следующие два условия:\n    1. Сумма чётных чисел строки больше суммы нечётных;\n    2. В строке существуют как чётные числа, так и нечётные числа.\n  В ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\19117_QuVQcuJv1S.xlsx"
        ],
        "answer": "13255"
    },
    {
        "id": 18943,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Бахтиев) Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите количество строк таблицы, содержащих числа, для чисел которых выполнены оба условия:\n– в строке есть одно число, которое повторяется трижды, одно число, которое повторяется дважды и два числа, которые различны;\n– cумма различных повторяющихся чисел не меньше суммы неповторяющихся чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\18943_1sNlRniGJa.xls"
        ],
        "answer": "32"
    },
    {
        "id": 18924,
        "difficulty": "Уровень: Средний",
        "task": "(М. Попков) Снежная Королева решила проверить своих подданных на умение решать загадки. Для этого она создала волшебную таблицу, в которой каждую строку заполнила шестью натуральными числами.\nКоролева объявила, что только те, кто сможет разгадать её загадку, смогут получить её благосклонность и защиту от зимних холодов. Вот условия, которые она установила:\nВ каждой строке таблицы должно быть ровно одно число, которое повторяется трижды. Остальные три числа должны быть различными.\nСумма квадратов всех повторяющихся чисел строки должна быть больше квадрата суммы всех неповторяющихся чисел строки.\nВам нужно определить количество строк в таблице, которые не соответствуют двум условиям одновременно.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\18924_6nLkADwVvh.xlsx"
        ],
        "answer": "9997"
    },
    {
        "id": 18594,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Бахтиев) Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных чисел. Определите количество строк таблицы, для чисел которой выполнены оба условия:\n– количество чётных и нечётных чисел в строке одинаково;\n– квадрат наименьшего числа не превышает сумму трёх оставшихся чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\18594_VWASCMS4E9.xlsx"
        ],
        "answer": "2439"
    },
    {
        "id": 18364,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– в строке есть повторяющиеся числа; \n– утроенная сумма неповторяющихся чисел строки не больше произведения повторяющихся чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\18364_iFf4bDLeS.xls"
        ],
        "answer": "2766"
    },
    {
        "id": 18174,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Бахтиев) Откройте файл электронной таблицы, содержащей в каждой строке шесть целых чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– в строке только одно число повторяется дважды, остальные числа различны;\n– сумма всех отрицательных чисел строки по модулю больше суммы всех положительных чисел в этой строке\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\18174_IidrsKrDX.xlsx"
        ],
        "answer": "44"
    },
    {
        "id": 18134,
        "difficulty": "Уровень: Средний",
        "task": "(В. Колчев) Откройте файл электронной таблицы, содержащей в каждой строке шесть натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– в строке два числа, которые повторяются дважды, остальные числа различны;\n– квадрат большего из повторяющихся больше произведения неповторяющихся.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\18134_QV6e2GO5N.xls"
        ],
        "answer": "4278"
    },
    {
        "id": 17968,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия: \n– наибольшее из четырёх чисел меньше суммы трёх других; \n– сумма чётных чисел равна сумме нечётных. \nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\17968_UI20FcooY.xlsx"
        ],
        "answer": "13"
    },
    {
        "id": 17863,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке шесть натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– в строке только одно число повторяется трижды, остальные числа различны;\n– квадрат суммы всех повторяющихся чисел строки больше квадрата суммы всех её неповторяющихся чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\17863_iARG8AcSb.xls"
        ],
        "answer": "273"
    },
    {
        "id": 17770,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Бахтиев) Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– удвоенная сумма двух наибольших чисел в строке больше утроенной суммы остальных чисел\n– не менее двух чисел в строке оканчиваются цифрой 5\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\17770_bBwsFDRuG.xlsx"
        ],
        "answer": "35"
    },
    {
        "id": 17672,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, в которых сумма наибольшего и наименьшего чисел меньше суммы двух оставшихся.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\17672_ZRbz79O-b.xls"
        ],
        "answer": "9997"
    },
    {
        "id": 17628,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, в которых сумма наибольшего и наименьшего чисел не больше суммы двух оставшихся.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\17628_cY9W7L5fB.xlsx"
        ],
        "answer": "15115"
    },
    {
        "id": 17550,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке шесть натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– в строке только одно число повторяется трижды, остальные числа различны; \n– квадрат суммы всех повторяющихся чисел строки больше квадрата суммы всех её неповторяющихся чисел. \nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\17550_SkLssLJq6.xlsx"
        ],
        "answer": "19"
    },
    {
        "id": 17522,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия: \n– наибольшее из четырёх чисел меньше суммы трёх других; \n– среди четырёх чисел есть только одна пара равных чисел. \nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\17522_AerfLn3ms.xlsx"
        ],
        "answer": "147"
    },
    {
        "id": 15321,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n–    максимальное число строки меньше суммы трёх оставшихся чисел; \n–    четыре числа строки можно разбить на две пары чисел с равными суммами. \nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\15321_EYbEEMtmC.xlsx"
        ],
        "answer": "128"
    },
    {
        "id": 14254,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите количество строк таблицы, для чисел которых выполняется только одно из условий:\n— произведение наименьшего и наибольшего чисел строки меньше утроенной суммы оставшихся чисел;\n— сумма неповторяющихся чисел строки не больше суммы повторяющихся чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\14254_qOWILyZ2t.xls"
        ],
        "answer": "6988"
    },
    {
        "id": 14253,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите количество строк таблицы, для чисел которых выполнено хотя бы одно из условий:\n— в строке есть ровно три числа, каждое из которых повторяется дважды, и одно число без повторений;\n— среднее арифметическое всех чисел строки является полным квадратом.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\14253_ZofBbmOWo.xls"
        ],
        "answer": "6825"
    },
    {
        "id": 14252,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите количество строк таблицы, для чисел которых выполнены оба условия:\n– в строке есть одно число, которое повторяется четырежды, а остальные три числа различны;\n– среднее арифметическое всех неповторяющихся чисел строки меньше среднего арифметического всех её чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\14252_NvONzklu8.xlsx"
        ],
        "answer": "17"
    },
    {
        "id": 14251,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите сумму всех чисел в строке таблицы с наименьшим номером, для чисел которой выполнены оба условия:\n— в строке есть два числа, каждое из которых повторяется дважды, остальные три числа различны;\n— сумма всех повторяющихся чисел строки не больше суммы всех нечётных чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\14251_DxEmXDWAm.xls"
        ],
        "answer": "626"
    },
    {
        "id": 14250,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) Откройте файл электронной таблицы, содержащей в каждой строке шесть натуральных чисел. Определите сумму номеров строк таблицы, для чисел которых выполнены оба условия:\n– в строке все числа различны;\n– куб разности наибольшего и наименьшего чисел не меньше квадрата суммы четырёх оставшихся.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\14250_Z2JlYgnDG.xlsx"
        ],
        "answer": "57879735"
    },
    {
        "id": 13865,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите количество строк таблицы, для чисел которых выполняется только одно из условий:\n– все числа различны;\n– удвоенная сумма максимального и минимального чисел строки не превышает утроенной суммы оставшихся чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\13865_N0eK_0hIQ.xls"
        ],
        "answer": "3407"
    },
    {
        "id": 12918,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке шесть натуральных чисел. Определите сумму чисел в строке таблицы с наименьшим номером, для которой выполнены все условия:\nв строке есть два числа, которые повторяются дважды, остальные два числа различны;\nмаксимальное число строки не повторяется;\nпроизведение максимального и минимального чисел строки больше суммы оставшихся четырёх чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\12918_sH9BT9dKN.xlsx"
        ],
        "answer": "138"
    },
    {
        "id": 12797,
        "difficulty": "Уровень: Средний",
        "task": "(М. Попков) Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных чисел. Определите количество строк таблицы, для чисел которых выполнены следующие условия:\n– в строке есть только одно число, которое повторяется дважды, остальные два числа различны;\n– все неповторяющиеся числа нечетны, повторяющиеся числа чётны.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\12797_VYN1h7UCU.xlsx"
        ],
        "answer": "53"
    },
    {
        "id": 12795,
        "difficulty": "Уровень: Средний",
        "task": "(М. Попков) Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите количество строк таблицы, в которых содержится число, равное целой части среднего арифметического всех чисел в строке.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\12795_cz6jDESQE.xlsx"
        ],
        "answer": "35"
    },
    {
        "id": 12726,
        "difficulty": "Уровень: Средний",
        "task": "(C. Горбачёв) Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Найдите наибольший номер строки таблицы, для чисел которой выполнены оба условия:\n\n– в строке есть одно число, которое повторяется трижды, остальные числа различны;\n– количество чётных чисел превышает количество нечётных.\n\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\12726_L-vO3SuF3.xls"
        ],
        "answer": "15293"
    },
    {
        "id": 12490,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите количество строк таблицы, для чисел которых выполнены оба условия:\n— в строке есть ровно одно число, которое повторяется дважды, а остальные числа различны;\n— максимальное число строки повторяется столько же раз, сколько и минимальное.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\12490_1LmpNQwVY.xls"
        ],
        "answer": "349"
    },
    {
        "id": 12463,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке девять натуральных чисел. Определите количество строк таблицы, для чисел которых выполнены оба условия:\n - в строке есть одно число, которое повторяется четыре раза, есть другое число, которое повторяется дважды, остальные три числа различны;\n - среднее арифметическое трёх неповторяющихся чисел строки не меньше наибольшего из повторяющихся в строке чисел.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\12463_mYVvuVljQ.xlsx"
        ],
        "answer": "647"
    },
    {
        "id": 12241,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите количество строк таблицы, для чисел которых выполнены оба условия:\n— в строке есть ровно три числа, каждое из которых повторяется дважды, и одно число без повторений;\n— среднее арифметическое минимального и максимального среди повторяющихся чисел строки меньше неповторяющегося числа.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\12241_U6WoKmyVQ.xls"
        ],
        "answer": "3382"
    },
    {
        "id": 12098,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Попков) Дед Мороз поспорил с Санта-Клаусом, что в совершенстве владеет электронными таблицами, хотя обычно всей отчетностью занимаются его помощники. Чтобы сохранить репутацию Деда Мороза, помогите ему не опозориться перед Санта-Клаусом. Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, для чисел которых выполнены все условия:\n– в строке есть одно число, которое повторяется ровно 3 раза;\n– повторяющееся число нечетно;\n– неповторяющееся число четно.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\12098_h2lSHAMtN.xlsx"
        ],
        "answer": "11"
    },
    {
        "id": 11946,
        "difficulty": "Уровень: Средний",
        "task": "(PRO100 ЕГЭ) Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите количество строк таблицы, для чисел которых выполнено не более одного условия:\n– в строке есть одно число, которое повторяется трижды, остальные четыре числа различны;\n– числа в строке расположены в порядке неубывания.\nВ ответе запишите только число.",
        "images": [],
        "files": ["tasks_json\\task_9\\files\\11946.xlsx"],
        "answer": "14018"
    },
    {
        "id": 11830,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите количество строк таблицы, для чисел которых выполнены оба условия:\n– в строке есть два числа, каждое из которых повторяется дважды, остальные три числа различны;\n– произведение всех повторяющихся чисел строки более чем вдвое превосходит произведение неповторяющихся чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\11830_mF6aPxY4w.xls"
        ],
        "answer": "162"
    },
    {
        "id": 11658,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите наибольший номер строки таблицы, для чисел которой выполнены оба условия:\n– в строке есть одно число, которое повторяется трижды, остальные четыре числа различны;\n– среднее арифметическое всех повторяющихся чисел строки больше среднего арифметического всех её чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\11658_JehR964TR.xls"
        ],
        "answer": "15958"
    },
    {
        "id": 10910,
        "difficulty": "Уровень: Средний",
        "task": "В файле электронной таблицы в каждой строке записаны 6 натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены следующие условия:\n– минимальное число не повторяется;\n– среди остальных чисел строки есть повторяющиеся;\n– сумма максимального и минимального чисел строки меньше, чем сумма повторяющихся чисел.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\10910_DTTj0gb1i.xls"
        ],
        "answer": "447"
    },
    {
        "id": 10091,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите количество строк таблицы, для чисел которых выполнены оба условия:\n– в строке есть два числа, каждое из которых повторяется дважды, остальные три числа различны;\n– среднее арифметическое всех повторяющихся чисел строки меньше среднего арифметического всех её чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\10091_ujYtwt6bX.xls"
        ],
        "answer": "83"
    },
    {
        "id": 10026,
        "difficulty": "Уровень: Средний",
        "task": "(С. Чайкин) Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите сумму номеров строк таблицы, для чисел которой выполнено хотя бы одно условие:\n– числа в строке расположены в порядке возрастания;\n– в строке есть повторяющиеся числа.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\10026_Kd_0ZUl21.csv"
        ],
        "answer": "274725"
    },
    {
        "id": 9832,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите сумму всех чисел в строке таблицы с наименьшим номером, для чисел которой выполнены оба условия:\n— в строке есть два числа, каждое из которых повторяется дважды, остальные три числа различны;\n— максимальное число строки не повторяется.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\9832_LbhxBxvcF.xls"
        ],
        "answer": "261"
    },
    {
        "id": 9778,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке шесть натуральных чисел. Определите наименьший номер строки таблицы, для чисел которой выполнены оба условия:\n— в строке есть только одно число, которое повторяется дважды, остальные четыре числа различны;\n— повторяющееся число строки не меньше, чем среднее арифметическое четырёх её неповторяющихся чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\9778_eX154PNow.xlsx"
        ],
        "answer": "34"
    },
    {
        "id": 9740,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите количество строк таблицы, содержащих числа, для чисел которых выполнены оба условия:\n– в строке есть одно число, которое повторяется трижды, остальные четыре числа различны;\n– среднее арифметическое неповторяющихся чисел строки не больше повторяющегося числа.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\9740_MCeCHdneS.xls"
        ],
        "answer": "36"
    },
    {
        "id": 9696,
        "difficulty": "Уровень: Средний",
        "task": "(А.Богданов) В файле электронной таблицы в каждой строке записаны четыре натуральных числа. Определите количество строк таблицы, для которых выполнены следующие условия:\n - только одно число встречается в строке дважды\n - сумма двух самых больших чисел строки более чем в два раза больше суммы двух самых малых\n - максимальное число строки не кратно минимальному",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\9696_6tU4Wdefq.csv"
        ],
        "answer": "125"
    },
    {
        "id": 9539,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполняются оба условия:\n•    в строке есть две пары повторяющихся значений;\n•    не повторяющееся  число больше значений одной пары и меньше значений другой.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\9539_Aq8uUJeYs.xlsx"
        ],
        "answer": "2"
    },
    {
        "id": 9364,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполняется ровно одно из двух условий:\n- сумма всех нечетных значений больше суммы четных значений (если чисел с определенным признаком четности нет, то считаем сумму равной нулю);\n- в строке одно число повторяется дважды, остальные числа различны.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\9364_AzDLEJQPy.xlsx"
        ],
        "answer": "482"
    },
    {
        "id": 9156,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– сумма максимального и минимального значений кратна 3;\n– четыре числа можно разбить на две пары так, чтобы разность значений в парах была одинаковой.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\9156_Th4hTtDMZ.xlsx"
        ],
        "answer": "6"
    },
    {
        "id": 9062,
        "difficulty": "Уровень: Средний",
        "task": "(А.Богданов) В файле электронной таблицы в каждой строке записаны 4 натуральных числа. Определите количество строк таблицы, содержащих числа, для которых выполнены следующие условия:\n– в строке первое и последнее число не являются минимальным и максимальным числом строки;\n– разность максимального и минимального числа кратна разности оставшейся пары чисел.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\9062_72FRKzOhM.csv"
        ],
        "answer": "276"
    },
    {
        "id": 8946,
        "difficulty": "Уровень: Базовый",
        "task": "(Е. Джобс) Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– квадрат наибольшего значения больше произведения остальных чисел;\n– сумма двух наибольших значений как минимум вдвое больше суммы остальных значений в строке..\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\8946_2ip8kIbeg.xlsx"
        ],
        "answer": "10"
    },
    {
        "id": 8667,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Шагитов) Откройте файл электронной таблицы, содержащий в каждой строке шесть целых чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– все числа различны;\n– пятикратная сумма наименьшего и наибольшего чисел в строке больше или равна трехкратной сумме четырех оставшихся чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\8667_g94WZ3e9V.xlsx"
        ],
        "answer": "3333"
    },
    {
        "id": 8666,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Шагитов) Откройте файл электронной таблицы, содержащий в каждой строке шесть целых чисел. Определите количество строк таблицы, содержащих числа, для которых выполнено ровно одно из следующих условий:\n– все числа различны;\n– наибольшее число в строке больше суммы остальных чисел в этой строке.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\8666_X3X3_NguR.xlsx"
        ],
        "answer": "2222"
    },
    {
        "id": 8609,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел.\nОпределите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n- каждое число в строке встречается по одному разу,\n- удвоенная сумма максимального и минимального значений не превышает утроенной суммы оставшихся чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\8609_1pnotLUsH.xls"
        ],
        "answer": "2776"
    },
    {
        "id": 8554,
        "difficulty": "Уровень: Средний",
        "task": "(В. Рыбальченко)В файле в каждой строке содержится 5 целых чисел. Необходимо посчитать количество строк, в которых выполняется оба условия:\n– Ровно три числа заканчиваются цифрой 3;\n– Квадрат суммы положительных чисел меньше квадрата суммы отрицательных чисел.\nВ ответ запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\8554_pjfBkV-tR.xlsx"
        ],
        "answer": "23"
    },
    {
        "id": 8497,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– все числа различны;\n– утроенная сумма минимального и максимального чисел строки не меньше, чем удвоенная сумма трёх её оставшихся чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\8497_zXhQYDHKm.xlsx"
        ],
        "answer": "7695"
    },
    {
        "id": 8467,
        "difficulty": "Уровень: Средний",
        "task": "(В. Рыбальченко) В каждой строке файла содержится 5 натуральных чисел. Необходимо посчитать количество строк, в которых выполняется только одно условие из:\n– Все числа различны;\n– Удвоенная сумма максимального и минимального меньше суммы трех оставшихся чисел.\nВ ответ запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\8467_yYTaVgqWe.xlsx"
        ],
        "answer": "4720"
    },
    {
        "id": 8153,
        "difficulty": "Уровень: Средний",
        "task": "(А. Рогов) Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– в строке все числа различны;\n– сумма наибольшего и наименьшего чисел меньше суммы трёх других;\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\8153_-XRxkf-19.xls"
        ],
        "answer": "2842"
    },
    {
        "id": 7995,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– все числа в строке различны;\n– квадрат суммы максимального и минимального чисел из строки не меньше произведения трёх оставшихся.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\7995_Ne9wDmiFP.xlsx"
        ],
        "answer": "121"
    },
    {
        "id": 7837,
        "difficulty": "Уровень: Базовый",
        "task": "(А.Богданов) Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n- все числа в строке различны;\n- удвоенная медиана (центральный элемент, меньше и больше которого ровно по два числа) больше максимального числа и утроенного минимального числа\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\7837_X3ewqEWi7.xlsx"
        ],
        "answer": "2914"
    },
    {
        "id": 7811,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Ишимов) Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– в строке все числа различны;\n– сумма максимального и минимального чисел строки более чем в четыре раза меньше утроенной суммы трёх оставшихся.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\7811_TTakcXiZz.xlsx"
        ],
        "answer": "11420"
    },
    {
        "id": 7697,
        "difficulty": "Уровень: Базовый",
        "task": "(Грачев Н.) Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены хотя бы одно условие:\n– все числа в строке равны 18;\n– сумма всех чисел строки делится на 18 без остатка.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\7697_pVvOFhIbw.xlsx"
        ],
        "answer": "923"
    },
    {
        "id": 7611,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– все числа в строке различны;\n– удвоенная сумма максимального и минимального чисел из строки не меньше суммы трёх оставшихся.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\7611_NWYIDefXW.xlsx"
        ],
        "answer": "15058"
    },
    {
        "id": 7588,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел.\n\nОпределите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n- каждое число в строке встречается по одному разу,\n- утроенная сумма максимального и минимального значений не превышает удвоенной суммы оставшихся чисел.\n\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\7588_HMTizHDz3.xls"
        ],
        "answer": "853"
    },
    {
        "id": 7350,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) Откройте файл электронной таблицы, содержащей в каждой строке три двузначных натуральных числа. Определите количество строк таблицы, в которых произведение цифр всех чисел больше суммы всех чисел.\nНапример, в строке: 15, 22, 36 произведение цифр = 1*5*2*2*3*6, а сумма всех чисел = 15+22+36.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\7350_NJ6UmjHsg.xlsx"
        ],
        "answer": "3649"
    },
    {
        "id": 7335,
        "difficulty": "Уровень: Средний",
        "task": "(М. Шагитов)  Определите количество строк в электронной таблице, каждая из которых содержит четыре натуральных числа и соответствует только одному из следующих критериев:\n– В строке нет повторяющихся чисел, а целая часть среднего арифметического максимального и минимального чисел присутствует в строке.\n– В строке есть повторяющиеся числа, и сумма квадратов этих чисел меньше суммы квадратов неповторяющихся чисел.\nПодсчитайте количество строк, удовлетворяющих только одному из этих условий, и укажите результат в ответе.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\7335_wyRRNhG_i.xls"
        ],
        "answer": "1151"
    },
    {
        "id": 6999,
        "difficulty": "Уровень: Базовый",
        "task": "В файле электронной таблицы в каждой строке содержатся шесть неотрицательных целых чисел. Определите количество строк таблицы, для которых выполнены оба условия:\n– в строке ровно три числа кратных трем;\n– размах чисел строки не больше суммы чисел строки, кратных 3.\nПримечание. Размах — это разность между наибольшим и наименьшим значениями в наборе данных. Например, для набора 2 3 6 4 7 5, размах будет 7 – 2 = 5.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\6999_eb4DfuYiJ.xlsx"
        ],
        "answer": "1835"
    },
    {
        "id": 6898,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– наибольшее из четырёх чисел меньше суммы трёх других;\n– четыре числа можно разбить на две пары чисел с равными суммами.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\6898_6YyOnQOpM.csv"
        ],
        "answer": "116"
    },
    {
        "id": 6897,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– наибольшее из четырёх чисел меньше суммы трёх других;\n– четыре числа нельзя разбить на две пары чисел с равными суммами.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\6897_72HTzEd23.csv"
        ],
        "answer": "2396"
    },
    {
        "id": 6744,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, в которых сумма наибольшего и наименьшего чисел меньше суммы двух оставшихся.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\6744__AaVTRxTU.xlsx"
        ],
        "answer": "1503"
    },
    {
        "id": 6602,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке шесть неотрицательных целых чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– в строке только одно число повторяется ровно два раза, остальные числа различны;\n– среднее арифметическое неповторяющихся чисел строки не меньше суммы повторяющихся чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\6602_tmnY6t7Dk.xls"
        ],
        "answer": "64"
    },
    {
        "id": 6262,
        "difficulty": "Уровень: Средний",
        "task": "(А.Богданов) Откройте файл электронной таблицы, содержащей в каждой строке шесть натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнено строго одно из условий:\n – в строке есть повторяющиеся числа;\n – в строке есть ровно три нечетных числа.\n В ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\6262_zbcFtwk2f.csv"
        ],
        "answer": "1852"
    },
    {
        "id": 6041,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– все числа в строке различны;\n– максимальное число строки меньше суммы оставшихся чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\6041_eDtUkKjII.xlsx"
        ],
        "answer": "2321"
    },
    {
        "id": 6016,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– все числа в строке различны;\n– квадрат максимального числа строки меньше суммы квадратов оставшихся чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\6016_QbIyYQkjB.xlsx"
        ],
        "answer": "1312"
    },
    {
        "id": 5946,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке шесть натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия: \n– в строке все числа различны;\n– количество чётных чисел превышает количество нечётных чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\5946_iDzTk6X3l.xlsx"
        ],
        "answer": "1078"
    },
    {
        "id": 5917,
        "difficulty": "Уровень: Средний",
        "task": "(А. Игнатюк) В файле электронной таблицы содержатся строки, в каждой из которых находится 5 чисел. Необходимо найти количество строк, удовлетворяющих следующим условиям:\n- В строке нет повторяющихся чисел;\n- Квадрат среднего по значению числа в строке меньше произведения максимального и минимального числа\nВ качестве ответа укажите количество подходящих строк.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\5917__tDiEilny.xlsx"
        ],
        "answer": "361"
    },
    {
        "id": 5724,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Тараскин) Робот-эхолот изучает морское дно вдоль побережья. Каждая контрольная точка промеряется в 5 разных последовательных участках. Задача робота - посчитать количество холмов в бухте. Холмом считается пятерка чисел, в которой значения глубин сначала строго убывают, а затем строго возрастают. Все пятерки чисел робот записал в электронную таблицу. Сколько холмов обнаружилось в бухте?\nНапример, последовательность глубин 10 5 2 20 30 считается холмом. Последовательности 10 2 5 20 30 и 10 8 4 1 15 тоже считаются холмом. 1 2 3 4 5 это не холм",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\5724_i7-r1PyyZ.xlsx"
        ],
        "answer": "116"
    },
    {
        "id": 5707,
        "difficulty": "Уровень: Средний",
        "task": "В каждой строке электронной таблицы содержится 6 натуральных чисел. Необходимо найти количество строк, где сумма квадратов трёх минимальных чисел больше произведения трёх максимальных.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\5707_ESsF6SCuE.xlsx"
        ],
        "answer": "0"
    },
    {
        "id": 5664,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Игнатюк) В каждой строке электронной таблицы содержится 3 натуральных числа. Необходимо найти количество строк, где хотя бы одно любое произведение двух чисел оканчивается на 4.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\5664_Kk-uMeA9h.xlsx"
        ],
        "answer": "965"
    },
    {
        "id": 5627,
        "difficulty": "Уровень: Средний",
        "task": "(М. Ишимов) Откройте файл электронной таблицы, содержащей в каждой строке шесть натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнено хотя бы одно из условий:\n–   в строке есть хотя бы одно повторяющееся число;\n–   будучи упорядоченными, все числа строки образуют арифметическую прогрессию.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\5627_y4M7HzJ2k.xlsx"
        ],
        "answer": "525"
    },
    {
        "id": 5489,
        "difficulty": "Уровень: Средний",
        "task": "В каждой строке электронной таблицы записаны пять неотрицательных чисел. Определите, сколько в таблице строк, для которых выполнены следующие условия:\n– все числа в строке различны;\n– чётных чисел больше, чем нечётных;\n– сумма чётных чисел меньше суммы нечётных.\nВ ответе запишите число – количество строк, для которых выполнены эти условия.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\5489_o4Eon06Js.xlsx"
        ],
        "answer": "241"
    },
    {
        "id": 5452,
        "difficulty": "Уровень: Средний",
        "task": "(С. Якунин) В файле электронной таблицы в каждой строке содержатся пять натуральных чисел. Определите количество строк таблицы, содержащих ровно одну пару одинаковых чисел.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\5452_n_Z0z6wlE.xlsx"
        ],
        "answer": "326"
    },
    {
        "id": 5451,
        "difficulty": "Уровень: Средний",
        "task": "(С. Якунин) В файле электронной таблицы в каждой строке содержатся пять натуральных чисел. Определите количество строк таблицы, содержащих цепочку из не менее трёх последовательных нечётных чисел. Пример подходящей строки: 2 3 7 11 8.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\5451_Fei5BUa1s.xlsx"
        ],
        "answer": "248"
    },
    {
        "id": 5431,
        "difficulty": "Уровень: Базовый",
        "task": "В каждой строке таблицы приведено 5 чисел. Найдите количество строк, в которых квадрат максимального значения в строке больше произведения оставшихся четырех чисел.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\5431_bI9w_ha35.xlsx"
        ],
        "answer": "2"
    },
    {
        "id": 5284,
        "difficulty": "Уровень: Средний",
        "task": "(А. Рогов) Откройте файл электронной таблицы, содержащей в каждой строке шесть натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнено хотя бы одно из условий:\n– квадрат суммы наибольшего и наименьшего из чисел больше суммы квадратов четырех оставшихся чисел;\n– в строке ровно одно число повторяется три раза, остальные числа в строке различны.\nВ ответе запишите только число — количество подходящих строк.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\5284_-vu8K--Io.xls"
        ],
        "answer": "4209"
    },
    {
        "id": 5235,
        "difficulty": "Уровень: Базовый",
        "task": "В файле электронной таблицы в каждой строке содержатся шесть натуральных чисел. Определите количество строк, в которых сумма чисел во всех возможных парах чётная.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\5235_bU_ghUyTE.xls"
        ],
        "answer": "29"
    },
    {
        "id": 5126,
        "difficulty": "Уровень: Средний",
        "task": "(А. Рогов) Откройте файл электронной таблицы, содержащей в каждой строке шесть натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– в строке только одно число повторяется ровно три раза, остальные числа различны;\n– среднее арифметическое неповторяющихся чисел строки не больше суммы повторяющихся чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\5126_9yLNISRDc.xls"
        ],
        "answer": "125"
    },
    {
        "id": 4756,
        "difficulty": "Уровень: Средний",
        "task": "В файле электронной таблицы в каждой строке содержатся шесть натуральных чисел. Определите количество строк, в которых числа можно разбить на три пары, состоящие из одинаковых чисел. Пример: шестёрку 1 2 3 3 1 2 можно разбить на пары 1-1 2-2 3-3.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\4756_NOCNf4zy0.xls"
        ],
        "answer": "3"
    },
    {
        "id": 4755,
        "difficulty": "Уровень: Средний",
        "task": "(А. Рогов) В файле электронной таблицы в каждой строке содержатся шесть натуральных чисел. Определите количество строк таблицы, для которых выполнены оба условия:\n– в строке хотя бы одно число повторяется дважды (ровно 2 раза);\n– каждое из повторяющихся дважды (ровно 2 раза) чисел превышает каждое неповторяющееся.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\4755_5yeYglDy5.xls"
        ],
        "answer": "665"
    },
    {
        "id": 4697,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке шесть натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия: \n– в строке только одно число повторяется ровно два раза, остальные числа различны;\n– среднее арифметическое неповторяющихся чисел строки не больше суммы повторяющихся чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\4697_PUSCp2_bp.xlsx"
        ],
        "answer": "2241"
    },
    {
        "id": 4669,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, в которых сумма максимального и минимального чисел меньше суммы двух оставшихся.\n\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\4669_QWKhG5KyX.xlsx"
        ],
        "answer": "1285"
    },
    {
        "id": 4637,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Калинин) Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, для которых выполняются следующие условия:\n1. Максимальное число в кубе не менее удвоенного произведения трёх других чисел\n2. Все числа, содержащиеся в строке, больше 10",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\4637_68BA5A4Bf.xlsx"
        ],
        "answer": "1820"
    },
    {
        "id": 4636,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Калинин) Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, для которых выполняются следующие условия:\n\n1. Разность максимального и минимального чисел не менее 50\n2. Произведение двух других чисел не более 1000",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\4636_kOkQszNsy.xlsx"
        ],
        "answer": "423"
    },
    {
        "id": 4635,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Калинин) Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, для которых выполняются следующие условия:\n\n1. Удвоенный квадрат минимального из чисел, содержащихся в строке, больше, чем произведение двух других чисел, ни одно из которых не равно максимальному числу.\n2. В строке содержится хотя бы два одинаковых числа",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\4635_vq2uEjNwi.xlsx"
        ],
        "answer": "43"
    },
    {
        "id": 4634,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Калинин) Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, для которых выполняются следующие условия:\n  1. Числа, содержащиеся в строке, можно разбить на две пары так что произведения чисел в них равны\n2. Квадрат второго максимального из чисел, содержащихся в строке, больше произведения минимального и максимального чисел в строке.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\4634_zQpd1Ez__.xlsx"
        ],
        "answer": "13"
    },
    {
        "id": 4633,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Калинин) Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, для которых выполняются следующие условия:\n\n1. Числа, содержащиеся в строке, можно разбить на две группы по два числа так, что суммы чисел в них равны\n2. Разность максимального и минимального чисел, содержащихся в строке, меньше разности суммы двух других чисел и максимального числа в строке.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\4633_UqcZbcVNr.xlsx"
        ],
        "answer": "15"
    },
    {
        "id": 4614,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– наибольшее из четырёх чисел меньше суммы трёх других;\n– среди четырёх чисел есть только одна пара равных чисел.\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\4614_nHHTtAPZE.xlsx"
        ],
        "answer": "133"
    },
    {
        "id": 4589,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа.\n\nОпределите количество строк таблицы, содержащих числа, для которых выполнены оба условия:\n– наибольшее из четырёх чисел меньше суммы трёх других;\n– четыре числа можно разбить на две пары чисел с равными суммами.\n\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\4589_SvzIbNXS-.xlsx"
        ],
        "answer": "104"
    },
    {
        "id": 4539,
        "difficulty": "Уровень: Средний",
        "task": "(А. Богданов) В таблице заданы декартовы координаты трех точек, упорядоченных по возрастанию Х. Найти количество строк таблицы, в которых все три точки принадлежат одной прямой.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\4539_RBAK7P773.xlsx"
        ],
        "answer": "553"
    },
    {
        "id": 4466,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, среди элементов которых есть среднее арифметическое максимального и минимального элемента в этой строке.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\4466_VxiigjWmo.xlsx"
        ],
        "answer": "76"
    },
    {
        "id": 4321,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, в которых сумма кубов любых двух чисел больше квадрата суммы оставшихся трех?",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\4321_G-h3fm_Is.xls"
        ],
        "answer": "1056"
    },
    {
        "id": 4259,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, в которых куб суммы максимального и минимального чисел в строке больше суммы кубов трёх оставшихся.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\4259_QGUP_A1Yb.xls"
        ],
        "answer": "3048"
    },
    {
        "id": 4190,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, в которых квадрат суммы максимального и минимального чисел в строке больше суммы квадратов трёх оставшихся.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\4190_O5YRbt9tS.xlsx"
        ],
        "answer": "2640"
    },
    {
        "id": 4100,
        "difficulty": "Уровень: Базовый",
        "task": "В файле электронной таблицы в каждой строке содержатся четыре натуральных числа. Сколько среди них строк, в которых произведение максимального и минимального чисел в строке не менее произведения двух оставшихся?",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\4100_IiA7m8MYg.xls"
        ],
        "answer": "820"
    },
    {
        "id": 3887,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, в которых хотя бы 3 числа больше среднего арифметического всех чисел в строке.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\3887_sA358drbO.xls"
        ],
        "answer": "1035"
    },
    {
        "id": 3730,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, в которых среднее значение элементов меньше среднего значения между максимальным и минимальным значениями.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\3730_XYQzoU55o.xls"
        ],
        "answer": "2203"
    },
    {
        "id": 3571,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа. Определите количество строк таблицы, в которых квадрат максимального из трёх чисел больше удвоенного произведения двух других чисел в строке.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\3571_ntjOw0Hf5.xlsx"
        ],
        "answer": "2715"
    },
    {
        "id": 3362,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, сумма нечетных элементов больше суммы четных элементов. Если четных или нечетных элементов нет в представленной пятерке, сумма считается равной 0.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\3362_JB5rgAZnR.xls"
        ],
        "answer": "1549"
    },
    {
        "id": 3215,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите количество строк таблицы, в которых квадрат суммы максимального и минимального чисел в строке больше суммы квадратов трёх оставшихся.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\3215_gixTpG7zt.xls"
        ],
        "answer": "2585"
    },
    {
        "id": 3168,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Рогов) В файле электронной таблицы в каждой строке содержатся пять натуральных числа. Сколько среди них строк, в которых квадрат суммы максимального и минимального чисел в строке больше суммы квадратов трёх оставшихся?",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\3168_pfgY4pefq.xls"
        ],
        "answer": "2585"
    },
    {
        "id": 3167,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Рогов) В файле электронной таблицы в каждой строке содержатся четыре натуральных числа. Сколько среди них строк, в которых квадрат суммы максимального и минимального чисел в строке больше суммы квадратов двух оставшихся?",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\3167_4ZKb2K8yE.xls"
        ],
        "answer": "2960"
    },
    {
        "id": 3150,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Рогов) Файл электронной таблицы содержит тройки натуральных чисел. Сколько среди них троек, в которых квадрат максимального из трёх чисел больше удвоенного произведения двух других чисел в строке?",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\3150_QTWSY-hmw.xls"
        ],
        "answer": "2707"
    },
    {
        "id": 3094,
        "difficulty": "Уровень: Средний",
        "task": "(PRO100 ЕГЭ) В файле электронной таблицы в каждой строке содержатся шесть натуральных чисел. Определите количество строк, в которых числа можно разбить на три пары, состоящие из одинаковых чисел.\nПример:\n1 2 3 3 1 2 можно разбить на пары 1-1 2-2 3-3",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\3094_EPiqmoeAF.xlsx"
        ],
        "answer": "3"
    },
    {
        "id": 2929,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа. Определите количество строк таблицы, в которых среднее арифметическое максимального и минимального чисел в тройке не превышает третьего (среднего по значению) числа. В ответе запишите только число — количество троек чисел, удовлетворяющих условию.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2929_G8IOHkCEp.xlsx"
        ],
        "answer": "2559"
    },
    {
        "id": 2702,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке три целых числа. К каждой тройке чисел подберите четвертое число так, чтобы из полученных четырех чисел можно было составить стороны прямоугольника. В случае, если это невозможно, четвертое число считайте равным нулю.\nВ ответе запишите сумму всех четвертых чисел, подобранных к каждой тройке.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2702_ujLI76wXD.xls"
        ],
        "answer": "14363"
    },
    {
        "id": 2671,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке три целых числа. Выясните, в каком количестве строк можно выбрать от одного до трех чисел так, чтобы их сумма была равна нулю. В ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2671_WK3oUh2l7.xlsx"
        ],
        "answer": "162"
    },
    {
        "id": 2465,
        "difficulty": "Уровень: Средний",
        "task": "В каждой строке электронной таблицы записаны три натуральных числа, задающих длины трёх взаимно перпендикулярных рёбер прямоугольного тетраэдра. Определите, сколько в таблице троек, для которых в заданном ими тетраэдре грань, не являющаяся прямоугольным треугольником имеет хотя бы две равных стороны.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2465_HN9J5-Gt5.xlsx"
        ],
        "answer": "160"
    },
    {
        "id": 2153,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) Откройте файл электронной таблицы, содержащий в каждой строке три натуральных числа. Первые два числа - основания трапеции. Определите количество троек, в которых третье число может являться средней линией трапеции.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2153_Xp73C25yk.xls"
        ],
        "answer": "133"
    },
    {
        "id": 2118,
        "difficulty": "Уровень: Средний",
        "task": "(А. Богданов) Откройте приложенный файл электронной таблицы, содержащей четверки целых чисел – две пары координат двух векторов (X1,Y1,X2,Y2). Сколько пар векторов коллинеарные (параллельные)?",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2118_bBs8YD7x6.xls"
        ],
        "answer": "57"
    },
    {
        "id": 2104,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке четыре целых числа: первые два числа - координаты точки (x0; y0), следующие два числа - координаты точки (x1; y1). Выясните, какое количество пар точек может являться концами отрезка, пересекающего ось X или ось Y, при этом его длина не больше 5.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2104_gnc4vA7WQ.xls"
        ],
        "answer": "41"
    },
    {
        "id": 2103,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа, являющиеся последовательностью длин отрезков ломаной. Выясните, какое количество четверок чисел может являться сторонами параллелограмма, но не ромба. В ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2103_N5aH51mMN.xls"
        ],
        "answer": "353"
    },
    {
        "id": 2102,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа. Выясните количество троек чисел, в которых среднее арифметическое двух из них равно третьему. В ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2102_WAH-un7SO.xls"
        ],
        "answer": "67"
    },
    {
        "id": 2101,
        "difficulty": "Уровень: Средний",
        "task": "(А. Богданов) Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа. Выясните, какое количество троек чисел могут являться сторонами остроугольного треугольника. В ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2101_pKVwEQXiQ.xls"
        ],
        "answer": "1496"
    },
    {
        "id": 2100,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Комков) Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа. Выясните, какие тройки чисел являются пифагоровыми тройками, то есть являться сторонами прямоугольного треугольника. В ответе запишите максимальную сумму двух катетов найденных прямоугольных треугольников.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2100_82p0FHLeJ.xls"
        ],
        "answer": "803"
    },
    {
        "id": 2099,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы содержащей в каждой строке три натуральных числа. Выясните, какой процент от количества троек чисел, которые могут являться величинами углов треугольника, выраженных в градусах, являются углами равнобедренного или равностороннего треугольника. В ответе запишите целую часть получившегося числа.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2099_ZA067fJNA.xls"
        ],
        "answer": "3"
    },
    {
        "id": 2098,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке четыре целых числа: первые два числа - координаты точки (x0; y0), следующие два числа - координаты точки (x1; y1). Выясните, какое количество пар точек, в которых обе лежат на осях координат.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2098_BLrW_Y6j5.xls"
        ],
        "answer": "10"
    },
    {
        "id": 2097,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке четыре целых числа: первые два числа - координаты точки (x0; y0), следующие два числа - координаты точки (x1; y1). Выясните, какое количество пар точек может являться концами отрезка, пересекающего (в том числе и в концах отрезка) ровно одну из осей X или Y.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2097_1AzR2jDKs.xls"
        ],
        "answer": "531"
    },
    {
        "id": 2096,
        "difficulty": "Уровень: Средний",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке четыре целых числа: первые два числа - координаты точки (x0; y0), следующие два числа - координаты точки (x1; y1). Выясните, какое количество пар точек может являться концами отрезка, не пересекающего ни ось X, ни ось Y.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2096_P-7JKfNtQ.xls"
        ],
        "answer": "184"
    },
    {
        "id": 2095,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа, являющиеся длинами сторон прямоугольного параллелепипеда. Выясните, какое количество троек чисел может являться сторонами параллелепипеда, основанием которого является квадрат (но при этом он не может быть кубом). В ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2095_g7LXGS2H0.xls"
        ],
        "answer": "491"
    },
    {
        "id": 2094,
        "difficulty": "Уровень: Средний",
        "task": "В электронную таблицу занесли данные о тестировании учеников по выбранным ими предметам. В первом столбце указаны фамилия и имя учащегося; во втором номер школы; в третьем и четвёртом столбце - баллы, полученные по географии и информатике.\nКакой процент от общего числа учеников имеют баллы по географии, превышающие их баллы по информатике, но при этом сдали информатику на положительную оценку? Положительная оценка ставится за 44 и более баллов.\nВ ответе запишите целую часть числа.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2094_2Da1lSW0R.xls"
        ],
        "answer": "25"
    },
    {
        "id": 2093,
        "difficulty": "Уровень: Средний",
        "task": "В электронную таблицу занесли данные о тестировании учеников по выбранным ими предметам. В первом столбце указаны фамилия и имя учащегося; во втором номер школы; в третьем и четвёртом столбце - баллы, полученные по географии и информатике.\nКакой процент от общего числа учеников имеют положительные оценки по географии и не сдали информатику? Положительная оценка по географии ставится за 37 и более баллов, положительная оценка по информатике за 44 и более баллов.\nВ ответе запишите целую часть числа.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2093_-84UFH9BK.xls"
        ],
        "answer": "13"
    },
    {
        "id": 2092,
        "difficulty": "Уровень: Базовый",
        "task": "В электронную таблицу занесли данные о тестировании учеников по выбранным ими предметам. В первом столбце указаны фамилия и имя учащегося; во втором номер школы; в третьем и четвёртом столбце - баллы, полученные по географии и информатике.\nУ скольких учащихся 1, 3 и 5 школы неудовлетворительные оценки по географии и по информатике? Неудовлетворительная оценка по географии ставится за 36 и менее баллов, по информатике - 43 и менее баллов.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2092_YLV1Y9RKS.xls"
        ],
        "answer": "1"
    },
    {
        "id": 2091,
        "difficulty": "Уровень: Базовый",
        "task": "В электронную таблицу занесли данные о тестировании учеников по выбранным ими предметам. В первом столбце указаны фамилия и имя учащегося; во втором номер школы; в третьем и четвёртом столбце - баллы, полученные по географии и информатике.\nСколько учеников из первой школы имеют высокие баллы (не менее 85) хотя бы по одному предмету?",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2091_c248NT-rL.xls"
        ],
        "answer": "10"
    },
    {
        "id": 2049,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Богданов) Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа. Выясните, какое количество троек могут перестановкой образовать арифметическую прогрессию с не нулевой разностью прогрессии.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2049_TEcUCultL.xls"
        ],
        "answer": "174"
    },
    {
        "id": 2047,
        "difficulty": "Уровень: Средний",
        "task": "(А. Богданов) Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Выясните, какое количество четверок чисел может являться последовательностью углов (в градусах) параллелограмма. В ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2047_OZIpBBHnP.xls"
        ],
        "answer": "984"
    },
    {
        "id": 2044,
        "difficulty": "Уровень: Средний",
        "task": "(А. Богданов) Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа, являющиеся последовательностью длин отрезков ломаной. Выясните, какое количество четверок чисел может являться сторонами ромба. В ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2044_6p5bXHwpt.xls"
        ],
        "answer": "401"
    },
    {
        "id": 2043,
        "difficulty": "Уровень: Средний",
        "task": "(А. Богданов) Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа, являющиеся последовательностью длин отрезков ломаной. Выясните, какое количество четверок чисел может являться сторонами параллелограмма. В ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2043_-9fIjZC4h.xls"
        ],
        "answer": "754"
    },
    {
        "id": 2042,
        "difficulty": "Уровень: Средний",
        "task": "(А. Богданов) Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа, являющиеся последовательностью длин отрезков ломаной. Выясните, какое количество четверок чисел может являться сторонами описанного четырехугольника. В ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2042_OiE5Bj8aH.xls"
        ],
        "answer": "787"
    },
    {
        "id": 2041,
        "difficulty": "Уровень: Средний",
        "task": "(А. Богданов) Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа, являющиеся последовательностью длин отрезков ломаной. Выясните, какое количество четверок чисел может являться сторонами четырехугольника. В ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2041_vUKQEs8H3.xls"
        ],
        "answer": "4757"
    },
    {
        "id": 2040,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Богданов) Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа. Выясните, какое количество троек чисел могут являться величинами углов равностороннего треугольника, выраженных в градусах. В ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2040_4OTAcmwDc.xls"
        ],
        "answer": "42"
    },
    {
        "id": 2039,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Богданов) Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа. Выясните, какое количество троек чисел могут являться величинами углов равнобедренного, но не равностороннего треугольника, выраженных в градусах. В ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2039__8Enpc8Nh.xls"
        ],
        "answer": "46"
    },
    {
        "id": 2037,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Богданов) Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа. Выясните, какое количество троек чисел могут являться величинами углов тупоугольного треугольника, выраженных в градусах. В ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2037_aPOjXPNBT.xls"
        ],
        "answer": "1071"
    },
    {
        "id": 2036,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Богданов) Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа. Выясните, какое количество троек чисел могут являться величинами углов остроугольного треугольника, выраженных в градусах. В ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2036_gfHG4edxg.xls"
        ],
        "answer": "1194"
    },
    {
        "id": 2035,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Богданов) Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа. Выясните, какое количество троек чисел не могут являться величинами углов треугольника, выраженных в градусах. В ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2035_YIIo9Npm0.xls"
        ],
        "answer": "2626"
    },
    {
        "id": 2034,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Богданов) Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа. Выясните, какое количество троек чисел могут являться величинами углов треугольника, выраженных в градусах. В ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\2034__28kEo_Bm.xls"
        ],
        "answer": "2374"
    },
    {
        "id": 1962,
        "difficulty": "Уровень: Базовый",
        "task": "Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа. Выясните, какое количество троек чисел может являться сторонами треугольника, то есть удовлетворяет неравенству треугольника. \n\nВ ответе запишите только число.",
        "images": [],
        "files": [
            "tasks_json\\task_9\\files\\1962_SPsiRGebf.xls"
        ],
        "answer": "2453"
    }
]