[
    {
        "id": 18916,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Попков) В заснеженной стране жила снежная королева, которая знала все тропинки. Однажды к ней пришел тролль, желающий добраться от пункта А до загадочного пункта З, где хранились сокровища. Он не знал, как выбрать кратчайший путь среди множества дорог. У королевы было хорошее настроение, и она разложила волшебную карту и объяснила, как находить самый короткий маршрут, выбирая правильные дороги и избегая ненужных блужданий.  Найди и ты самый кратчайший маршрут до сокровищ.",
        "images": [
            "tasks_json\\task_1\\images\\18916_18916.png"
        ],
        "files": [],
        "answer": "10"
    },
    {
        "id": 18869,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) В таблице содержатся сведения о дорогах между населёнными пунктами (звёздочка означает, что дорога между соответствующими городами есть). На рисунке справа та же схема дорог изображена в виде графа.\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите последовательность номеров пунктов, соответствующих маршруту E -> F -> G -> H -> A. В ответе укажите искомую последовательность номеров в указанном порядке без разделителей.",
        "images": [
            "tasks_json\\task_1\\images\\18869_7803.png"
        ],
        "files": [],
        "answer": "64815"
    },
    {
        "id": 18575,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, чему равен периметр «треугольника» ABG. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\18575_6008.png"
        ],
        "files": [],
        "answer": "42"
    },
    {
        "id": 18481,
        "difficulty": "Уровень: Базовый",
        "task": "(Д. Бахтиев) На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какие номера могут соответствовать пунктам D и E. В качестве ответа запишите эти номера в порядке невозрастания без разделителей.",
        "images": [
            "tasks_json\\task_1\\images\\18481_18481.png"
        ],
        "files": [],
        "answer": "72"
    },
    {
        "id": 18308,
        "difficulty": "Уровень: Базовый",
        "task": "(Д. Бахтиев) На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта F в пункт E и из пункта E в пункт D.",
        "images": [
            "tasks_json\\task_1\\images\\18308_18308.png"
        ],
        "files": [],
        "answer": "23"
    },
    {
        "id": 18164,
        "difficulty": "Уровень: Базовый",
        "task": "(Д. Бахтиев) На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\n\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта A в пункт F и из пункта C в пункт D.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\18164_18164.png"
        ],
        "files": [],
        "answer": "25"
    },
    {
        "id": 18115,
        "difficulty": "Уровень: Базовый",
        "task": "(В. Колчев) На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какие номера могут соответствовать пунктам A и G. В качестве ответа запишите эти номера в порядке невозрастания.",
        "images": [
            "tasks_json\\task_1\\images\\18115_18115.png"
        ],
        "files": [],
        "answer": "54"
    },
    {
        "id": 17965,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) На рисунке справа схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта G в пункт F и из пункта A в пункт H.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\17965_17965.jpg"
        ],
        "files": [],
        "answer": "76"
    },
    {
        "id": 17855,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта D в пункт G и из пункта A в пункт C.",
        "images": [
            "tasks_json\\task_1\\images\\17855_17855.png"
        ],
        "files": [],
        "answer": "38"
    },
    {
        "id": 17800,
        "difficulty": "Уровень: Базовый",
        "task": "(В. Лашин) На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта E в пункт B и из пункта D в пункт C.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\17800_17800.png"
        ],
        "files": [],
        "answer": "131"
    },
    {
        "id": 17772,
        "difficulty": "Уровень: Базовый",
        "task": "(Д. Бахтиев) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину пути из пункта Д в пункт Е. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\17772_25.png"
        ],
        "files": [],
        "answer": "35"
    },
    {
        "id": 17664,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта С в пункт G и из пункта H в пункт B.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\17664_17664.png"
        ],
        "files": [],
        "answer": "23"
    },
    {
        "id": 17620,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта F в пункт B и из пункта E в пункт D.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\17620_17620.png"
        ],
        "files": [],
        "answer": "55"
    },
    {
        "id": 17542,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта A в пункт H и из пункта H в пункт C.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\17542_17542.png"
        ],
        "files": [],
        "answer": "37"
    },
    {
        "id": 17514,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта B в пункт H и из пункта A в пункт E.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\17514_17514.jpg"
        ],
        "files": [],
        "answer": "38"
    },
    {
        "id": 16248,
        "difficulty": "Уровень: Базовый",
        "task": "(Е.Джобс) На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. В таблице в левом столбце указаны номера пунктов, откуда совершается движение, в первой строке – куда. Определите номера пунктов E и С. Найденный номера перечислите в порядке убывания.",
        "images": [
            "tasks_json\\task_1\\images\\16248_16248.png"
        ],
        "files": [],
        "answer": "42"
    },
    {
        "id": 15313,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта D в пункт E и из пункта D в пункт G.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\15313_15313.png"
        ],
        "files": [],
        "answer": "110"
    },
    {
        "id": 14445,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). \nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину кратчайшего пути из пункта Б в пункт Д, если передвигаться можно только по указанным дорогам. В ответе запишите целое число – длину пути в километрах.",
        "images": [
            "tasks_json\\task_1\\images\\14445_40.png"
        ],
        "files": [],
        "answer": "14"
    },
    {
        "id": 14444,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта C в пункт D и из пункта G в пункт A.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\14444_6008.png"
        ],
        "files": [],
        "answer": "26"
    },
    {
        "id": 14443,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) На рисунке слева изображена схема дорог N-ского района. В таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет.\nКаждому населённому пункту на схеме соответствует его номер в таблице, но неизвестно, какой именно номер. Определите номера, соответствующие пунктам A и C. В качестве ответа запишите найденные номера в порядке убывания без разделителей.",
        "images": [
            "tasks_json\\task_1\\images\\14443_326.png"
        ],
        "files": [],
        "answer": "65"
    },
    {
        "id": 14434,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Шагитов) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта F в пункт E и из пункта B в пункт D. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\14434_14434.png"
        ],
        "files": [],
        "answer": "10"
    },
    {
        "id": 14241,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Шагитов) На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова протяжённость дороги из пункта Д в пункт Е. В ответе запишите целое число – так, как оно указано в таблице.",
        "images": [
            "tasks_json\\task_1\\images\\14241_14241.png"
        ],
        "files": [],
        "answer": "15"
    },
    {
        "id": 14160,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Шагитов) На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\n             Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова протяжённость дороги из пункта А в пункт Г. В ответе запишите целое число - так, как оно указано в таблице.",
        "images": [
            "tasks_json\\task_1\\images\\14160_14160.png"
        ],
        "files": [],
        "answer": "10"
    },
    {
        "id": 13871,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта Б в пункт В и из пункта Г в пункт К. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\13871_1281.png"
        ],
        "files": [],
        "answer": "22"
    },
    {
        "id": 13802,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта H в пункт G и из пункта D в пункт F.\nВ ответе запишите целое число",
        "images": [
            "tasks_json\\task_1\\images\\13802_12233.png"
        ],
        "files": [],
        "answer": "21"
    },
    {
        "id": 12785,
        "difficulty": "Уровень: Средний",
        "task": "(М. Попков) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину кратчайшего пути из пункта А в пункт Е, если передвигаться можно только по указанным дорогам. В ответе запишите целое число – длину пути в километрах.",
        "images": [
            "tasks_json\\task_1\\images\\12785_12785.png"
        ],
        "files": [],
        "answer": "78"
    },
    {
        "id": 12784,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Попков) На рисунке изображена схема дорог N-ского района. В таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет.\nКаждому населённому пункту на схеме соответствует номер в таблице, но неизвестно, какой именно номер. Определите, какие номера в таблице могут соответствовать населённым пунктам Б и Г на схеме. В ответе запишите эти два номера в убывающем порядке без пробелов и знаков препинания.",
        "images": [
            "tasks_json\\task_1\\images\\12784_12784.png"
        ],
        "files": [],
        "answer": "74"
    },
    {
        "id": 12702,
        "difficulty": "Уровень: Базовый",
        "task": "(C. Горбачёв) На рисунке изображена схема дорог N-ского района. В таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет. \nКаждому населённому пункту на схеме соответствует номер в таблице, но неизвестно, какой именно номер. Определите, какой номер в таблице соответствует населённому пункту G на схеме.",
        "images": [
            "tasks_json\\task_1\\images\\12702_12702.png"
        ],
        "files": [],
        "answer": "6"
    },
    {
        "id": 12489,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, чему равен периметр \"треугольника\" ГЗЖ. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\12489_2240.png"
        ],
        "files": [],
        "answer": "44"
    },
    {
        "id": 12455,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта F в пункт E и из пункта B в пункт D.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\12455_12455.png"
        ],
        "files": [],
        "answer": "10"
    },
    {
        "id": 12233,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта С в пункт G и из пункта Н в пункт Е.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\12233_12233.png"
        ],
        "files": [],
        "answer": "46"
    },
    {
        "id": 12090,
        "difficulty": "Уровень: Средний",
        "task": "(М. Попков) Деду Морозу нужно срочно вручить подарок одному послушному ребенку. На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Дед Мороз находится в пункте П, а ребенок в пункте Ю. Определите длину кратчайшего пути, который необходимо преодолеть Деду Морозу.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\12090_12090.png"
        ],
        "files": [],
        "answer": "50"
    },
    {
        "id": 11815,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, чему равен периметр \"четырёхугольника\" ABCD. В ответе запишите целое число в метрах.",
        "images": [
            "tasks_json\\task_1\\images\\11815_6033.png"
        ],
        "files": [],
        "answer": "62000"
    },
    {
        "id": 11649,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, чему равен периметр \"треугольника\" ABG. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\11649_6033.png"
        ],
        "files": [],
        "answer": "46"
    },
    {
        "id": 11219,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Ишимов) На рисунке изображена схема дорог N-ского района. В таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет.\nКаждому населённому пункту на схеме соответствует номер в таблице, но неизвестно, какой именно номер. Определите, какие номера в таблице могут соответствовать населённым пунктам A и F на схеме. В ответе запишите эти два номера в возрастающем порядке без пробелов и знаков препинания.",
        "images": [
            "tasks_json\\task_1\\images\\11219_11219.png"
        ],
        "files": [],
        "answer": "57"
    },
    {
        "id": 10083,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке изображена схема дорог N-ского района. В таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет. \nКаждому населённому пункту на схеме соответствует номер в таблице, но неизвестно, какой именно номер. Определите, какие номера в таблице могут соответствовать населённым пунктам E и F на схеме. В ответе запишите эти два номера в возрастающем порядке без пробелов и знаков препинания.",
        "images": [
            "tasks_json\\task_1\\images\\10083_10083.png"
        ],
        "files": [],
        "answer": "35"
    },
    {
        "id": 10009,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости\nкаждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта В в пункт E и из пункта C в пункт F.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\10009_10009.png"
        ],
        "files": [],
        "answer": "28"
    },
    {
        "id": 9824,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке изображена схема дорог N-ского района. В таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет.\nКаждому населённому пункту на схеме соответствует его номер в таблице, но неизвестно, какой именно номер. Определите, какие номера в таблице могут соответствовать населённым пунктам С и Е на схеме. В ответе запишите эти два номера в возрастающем порядке без пробелов и знаков препинания.",
        "images": [
            "tasks_json\\task_1\\images\\9824_9824.png"
        ],
        "files": [],
        "answer": "14"
    },
    {
        "id": 9770,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости\nкаждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта В в пункт С и из пункта G в пункт Н.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\9770_9770.png"
        ],
        "files": [],
        "answer": "61"
    },
    {
        "id": 9732,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог N-ского района изображена в виде графа, в таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет.\nКаждому населённому пункту на схеме соответствует номер в таблице, но неизвестно, какой именно номер. Определите, какие номера населённых пунктов в таблице могут соответствовать населённым пунктам C и F на схеме. В ответе запишите эти два номера в возрастающем порядке без пробелов и знаков препинания.",
        "images": [
            "tasks_json\\task_1\\images\\9732_9732.png"
        ],
        "files": [],
        "answer": "25"
    },
    {
        "id": 9531,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа. В таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Найдите соответствие названий на графе номерам в таблице. В качестве ответа запишите буквы в порядке соответствия номеров в таблице без разделителей – сначала название для пункта №1, затем для пункта №2 и т.д.",
        "images": [
            "tasks_json\\task_1\\images\\9531_9531.png"
        ],
        "files": [],
        "answer": "БГДАВЗЖЕ"
    },
    {
        "id": 9356,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину самого короткого маршрута из Д в Ж.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\9356_9356.png"
        ],
        "files": [],
        "answer": "22"
    },
    {
        "id": 9148,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите номера пунктов, соответствующих пунктам А, Б, Е и З на схеме. В качестве ответа перечислите найденные номера в порядке возрастания.",
        "images": [
            "tasks_json\\task_1\\images\\9148_9148.png"
        ],
        "files": [],
        "answer": "1357"
    },
    {
        "id": 9054,
        "difficulty": "Уровень: Базовый",
        "task": "(А.Богданов) На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. В таблице в левом столбце указаны номера пунктов, откуда совершается движение, в первой строке – куда.\n Определите, какова длина дороги из пункта В в пункт Д.",
        "images": [
            "tasks_json\\task_1\\images\\9054_9054.png"
        ],
        "files": [],
        "answer": "47"
    },
    {
        "id": 8937,
        "difficulty": "Уровень: Базовый",
        "task": "(Е.Джобс) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину дороги из Д в Е.",
        "images": [
            "tasks_json\\task_1\\images\\8937_8937.png"
        ],
        "files": [],
        "answer": "15"
    },
    {
        "id": 8693,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длине этих дорог в километрах.\nТак как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите сумму длин дорог ЕЗ и ДЖ. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\8693_8693.png"
        ],
        "files": [],
        "answer": "52"
    },
    {
        "id": 8692,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите суммарную длину маршрута A -> D -> E -> G - > C -> F. Под суммарной длиной подразумевается общая сумма всех длин дорог, ведущих из одного пункта в другой по заданном маршруту. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\8692_8692.png"
        ],
        "files": [],
        "answer": "100"
    },
    {
        "id": 8608,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину кратчайшего пути из пункта Д в пункт Г. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\8608_8608.png"
        ],
        "files": [],
        "answer": "75"
    },
    {
        "id": 8546,
        "difficulty": "Уровень: Базовый",
        "task": "(В. Рыбальченко) На рисунке справа схема дорог в парке изображена в виде графа, в таблице содержатся сведения о длинах этих дорог. Так как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенным обозначением на графе. Определите, какова длина маршрута А-И-З-Г-А.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\8546_8546.png"
        ],
        "files": [],
        "answer": "334"
    },
    {
        "id": 8488,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа схема дорог N-ского района изображена в виде графа, в  таблице содержатся сведения о длинах этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова длина дороги из пункта Г в пункт Е. В ответе запишите целое число – так, как оно указано в таблице.",
        "images": [
            "tasks_json\\task_1\\images\\8488_8488.png"
        ],
        "files": [],
        "answer": "40"
    },
    {
        "id": 8459,
        "difficulty": "Уровень: Базовый",
        "task": "(В. Рыбальченко) На рисунке схема дорог района изображена в виде графа, в таблице приведены длины дорог между пунктами. Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Найдите длину маршрута Д-Е-Г-З-Д. В ответ укажите найденную длину.",
        "images": [
            "tasks_json\\task_1\\images\\8459_8459.png"
        ],
        "files": [],
        "answer": "123"
    },
    {
        "id": 8145,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Рогов) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта A в пункт E и из пункта D в пункт G.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\8145_8145.png"
        ],
        "files": [],
        "answer": "37"
    },
    {
        "id": 7987,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) На рисунке схема дорог Н-ского района изображена в виде графа. В таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг ог друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта B в пункт F и из пункта E в пункт C.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\7987_7987.png"
        ],
        "files": [],
        "answer": "56"
    },
    {
        "id": 7829,
        "difficulty": "Уровень: Базовый",
        "task": "(А.Богданов) На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе.\nОпределите, какова длина дороги из пункта Г в пункт Е.",
        "images": [
            "tasks_json\\task_1\\images\\7829_7829.png"
        ],
        "files": [],
        "answer": "40"
    },
    {
        "id": 7803,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Ишимов) В таблице содержатся сведения о дорогах между населёнными пунктами (звёздочка означает, что дорога между соответствующими городами есть). На рисунке справа та же схема дорог изображена в виде графа.\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите номера населённых пунктов A и E в таблице. В ответе напишите два числа без разделителей: сначала для пункта A, затем для пункта E.",
        "images": [
            "tasks_json\\task_1\\images\\7803_7803.png"
        ],
        "files": [],
        "answer": "56"
    },
    {
        "id": 7666,
        "difficulty": "Уровень: Базовый",
        "task": "(В. Рыбальченко) На рисунке схема дорог района изображена в виде графа, в таблице приведены длины дорог между пунктами. Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Найдите кратчайший маршрут из А в B. В качестве ответа укажите длину маршрута.",
        "images": [
            "tasks_json\\task_1\\images\\7666_7666.png"
        ],
        "files": [],
        "answer": "129"
    },
    {
        "id": 7663,
        "difficulty": "Уровень: Средний",
        "task": "(Грачев Н.) На рисунке схема дорог изображена в виде графа, в таблице содержатся сведения о длине этих дорог в километрах. Так как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице не связана с буквенными обозначениями на графе. Известно, что дорога ГВ длиннее дороги ДГ. Дороги АЖ, ЖБ, АБ образуют треугольник. Найдите периметр треугольника АЖБ.",
        "images": [
            "tasks_json\\task_1\\images\\7663_7663.png"
        ],
        "files": [],
        "answer": "56"
    },
    {
        "id": 7578,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова протяжённость дороги из пункта К в пункт Г. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\7578_7578.png"
        ],
        "files": [],
        "answer": "45"
    },
    {
        "id": 7342,
        "difficulty": "Уровень: Средний",
        "task": "(А. Игнатюк) На рисунке схема дорог изображена в виде графа, в таблице звёздочками обозначено наличие дороги между населенными пунктами. Так как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана обозначениями на графе. Выпишите последовательно без пробелов и знаков препинания указанные на графе буквенные обозначения пунктов от П1 до П7: сначала букву, соответствующую П1, затем букву, соответствующую П2, и т. д.",
        "images": [
            "tasks_json\\task_1\\images\\7342_7342.png"
        ],
        "files": [],
        "answer": "БДЗЖАГВ"
    },
    {
        "id": 7284,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Шагитов) На представленной карте метро граф отображает станции в виде вершин и переходы между ними в виде ребер с указанием протяженности в километрах. В таблице представлены данные о протяженности каждого перехода между станциями. Отметим, что нумерация станций в таблице не связана с буквенными обозначениями на графе, так как они были созданы независимо друг от друга.\nВаша задача состоит в определении суммарной длины двух переходов: от станции A до станции C и от станции B до станции D.",
        "images": [
            "tasks_json\\task_1\\images\\7284_7284.png"
        ],
        "files": [],
        "answer": "18"
    },
    {
        "id": 7022,
        "difficulty": "Уровень: Базовый",
        "task": "(А.Богданов) На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. В таблице в левом столбце указаны номера пунктов, откуда совершается движение, в первой строке – куда.\nОпределите длину замкнутого пути не проходящего через город С.",
        "images": [
            "tasks_json\\task_1\\images\\7022_7022.png"
        ],
        "files": [],
        "answer": "180"
    },
    {
        "id": 6991,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа схема дорог в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. В таблице в левом столбце указаны номера пунктов, откуда совершается движение, в первой строке – куда.\nОпределите сумму длин дорог ВД, ГЕ и ЗЖ. Передвигаться можно только по указанным дорогам.",
        "images": [
            "tasks_json\\task_1\\images\\6991_6991.png"
        ],
        "files": [],
        "answer": "59"
    },
    {
        "id": 6876,
        "difficulty": "Уровень: Базовый",
        "task": "В таблице содержатся сведения о дорогах между населёнными пунктами (звёздочка означает, что дорога между соответствующими городами есть).На рисунке справа та же схема дорог изображена в виде графа.\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите номера населённых пунктов Б и В в таблице. В ответе напишите два числа без разделителей: сначала для пункта Б, затем для пункта В.",
        "images": [
            "tasks_json\\task_1\\images\\6876_6876.png"
        ],
        "files": [],
        "answer": "17"
    },
    {
        "id": 6875,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта F в пункт E и из пункта B в пункт D.",
        "images": [
            "tasks_json\\task_1\\images\\6875_6875.png"
        ],
        "files": [],
        "answer": "10"
    },
    {
        "id": 6855,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Статный) На рисунке схема дорог Н-ского района изображена в виде графа. В таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите минимальную возможную длину пути из пункта E в пункт B.",
        "images": [
            "tasks_json\\task_1\\images\\6855_6855.png"
        ],
        "files": [],
        "answer": "53"
    },
    {
        "id": 6775,
        "difficulty": "Уровень: Базовый",
        "task": "(PRO100 ЕГЭ) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта F в пункт B и из пункта D в пункт E. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\6775_6775.png"
        ],
        "files": [],
        "answer": "21"
    },
    {
        "id": 6736,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа. В таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг ог друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта D в пункт F и из пункта D в пункт C.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\6736_6736.png"
        ],
        "files": [],
        "answer": "38"
    },
    {
        "id": 6597,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта А в пункт В и из пункта Ж в пункт Д.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\6597_6597.png"
        ],
        "files": [],
        "answer": "13"
    },
    {
        "id": 6073,
        "difficulty": "Уровень: Средний",
        "task": "(А. Рогов) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта B в пункт C и из пункта F в пункт G.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\6073_6073.png"
        ],
        "files": [],
        "answer": "28"
    },
    {
        "id": 6062,
        "difficulty": "Уровень: Средний",
        "task": "(А. Игнатюк) На рисунке схема дорог изображена в виде графа, в таблице звёздочками обозначено наличие дороги между населенными пунктами.\nТак как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана обозначениями на графе. Выпишите последовательно без пробелов и знаков препинания указанные на графе буквенные обозначения пунктов от П1 до П8: сначала букву, соответствующую П1, затем букву, соответствующую П2, и т. д.",
        "images": [
            "tasks_json\\task_1\\images\\6062_6062.png"
        ],
        "files": [],
        "answer": "ВДГАЖЗЕБ"
    },
    {
        "id": 6033,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта D в пункт A и из пункта B в пункт C. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\6033_6033.png"
        ],
        "files": [],
        "answer": "25"
    },
    {
        "id": 6008,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Ишимов) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта D в пункт A и из пункта B в пункт C. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\6008_6008.png"
        ],
        "files": [],
        "answer": "19"
    },
    {
        "id": 5898,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Тараскин) В городе ЭНСКЕ дома (А-Ж) расположены в алфавитном порядке на одной прямой линии, кроме площади (З). Из каждого дома можно попасть в соседний напрямую, либо пройдя через площадь. Однако дорожки от площади до домов Г, Д и Ж давно заброшены и не используются. Почтальон доставляет письма между двумя домами по маршруту длиной 44, проходя через каждый пункт не более одного раза, но этот маршрут не является оптимальным. Какой существует самый короткий путь для почтальона? Если маршрутов длиной 44 окажется несколько, то в качестве ответа укажите минимальную длину из всех оптимальных.",
        "images": [
            "tasks_json\\task_1\\images\\5898_5898.png"
        ],
        "files": [],
        "answer": "29"
    },
    {
        "id": 5896,
        "difficulty": "Уровень: Средний",
        "task": "(А. Игнатюк) На рисунке схема дорог изображена в виде графа, в таблице звёздочками обозначено наличие дороги между населенными пунктами. Так как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана обозначениями на графе. Выпишите последовательно без пробелов и знаков препинания указанные на графе буквенные обозначения пунктов от П1 до П7: сначала букву, соответствующую П1, затем букву, соответствующую П2, и т. д.",
        "images": [
            "tasks_json\\task_1\\images\\5896_5896.png"
        ],
        "files": [],
        "answer": "ВГДБЗАЖ"
    },
    {
        "id": 5865,
        "difficulty": "Уровень: Средний",
        "task": "(А.Богданов) На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. В таблице в левом столбце указаны номера пунктов, откуда совершается движение, в первой строке – куда.\nОпределите сумму длин дорог CB, CG и CE. Передвигаться можно только по указанным дорогам.",
        "images": [
            "tasks_json\\task_1\\images\\5865_5865.png"
        ],
        "files": [],
        "answer": "41"
    },
    {
        "id": 5737,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Тараскин) В городе ЭНСКЕ дома расположены по часовой стрелке в алфавитном порядке (А-Ж) вокруг площади (З). В таблице и дома и площадь пронумерованы П1-П8, числа в таблице означают длину дорожек между ними. Все дома соединены друг с другом в кольцо, от каждого идет дорожка к площади, кроме домов А и В.\nКоля каждый день ходит в гости к Пете и добирается к нему через площадь маршрутом длиной 18. Но в один день Коля понял, что этот маршрут неоптимальный и добираться до Пети можно более коротким путем. Найдите длину самого короткого пути между их домами.",
        "images": [
            "tasks_json\\task_1\\images\\5737_5737.png"
        ],
        "files": [],
        "answer": "9"
    },
    {
        "id": 5656,
        "difficulty": "Уровень: Средний",
        "task": "(А.Игнатюк) На рисунке схема дорог изображена в виде графа, в таблице звёздочками обозначено наличие дороги между населенными пунктами. Так как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана обозначениями на графе. Выпишите последовательно без пробелов и знаков препинания указанные на графе буквенные обозначения пунктов от П1 до П8: сначала букву, соответствующую П1, затем букву, соответствующую П2, и т. д.",
        "images": [
            "tasks_json\\task_1\\images\\5656_5656.png"
        ],
        "files": [],
        "answer": "АЖВЗЕБДГ"
    },
    {
        "id": 5619,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Ишимов) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах). \nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта E в пункт A и из пункта B в пункт D. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\5619_5619.png"
        ],
        "files": [],
        "answer": "65"
    },
    {
        "id": 5482,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке схема дорог изображена в виде графа, в таблице содержатся сведения о длине этих дорог в километрах. Так как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Известно, что дорога АБ длиннее дороги БГ. Определите длину дороги ДЖ.",
        "images": [
            "tasks_json\\task_1\\images\\5482_5482.png"
        ],
        "files": [],
        "answer": "19"
    },
    {
        "id": 5423,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. В таблице в левом столбце указаны номера пунктов, откуда совершается движение, в первой строке – куда. Определите длину кратчайшего пути между пунктами Г и З. Передвигаться можно только по указанным дорогам.",
        "images": [
            "tasks_json\\task_1\\images\\5423_5423.png"
        ],
        "files": [],
        "answer": "11"
    },
    {
        "id": 5303,
        "difficulty": "Уровень: Средний",
        "task": "(Е. Усов) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице звёздочка обозначает наличие дороги между населёнными пунктами. Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе.\nОпределите номера пунктов В и Ж, найденные номера запишите в порядке возрастания без разделителей.",
        "images": [
            "tasks_json\\task_1\\images\\5303_5303.png"
        ],
        "files": [],
        "answer": "37"
    },
    {
        "id": 5302,
        "difficulty": "Уровень: Базовый",
        "task": "(Е. Усов) На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице числами обозначены минимальное расстояние между пунктами в километрах. Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе.\nНайдите номера пунктов в таблице, соответствующие пунктам Б и В на схеме, если известно, что длина дороги между А и Б равна 22 километра. В качестве ответа запишите без разделителей два числа – номера пунктов в таблице, соответствующие пунктам Б и В на схеме, в порядке возрастания.",
        "images": [
            "tasks_json\\task_1\\images\\5302_5302.png"
        ],
        "files": [],
        "answer": "36"
    },
    {
        "id": 5298,
        "difficulty": "Уровень: Средний",
        "task": "(Е. Усов) На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице приведены минимальные длины дорог между пунктами. Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе.\nОпределите ближайший пункт к пункту Д. В ответе запишите расстояние до этого пункта.",
        "images": [
            "tasks_json\\task_1\\images\\5298_5298.png"
        ],
        "files": [],
        "answer": "17"
    },
    {
        "id": 5276,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Рогов) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта E в пункт C и из пункта F в пункт G.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\5276_5276.png"
        ],
        "files": [],
        "answer": "21"
    },
    {
        "id": 5107,
        "difficulty": "Уровень: Средний",
        "task": "(А. Рогов) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта A в пункт B и из пункта D в пункт H.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\5107_5107.png"
        ],
        "files": [],
        "answer": "32"
    },
    {
        "id": 5056,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке схема дорог изображена в виде графа, в таблице содержатся сведения о длине этих дорог в километрах. Так как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Известно, что дорога CD длиннее дороги EF. Определите сумму длин дорог АB и AG.",
        "images": [
            "tasks_json\\task_1\\images\\5056_5056.png"
        ],
        "files": [],
        "answer": "67"
    },
    {
        "id": 4689,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах). \nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта D в пункт B и из пункта F в пункт A. \nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\4689_4689.png"
        ],
        "files": [],
        "answer": "58"
    },
    {
        "id": 4661,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта C в пункт D и из пункта E в пункт G. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\4661_4661.png"
        ],
        "files": [],
        "answer": "65"
    },
    {
        "id": 4606,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта H в пункт D и из пункта A в пункт B. В ответе запишите целое число",
        "images": [
            "tasks_json\\task_1\\images\\4606_4606.png"
        ],
        "files": [],
        "answer": "18"
    },
    {
        "id": 4581,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта A в пункт D и из пункта G в пункт C. В ответе запишите целое число",
        "images": [
            "tasks_json\\task_1\\images\\4581_4581.png"
        ],
        "files": [],
        "answer": "66"
    },
    {
        "id": 4458,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите протяженность маршрута FBCDEAGF.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\4458_4458.png"
        ],
        "files": [],
        "answer": "118"
    },
    {
        "id": 4313,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке слева изображена схема дорог Н-ского района, в таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет.\nКаждому населённому пункту на схеме соответствует его номер в таблице, но неизвестно, какой именно номер. Определите, какие номера населённых пунктов в таблице могут соответствовать населённым пунктам на графе.  Выпишите последовательно, без пробелов и знаков препинания, указанные в таблице номера пунктов, соответствующих пунктам на графе АБВГДЕЖЗ. Например, если пункту А соответствует номер 1, пункту Б номер 2, и т.д., в ответе необходимо записать 12345678. Если найдено несколько подходящих соответствий, в ответе укажите вариант с наименьшим числовым значением.",
        "images": [
            "tasks_json\\task_1\\images\\4313_4313.png"
        ],
        "files": [],
        "answer": "43512678"
    },
    {
        "id": 4251,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке слева изображена схема дорог Н-ского района, в таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет.\nКаждому населённому пункту на схеме соответствует его номер в таблице, но неизвестно, какой именно номер. Определите, какие номера населённых пунктов в таблице могут соответствовать населённым пунктам Ж и В на схеме. В ответе запишите эти два номера в возрастающем порядке без пробелов и знаков препинания. Например, если бы ответом были пункты П2 и П8, то в качестве ответа нужно было бы указать 28.",
        "images": [
            "tasks_json\\task_1\\images\\4251_4251.png"
        ],
        "files": [],
        "answer": "57"
    },
    {
        "id": 4182,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта D в пункт B и из пункта A в пункт E.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\4182_4182.png"
        ],
        "files": [],
        "answer": "92"
    },
    {
        "id": 4092,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог.\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите какова сумма протяжённостей дорог из пункта В в пункт К и из пункта И в пункт К.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\4092_4092.png"
        ],
        "files": [],
        "answer": "25"
    },
    {
        "id": 4071,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке слева схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину дороги из пункта И в пункт В. В ответе запишите целое число – длину дороги в километрах.",
        "images": [
            "tasks_json\\task_1\\images\\4071_4071.png"
        ],
        "files": [],
        "answer": "13"
    },
    {
        "id": 3722,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой.. Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. В таблице в левом столбце указаны номера пунктов, откуда совершается движение, в первой строке – куда. Определите номера пунктов C и D, найденные номера запишите в порядке возрастания без разделителей. Например, если бы ответом были пункты П2 и П8, то в качестве ответа нужно было бы указать 28.",
        "images": [
            "tasks_json\\task_1\\images\\3722_3722.png"
        ],
        "files": [],
        "answer": "78"
    },
    {
        "id": 3638,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке справа схема дорог между некоторыми объектами изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация объектов в таблице никак не связана с буквенными обозначениями на графе. Определите длину кратчайшего пути между пунктами В и К. Передвигаться можно только по указанным дорогам.",
        "images": [
            "tasks_json\\task_1\\images\\3638_3638.png"
        ],
        "files": [],
        "answer": "45"
    },
    {
        "id": 3569,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите какова сумма протяжённостей дорог из пункта А в пункт С и из пункта F в пункт D.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\3569_3569.png"
        ],
        "files": [],
        "answer": "52"
    },
    {
        "id": 3354,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. В таблице в левом столбце указаны номера пунктов, откуда совершается движение, в первой строке – куда. Определите номера пунктов E и F, найденные номера запишите в порядке возрастания без разделителей. Например, если бы ответом были пункты П2 и П8, то в качестве ответа нужно было бы указать 28.",
        "images": [
            "tasks_json\\task_1\\images\\3354_3354.png"
        ],
        "files": [],
        "answer": "14"
    },
    {
        "id": 3208,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. В таблице в левом столбце указаны номера пунктов, откуда совершается движение, в первой строке – куда. Определите сумму длин дорог между пунктом А и пунктом Б, и между пунктом Е и пунктом К.",
        "images": [
            "tasks_json\\task_1\\images\\3208_3208.png"
        ],
        "files": [],
        "answer": "16"
    },
    {
        "id": 3142,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину более длинной из дорог AF и AC. В ответе запишите целое число – длину дороги в километрах.",
        "images": [
            "tasks_json\\task_1\\images\\3142_3142.png"
        ],
        "files": [],
        "answer": "7"
    },
    {
        "id": 3140,
        "difficulty": "Уровень: Средний",
        "task": "Марат путешествует по Н-скому району, схема дорог которого изображена в виде графа. В таблице содержатся сведения о длине этих дорог в километрах.\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину кратчайшего пути из пункта G в пункт D, если передвигаться можно только по указанным дорогам. В ответе запишите целое число – длину пути в километрах.",
        "images": [
            "tasks_json\\task_1\\images\\3140_3140.png"
        ],
        "files": [],
        "answer": "40"
    },
    {
        "id": 2921,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке схема дорог N-ского района изображена в виде графа, в таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет.\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какие номера населённых пунктов в таблице могут соответствовать населённым пунктам Б и Ж на схеме. В ответе запишите номера этих пунктов в порядке возрастания, без пробелов и знаков препинания.",
        "images": [
            "tasks_json\\task_1\\images\\2921_2921.png"
        ],
        "files": [],
        "answer": "47"
    },
    {
        "id": 2791,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке схема дорог изображена в виде графа, в таблице содержатся сведения о длине этих дорог в километрах. Так как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Известно, что длина дороги БГ равна 17 км. Определите длину дороги ВИ. В ответе запишите целое число – длину дороги в километрах.",
        "images": [
            "tasks_json\\task_1\\images\\2791_2791.png"
        ],
        "files": [],
        "answer": "15"
    },
    {
        "id": 2694,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяженности каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице не совпадает с буквенными обозначениями на графе. Определите длину кратчайшего пути из пункта D в пункт G, если известно, что дорога BC длиннее дороги BD. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\2694_2694.png"
        ],
        "files": [],
        "answer": "53"
    },
    {
        "id": 2663,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяженности каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице не совпадает с буквенными обозначениями на графе. Определите протяжённость дороги из пункта A в пункт E. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\2663_2663.png"
        ],
        "files": [],
        "answer": "24"
    },
    {
        "id": 2564,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длине этих дорог в километрах.\nТак как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Известно, что длина дороги ЗЕ равна 15 км. Определите длину дороги БГ. В ответе запишите целое число – длину дороги в километрах.",
        "images": [
            "tasks_json\\task_1\\images\\2564_2564.png"
        ],
        "files": [],
        "answer": "22"
    },
    {
        "id": 2533,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке схема дорог изображена в виде графа, в таблице содержатся сведения о длине этих дорог в километрах. Так как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину более длинной из дорог ГЖ и ЕИ. В ответе запишите целое число – длину дороги в километрах.",
        "images": [
            "tasks_json\\task_1\\images\\2533_2533.png"
        ],
        "files": [],
        "answer": "8"
    },
    {
        "id": 2483,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длине этих дорог в километрах.\nТак как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину более короткой из дорог АБ и АВ. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\2483_2483.png"
        ],
        "files": [],
        "answer": "10"
    },
    {
        "id": 2457,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог в километрах.\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите какова протяжённость дороги из пункта И в пункт К. В ответе запишите целое число - так, как оно указано в таблице.",
        "images": [
            "tasks_json\\task_1\\images\\2457_2457.png"
        ],
        "files": [],
        "answer": "11"
    },
    {
        "id": 2372,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице не совпадает с буквенными обозначениями на графе. Определите сумму протяжённостей дорог из пункта Б в пункт В и из пункта Г в пункт Д. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\2372_2372.png"
        ],
        "files": [],
        "answer": "17"
    },
    {
        "id": 2313,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину кратчайшего пути из пункта А в пункт В, если передвигаться можно только по указанным дорогам. В ответе запишите целое число – длину пути в километрах.",
        "images": [
            "tasks_json\\task_1\\images\\2313_2313.gif"
        ],
        "files": [],
        "answer": "17"
    },
    {
        "id": 2240,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длине этих дорог в километрах.\nТак как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину более длинной из дорог ЕЗ и ДЖ. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\2240_2240.png"
        ],
        "files": [],
        "answer": "28"
    },
    {
        "id": 2204,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Калинин) На рисунке схема дорог Трансильвании изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма длин дорог из пункта D в пункт E и из пункта H в пункт G.",
        "images": [
            "tasks_json\\task_1\\images\\2204_2204.png"
        ],
        "files": [],
        "answer": "26"
    },
    {
        "id": 2170,
        "difficulty": "Уровень: Средний",
        "task": "Между населёнными пунктами A, B, C, D, E, F, G построены дороги, протяжённость которых приведена в таблице. Отсутствие числа в таблице означает, что прямой дороги между пунктами нет.\nОпределите длину кратчайшего пути между пунктами A и G (при условии, что передвигаться можно только по построенным дорогам).",
        "images": [
            "tasks_json\\task_1\\images\\2170_2170.png"
        ],
        "files": [],
        "answer": "12"
    },
    {
        "id": 2147,
        "difficulty": "Уровень: Средний",
        "task": "Ha рисунке схема дорог Н-ского района изображена в виде графа, в таблице звездочкой отмечено наличие дороги между пунктами.\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Установите соответствие между номерами пунктов в таблице и буквенными обозначениями на графе. В ответе запишите последовательность номеров пунктов, соответствующую последовательности пунктов АБВГДИК, без пробелов и дополнительных символов.",
        "images": [
            "tasks_json\\task_1\\images\\2147_2147.jpg"
        ],
        "files": [],
        "answer": "1564237"
    },
    {
        "id": 1954,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах)\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта Б в пункт В и из пункта Г в пункт Д.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\1954_1954.png"
        ],
        "files": [],
        "answer": "20"
    },
    {
        "id": 1887,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова протяжённость дороги из пункта Д в пункт Е. В ответе запишите целое число – так, как оно указано в таблице.",
        "images": [
            "tasks_json\\task_1\\images\\1887_1887.png"
        ],
        "files": [],
        "answer": "7"
    },
    {
        "id": 1883,
        "difficulty": "Уровень: Средний",
        "task": "(Крамник Илья) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице числами обозначены длины дорог в километрах. Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе.\nВыпишите последовательно, без пробелов и знаков препинания, указанные на графе буквенные обозначения пунктов от П1 до П8: сначала букву, соответствующую П1, затем букву, соответствующую П2 и т. д.",
        "images": [
            "tasks_json\\task_1\\images\\1883_1883.png"
        ],
        "files": [],
        "answer": "ДБЕВЖЗГА"
    },
    {
        "id": 1845,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. В таблице в левом столбце указаны номера пунктов, откуда совершается движение, в первой строке – куда. Определите сумму длин дорог из пункта Г в пункт Е и из пункта Д в З.",
        "images": [
            "tasks_json\\task_1\\images\\1845_1845.png"
        ],
        "files": [],
        "answer": "21"
    },
    {
        "id": 1740,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Богданов) На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите протяжённость дороги из пункта Б в пункт Д. В ответе запишите целое.",
        "images": [
            "tasks_json\\task_1\\images\\1740_1740.png"
        ],
        "files": [],
        "answer": "19"
    },
    {
        "id": 1458,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице звёздочками обозначено наличие дорог. Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Выпишите последовательно, без пробелов и знаков препинания, указанные на графе буквенные обозначения пунктов от П1 до П7: сначала букву, соответствующую П1, затем букву, соответствующую П2, и т. д.",
        "images": [
            "tasks_json\\task_1\\images\\1458_1458.png"
        ],
        "files": [],
        "answer": "ВДБЕАГЖ"
    },
    {
        "id": 1457,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, в какой пункт ведёт самая короткая дорога из пункта А. В ответе укажите букву, обозначающую населённый пункт.",
        "images": [
            "tasks_json\\task_1\\images\\1457_1457.png"
        ],
        "files": [],
        "answer": "Е"
    },
    {
        "id": 1449,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова длина дороги из пункта Г в пункт Е. В ответе запишите целое число – так, как оно указано в таблице.",
        "images": [
            "tasks_json\\task_1\\images\\1449_1449.png"
        ],
        "files": [],
        "answer": "30"
    },
    {
        "id": 1429,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке слева изображена схема дорог Н-ского района, в таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет. Определите, какие номера населённых пунктов в таблице могут соответствовать населённым пунктам  Б  и  В  на схеме. В ответ запишите без разделителей сначала номер пункта  Б , потом номер пункта  В .",
        "images": [
            "tasks_json\\task_1\\images\\1429_1429.png"
        ],
        "files": [],
        "answer": "14"
    },
    {
        "id": 1417,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой.\nТак как таблицу и схему рисовали отдельно друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какие номера населённых пунктов в таблице могут соответствовать населённым пунктам А и Д на схеме.\nВ ответе запишите эти два номера в возрастающем порядке без пробелов и знаков препинания.",
        "images": [
            "tasks_json\\task_1\\images\\1417_1417.png"
        ],
        "files": [],
        "answer": "56"
    },
    {
        "id": 1356,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. В таблице в левом столбце указаны номера пунктов, откуда совершается движение, в первой строке – куда. Определите длину дороги между пунктами А и Б, если известно, что длина дороги между Г и Д меньше длины дороги между Г и Е. Передвигаться можно только по указанным дорогам.",
        "images": [
            "tasks_json\\task_1\\images\\1356_1356.png"
        ],
        "files": [],
        "answer": "10"
    },
    {
        "id": 1281,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта Б в пункт Д и из пункта В в пункт Е. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\1281_1281.png"
        ],
        "files": [],
        "answer": "22"
    },
    {
        "id": 1263,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова протяжённость дороги из пункта Г в пункт Д. В ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\1263_1263.png"
        ],
        "files": [],
        "answer": "27"
    },
    {
        "id": 1209,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа изображена схема дорог N-ского района, в таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет. Определите, какие номера населённых пунктов в таблице могут соответствовать населённым пунктам Е и В на схеме.\nВ ответ запишите эти два номера в возрастающем порядке без пробелов и знаков препинания",
        "images": [
            "tasks_json\\task_1\\images\\1209_1209.png"
        ],
        "files": [],
        "answer": "24"
    },
    {
        "id": 1184,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа изображена схема дорог N-ского района, в таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет. Определите, какие номера населённых пунктов в таблице могут соответствовать населённым пунктам А и Б на схеме.\nВ ответ запишите эти два номера в возрастающем порядке без пробелов и знаков препинания",
        "images": [
            "tasks_json\\task_1\\images\\1184_1184.png"
        ],
        "files": [],
        "answer": "17"
    },
    {
        "id": 1159,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа; в таблице слева содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова длина дороги из пункта Б в пункт В. В ответе запишите целое число — так, как оно указано в таблице.",
        "images": [
            "tasks_json\\task_1\\images\\1159_1159.png"
        ],
        "files": [],
        "answer": "8"
    },
    {
        "id": 959,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке слева представлена схема дорог Н-ского района. Справа приведена таблица, которая также содержит информацию о существующих дорогах в Н-ском районе. Схема и таблица составлялись независимо друг от друга, поэтому нумерация пунктов в таблице никак не связана с наименованиями пунктов на схеме. \nОпределите длину кратчайшего маршрута между пунктами А и Д.",
        "images": [
            "tasks_json\\task_1\\images\\959_959.png"
        ],
        "files": [],
        "answer": "14"
    },
    {
        "id": 958,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке слева представлена схема дорог Н-ского района. Справа приведена таблица, которая также содержит информацию о существующих дорогах в Н-ском районе. Схема и таблица составлялись независимо друг от друга, поэтому нумерация пунктов в таблице никак не связана с наименованиями пунктов на схеме. Определите длину дороги между пунктами Д и Г.",
        "images": [
            "tasks_json\\task_1\\images\\958_958.png"
        ],
        "files": [],
        "answer": "4"
    },
    {
        "id": 957,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке слева представлена схема дорог Н-ского района. Справа приведена таблица, которая также содержит информацию о существующих дорогах в Н-ском районе. Схема и таблица составлялись независимо друг от друга, поэтому нумерация пунктов в таблице никак не связана с наименованиями пунктов на схеме. Определите номера пунктов в таблице, которые соответствуют пунктам Д и Е на схеме. В качестве ответа укажите два ЧИСЛА без разделителей – сначала номер пункта, соответствующего пункту Д, затем – Е.",
        "images": [
            "tasks_json\\task_1\\images\\957_957.png"
        ],
        "files": [],
        "answer": "37"
    },
    {
        "id": 956,
        "difficulty": "Уровень: Средний",
        "task": "В таблице приведены длины существующих дорог между пунктами А, Б, В, Г, Д, Е. Других дорог между данными пунктами нет. Определите длину кратчайшего маршрута между пунктами А и Е.",
        "images": [
            "tasks_json\\task_1\\images\\956_956.png"
        ],
        "files": [],
        "answer": "17"
    },
    {
        "id": 913,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице числами обозначены длины дорог в километрах. Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Найдите номера пунктов в таблице, соответствующие пунктам А и В на схеме, если известно, что дорога между А и В длиной 10 километров.\nВ качестве ответа запишите без разделителей два числа – номера пунктов в таблице, соответствующие пунктам А и В на схеме, в порядке возрастания.",
        "images": [
            "tasks_json\\task_1\\images\\913_913.png"
        ],
        "files": [],
        "answer": "34"
    },
    {
        "id": 866,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице звёздочками обозначено наличие дорог. Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Выпишите последовательно, без пробелов и знаков препинания, указанные на графе буквенные обозначения пунктов от П1 до П7: сначала букву, соответствующую П1, затем букву, соответствующую П2, и т. д.",
        "images": [
            "tasks_json\\task_1\\images\\866_866.png"
        ],
        "files": [],
        "answer": "ЖВЕГАБД"
    },
    {
        "id": 790,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке слева схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину кратчайшего пути из пункта Г в пункт К, если передвигаться можно только по указанным дорогам. В ответе запишите целое число – длину пути в километрах.",
        "images": [
            "tasks_json\\task_1\\images\\790_790.png"
        ],
        "files": [],
        "answer": "10"
    },
    {
        "id": 765,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке слева схема дорог Н-ского района изображена в виде графа, в таблице звездочкой обозначено наличие дороги из одного населенного пункта в другой. Отсутствие звёздочки означает, что такой дороги нет. Определите, какие номера населённых пунктов в таблице могут соответствовать населённым пунктам А и В на схеме. В ответе запишите эти два номера – сначала номер пункта А, затем номер пункта В без разделителей.",
        "images": [
            "tasks_json\\task_1\\images\\765_765.png"
        ],
        "files": [],
        "answer": "24"
    },
    {
        "id": 684,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину кратчайшего пути между пунктами Б и Д. Передвигаться можно только по указанным дорогам.",
        "images": [
            "tasks_json\\task_1\\images\\684_684.png"
        ],
        "files": [],
        "answer": "8"
    },
    {
        "id": 683,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова протяжённость дороги из пункта Г в пункт Ж. В ответе запишите целое число – так, как оно указано в таблице.",
        "images": [
            "tasks_json\\task_1\\images\\683_683.png"
        ],
        "files": [],
        "answer": "9"
    },
    {
        "id": 613,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину дороги между пунктами Г и Ж. Передвигаться можно только по указанным дорогам.",
        "images": [
            "tasks_json\\task_1\\images\\613_613.png"
        ],
        "files": [],
        "answer": "7"
    },
    {
        "id": 566,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке слева схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите номера пунктов, которые соответствуют городам А и Б. В ответе запишите найденные номера в порядке возрастания без разделителей.",
        "images": [
            "tasks_json\\task_1\\images\\566_566.png"
        ],
        "files": [],
        "answer": "24"
    },
    {
        "id": 418,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке слева схема дорог Н-ского района изображена в виде графа, в таблице звездочкой обозначено наличие дороги из одного населенного пункта в другой. Отсутствие звёздочки означает, что такой дороги нет. Определите, какие номера населённых пунктов в таблице могут соответствовать населённым пунктам И и К на схеме. В ответе запишите эти два номера в возрастающем порядке без пробелов и знаков препинания.",
        "images": [
            "tasks_json\\task_1\\images\\418_418.png"
        ],
        "files": [],
        "answer": "18"
    },
    {
        "id": 330,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке слева изображена схема дорог N-ского района. Приведены длины дорог между пунктами. Так как таблицу и граф заполняли независимо, наименование вершин графа никак не зависят от номеров пунктов в таблице. Найдите номера пунктов F и H. В качестве ответа запишите найденные номера в порядке убывания без разделителей.",
        "images": [
            "tasks_json\\task_1\\images\\330_330.png"
        ],
        "files": [],
        "answer": "63"
    },
    {
        "id": 329,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке слева изображена схема дорог N-ского района. Приведены длины дорог между пунктами. Так как таблицу и граф заполняли независимо, наименование вершин графа никак не зависят от номеров пунктов в таблице. Найдите номера пунктов H и K. В качестве ответа запишите найденные номера в порядке возрастания без разделителей.",
        "images": [
            "tasks_json\\task_1\\images\\329_329.png"
        ],
        "files": [],
        "answer": "89"
    },
    {
        "id": 328,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке слева изображена схема дорог N-ского района. В таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Так как таблицу и граф заполняли независимо, наименование вершин графа никак не зависят от номеров пунктов в таблице. Найдите номера пунктов G и H. В качестве ответа запишите найденные номера в порядке возрастания без разделителей.",
        "images": [
            "tasks_json\\task_1\\images\\328_328.png"
        ],
        "files": [],
        "answer": "78"
    },
    {
        "id": 327,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке слева изображена схема дорог N-ского района. Приведены длины дорог между пунктами. Так как таблицу и граф заполняли независимо, наименование вершин графа никак не зависят от номеров пунктов в таблице. Найдите кратчайший маршрут из А в Н. В качестве ответа укажите найденный маршрут как последовательность названий пунктов на графе. Например, ABCDEFGH.",
        "images": [
            "tasks_json\\task_1\\images\\327_327.png"
        ],
        "files": [],
        "answer": "ABCDGH"
    },
    {
        "id": 326,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке слева изображена схема дорог N-ского района. В таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет.\nКаждому населённому пункту на схеме соответствует его номер в таблице, но неизвестно, какой именно номер. Определите номер пункта, соответствующего пункту В.",
        "images": [
            "tasks_json\\task_1\\images\\326_326.png"
        ],
        "files": [],
        "answer": "7"
    },
    {
        "id": 293,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину дороги между пунктами Е и Ж. Передвигаться можно только по указанным дорогам.",
        "images": [
            "tasks_json\\task_1\\images\\293_293.png"
        ],
        "files": [],
        "answer": "21"
    },
    {
        "id": 258,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину кратчайшего пути между пунктами А и Е. Передвигаться можно только по указанным дорогам.",
        "images": [
            "tasks_json\\task_1\\images\\258_258.png"
        ],
        "files": [],
        "answer": "32"
    },
    {
        "id": 202,
        "difficulty": "Уровень: Средний",
        "task": "Между населёнными пунктами A, B, C, D, E, F построены дороги, протяжённость которых приведена в таблице. (Отсутствие числа в таблице означает, что прямой дороги между пунктами нет.)\nОпределите длину кратчайшего пути между пунктами A и E (при условии, что передвигаться можно только по построенным дорогам).",
        "images": [
            "tasks_json\\task_1\\images\\202_202.png"
        ],
        "files": [],
        "answer": "11"
    },
    {
        "id": 84,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину дороги между пунктами Е и Ж. Передвигаться можно только по указанным дорогам",
        "images": [
            "tasks_json\\task_1\\images\\84_84.png"
        ],
        "files": [],
        "answer": "25"
    },
    {
        "id": 45,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину дороги между пунктами Г и Д. Передвигаться можно только по указанным дорогам.",
        "images": [
            "tasks_json\\task_1\\images\\45_45.png"
        ],
        "files": [],
        "answer": "22"
    },
    {
        "id": 43,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке схема дорог изображена в виде графа, в таблице звёздочками обозначено наличие дороги между населёнными пунктами.\nТак как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана обозначениями на графе. Выпишите последовательно без пробелов и знаков препинания указанные на графе буквенные обозначения пунктов от П1 до П8: сначала букву, соответствующую П1, затем букву, соответствующую П2, и т. д.",
        "images": [
            "tasks_json\\task_1\\images\\43_43.png"
        ],
        "files": [],
        "answer": "BADGEHFC"
    },
    {
        "id": 42,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке схема дорог изображена в виде графа, в таблице звёздочками обозначено наличие дороги между населёнными пунктами.\nТак как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Выпишите последовательно без пробелов и знаков препинания указанные на графе буквенные обозначения пунктов от П1 до П8: сначала букву, соответствующую П1, затем букву, соответствующую П2, и т. д.",
        "images": [
            "tasks_json\\task_1\\images\\42_42.png"
        ],
        "files": [],
        "answer": "БИЕВЖДАГ"
    },
    {
        "id": 41,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину кратчайшего пути из пункта А в пункт К, если передвигаться можно только по указанным дорогам. В ответе запишите целое число – длину пути в километрах.",
        "images": [
            "tasks_json\\task_1\\images\\41_41.png"
        ],
        "files": [],
        "answer": "35"
    },
    {
        "id": 40,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину кратчайшего пути из пункта А в пункт В, если передвигаться можно только по указанным дорогам. В ответе запишите целое число – длину пути в километрах.",
        "images": [
            "tasks_json\\task_1\\images\\40_40.png"
        ],
        "files": [],
        "answer": "18"
    },
    {
        "id": 39,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке слева изображена схема дорог Н-ского района, в таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет. Определите, какие номера населённых пунктов в таблице могут соответствовать населённым пунктам В и Е на схеме. В ответе запишите эти два номера в возрастающем порядке без пробелов и знаков препинания.",
        "images": [
            "tasks_json\\task_1\\images\\39_39.png"
        ],
        "files": [],
        "answer": "26"
    },
    {
        "id": 38,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Укажите кратчайший путь из пункта Б в пункт Ж. В ответе перечислите все населённые пункты, через которые проходит путь. Например, путь из Г в В через А и Б записывается как ГАБВ.",
        "images": [
            "tasks_json\\task_1\\images\\38_38.png"
        ],
        "files": [],
        "answer": "БАВДГЕЖ"
    },
    {
        "id": 37,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке слева изображена схема дорог Н-ского района, в таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет. Определите, какие номера населённых пунктов в таблице могут соответствовать населённым пунктам Б и Е на схеме. В ответе запишите эти два номера в возрастающем порядке без пробелов и знаков препинания.",
        "images": [
            "tasks_json\\task_1\\images\\37_37.png"
        ],
        "files": [],
        "answer": "67"
    },
    {
        "id": 36,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину кратчайшего пути между пунктами А и Д. Передвигаться можно только по указанным дорогам.",
        "images": [
            "tasks_json\\task_1\\images\\36_36.png"
        ],
        "files": [],
        "answer": "30"
    },
    {
        "id": 34,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину дороги между пунктами Е и Ж. Передвигаться можно только по указанным дорогам.",
        "images": [
            "tasks_json\\task_1\\images\\34_34.png"
        ],
        "files": [],
        "answer": "25"
    },
    {
        "id": 32,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину дороги между пунктами Е и Ж. Передвигаться можно только по указанным дорогам.",
        "images": [
            "tasks_json\\task_1\\images\\32_32.png"
        ],
        "files": [],
        "answer": "14"
    },
    {
        "id": 31,
        "difficulty": "Уровень: Средний",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину кратчайшего пути между пунктами Б и В. Передвигаться можно только по указанным дорогам.",
        "images": [
            "tasks_json\\task_1\\images\\31_31.png"
        ],
        "files": [],
        "answer": "8"
    },
    {
        "id": 30,
        "difficulty": "Уровень: Средний",
        "task": "(М.В. Кузнецова) На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину кратчайшего пути между пунктами В и К. Передвигаться можно только по указанным дорогам.",
        "images": [
            "tasks_json\\task_1\\images\\30_30.png"
        ],
        "files": [],
        "answer": "25"
    },
    {
        "id": 29,
        "difficulty": "Уровень: Средний",
        "task": "(М.В. Кузнецова) На рисунке справа схема дорог между некоторыми объектами изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация объектов в таблице никак не связана с буквенными обозначениями на графе. Определите длину кратчайшего пути между пунктами В и Е. Передвигаться можно только по указанным дорогам.",
        "images": [
            "tasks_json\\task_1\\images\\29_29.png"
        ],
        "files": [],
        "answer": "25"
    },
    {
        "id": 28,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова длина дороги из пункта В в пункт Е. В ответе запишите целое число – так, как оно указано в таблице.",
        "images": [
            "tasks_json\\task_1\\images\\28_28.png"
        ],
        "files": [],
        "answer": "36"
    },
    {
        "id": 27,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова длина дороги из пункта Д в пункт Е. В ответе запишите целое число – так, как оно указано в таблице.",
        "images": [
            "tasks_json\\task_1\\images\\27_27.png"
        ],
        "files": [],
        "answer": "16"
    },
    {
        "id": 26,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова длина дороги из пункта А в пункт Д. В ответе запишите целое число – так, как оно указано в таблице.",
        "images": [
            "tasks_json\\task_1\\images\\26_26.png"
        ],
        "files": [],
        "answer": "46"
    },
    {
        "id": 19233,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).\nТак как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта A в пункт G и из пункта D в пункт E.\nВ ответе запишите целое число.",
        "images": [
            "tasks_json\\task_1\\images\\19233_19233.png"
        ],
        "files": [],
        "answer": "11"
    },
    {
        "id": 25,
        "difficulty": "Уровень: Базовый",
        "task": "На рисунке справа схема дорог Н-ского района изображена в виде графа, в таблице содержатся сведения о длинах этих дорог (в километрах). Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова длина дороги из пункта В в пункт Г. В ответе запишите целое число – так, как оно указано в таблице.",
        "images": [
            "tasks_json\\task_1\\images\\25_25.png"
        ],
        "files": [],
        "answer": "55"
    }
]