[
    {
        "id": 19891,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Попков) На далёкой засекреченной космической станции, затерянной в пустынных уголках вселенной, гениальный, но сумасшедший учёный доктор Астрономикс проводит эксперименты с кластеризацией звёздных карт. Он утверждает, что можно открыть портал в параллельное измерение. Для проверки своей гипотезы он анализирует группы звёзд, лежащие внутри прямоугольника – кластеры. Каждая звезда обязательно принадлежит только одному из кластеров.\nДля его экспериментов необходимо определить истинный центр каждого кластера, или центроид, – это одна из звёзд на графике, сумма расстояний от которой до всех остальных звёзд кластера минимальна.\nПод расстоянием понимается расстояние Чебышева между двумя точками\nA(x\n1\n,y\n1\n) и\nB(x\n2\n,y\n2\n) на плоскости, которое вычисляется по формуле:\nd(A,B)=max(∣x\n2\n−x\n1\n∣,∣y\n2\n−y\n1\n∣).\nВ файле A хранятся данные о звёздах двух кластеров. В каждой строке записана информация о расположении на карте одной звезды: сначала координата\nx, затем координата\ny. Значения даны в условных единицах. Известно, что количество звёзд не превышает 1000.\nВ файле B хранятся данные о звёздах четырёх кластеров. Известно, что количество звёзд не превышает 10 000. Структура хранения информации о звездах в файле B аналогична файлу А.\nДля каждого файла определите координаты центра каждого кластера, затем вычислите два числа:\nP\nx\n– среднее арифметическое абсцисс центров кластеров, и\nP\ny\n – среднее арифметическое ординат центров кластеров.\nВ ответе запишите четыре числа: в первой строке сначала целую часть произведения\nP\nx\n×10000, затем целую часть произведения\nP\ny\n×10000 для файла А, во второй строке – аналогичные данные для файла B.\nПо словам учёного, правильный результат может помочь настроить телепорт к звёздному измерению… или взорвать станцию, если вы ошибётесь!\nВозможные данные одного из файлов иллюстрированы графиком.\nВнимание! График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию.\nДля выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\19891_base64.png"
        ],
        "files": [
            "tasks_json\\task_27\\files\\19891_27.3.A.txt",
            "tasks_json\\task_27\\files\\19891_27.3.A.xlsx",
            "tasks_json\\task_27\\files\\19891_27.3.B.txt",
            "tasks_json\\task_27\\files\\19891_27.3.B.xlsx"
        ],
        "answer": "31889 4751\n23102 4049"
    },
    {
        "id": 19715,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Попков) В рамках международной программы “Галактический AI”, учёные используют суперкомпьютеры и современные алгоритмы машинного обучения для анализа звёздных систем. Задача программы — определить центры кластеров звёзд, чтобы улучшить космическую навигацию для спутников и создать точные карты галактик. Кластер звёзд – это набор звёзд (точек) на графике, лежащий внутри круга. Каждая звезда обязательно принадлежит только одному из кластеров.\nИстинный центр кластера, или центроид, – это одна из звёзд на графике, сумма расстояний от которой до всех остальных звёзд кластера минимальна.\nПод расстоянием понимается расстояние Евклида между двумя точками\nA(x\n1\n,y\n1\n) и\nB(x\n2\n,y\n2\n) на плоскости, которое вычисляется по формуле: \nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n.\nАномалиями назовём звёзды, находящиеся на расстоянии более одной условной единицы от звёзд кластеров. При расчётах аномалии учитывать не нужно.\nВ файле A хранятся данные о звёздах двух кластеров. В каждой строке записана информация о расположении на карте одной звезды: сначала координата\nx, затем координата\ny. Значения даны в условных единицах. Известно, что количество звёзд не превышает 1000.\nВ файле B хранятся данные о звёздах четырёх кластеров. Известно, что количество звёзд не превышает 10 000. Структура хранения информации о звездах в файле B аналогична файлу А.\nДля каждого файла определите координаты центра каждого кластера, затем вычислите два числа:\nP\nx\n– среднее арифметическое абсцисс центров кластеров, и\nP\ny\n – среднее арифметическое ординат центров кластеров.\nВ ответе запишите четыре числа: в первой строке сначала целую часть произведения\nP\nx\n×10000, затем целую часть произведения\nP\ny\n×10000 для файла А, во второй строке – аналогичные данные для файла B.\nСовременные технологии позволят учёным сделать точнейшие карты звёздных систем и оптимизировать работу космических спутников. Но каждый расчёт должен быть выполнен идеально: малейшая ошибка приведёт к сбою маршрутов и потере связи с навигационными системами!\nВозможные данные одного из файлов иллюстрированы графиком.\nВнимание! График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию.\nДля выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\19715_base64.png"
        ],
        "files": [
            "tasks_json\\task_27\\files\\19715_27.21.A.txt",
            "tasks_json\\task_27\\files\\19715_27.21.A.xlsx",
            "tasks_json\\task_27\\files\\19715_27.21.B.txt",
            "tasks_json\\task_27\\files\\19715_27.21.B.xlsx"
        ],
        "answer": "132035 86733"
    },
    {
        "id": 19567,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Попков) Учёный решил провести кластеризацию некоторого множества звёзд по их расположению на карте звёздного неба. Кластер звёзд – это набор звёзд (точек) на графике, лежащий внутри параллелограмма. Каждая звезда обязательно принадлежит только одному из кластеров.\nИстинный центр кластера, или центроид, – это одна из звёзд на графике, сумма расстояний от которой до всех остальных звёзд кластера минимальна.\nПод расстоянием понимается расстояние Евклида между двумя точками\nA(x\n1\n,y\n1\n) и\nB(x\n2\n,y\n2\n) на плоскости, которое вычисляется по формуле:\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n.\nВ файле A хранятся данные о звёздах двух кластеров. В каждой строке записана информация о расположении на карте одной звезды: сначала координата\nx, затем координата\ny. Значения даны в условных единицах. Известно, что количество звёзд не превышает 1000.\nВ файле B хранятся данные о звёздах шести кластеров. Известно, что количество звёзд не превышает 10 000. Структура хранения информации о звездах в файле B аналогична файлу А.\nДля каждого файла определите координаты центра каждого кластера, затем вычислите два числа:\nP\nx\n – среднее арифметическое абсцисс центров кластеров, и\nP\ny\n – среднее арифметическое ординат центров кластеров.\nВ ответе запишите четыре числа: в первой строке сначала целую часть произведения\nP\nx\n×10000, затем целую часть произведения\nP\ny\n×10000 для файла А, во второй строке – аналогичные данные для файла B.\nВозможные данные одного из файлов иллюстрированы графиком.\nВнимание! График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию.\nДля выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\19567_base64.png"
        ],
        "files": [
            "tasks_json\\task_27\\files\\19567_27.13.A.txt",
            "tasks_json\\task_27\\files\\19567_27.13.A.xlsx",
            "tasks_json\\task_27\\files\\19567_27.13.B.txt",
            "tasks_json\\task_27\\files\\19567_27.13.B.xlsx"
        ],
        "answer": "3785 46909"
    },
    {
        "id": 19566,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Попков) Учёный решил провести кластеризацию некоторого множества звёзд по их расположению на карте звёздного неба. Кластер звёзд – это набор звёзд (точек) на графике, лежащий внутри треугольника. Каждая звезда обязательно принадлежит только одному из кластеров.\nИстинный край кластера – это одна из звёзд в кластере, сумма расстояний от которой до всех остальных звёзд кластера максимальна.\nПод расстоянием понимается расстояние Евклида между двумя точками\nA(x\n1\n,y\n1\n) и\nB(x\n2\n,y\n2\n) на плоскости, которое вычисляется по формуле:\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n.\nАномалиями назовём звёзды, находящиеся на расстоянии более одной условной единицы от звёзд кластеров. При расчётах аномалии учитывать не нужно.\nВ файле A хранятся данные о звёздах двух кластеров. В каждой строке записана информация о расположении на карте одной звезды: сначала координата\nx, затем координата\ny. Значения даны в условных единицах. Известно, что количество звёзд не превышает 1000.\nВ файле B хранятся данные о звёздах четырёх кластеров. Известно, что количество звёзд не превышает 10 000. Структура хранения информации о звездах в файле B аналогична файлу А.\nДля каждого файла определите координаты края каждого кластера, затем вычислите два числа:\nT\nx\n – среднее арифметическое абсцисс краев кластеров, и\nT\ny\n – среднее арифметическое ординат краев кластеров.\nВ ответе запишите четыре числа: в первой строке сначала целую часть произведения\nT\nx\n×10000, затем целую часть произведения\nT\ny\n×10000 для файла А, во второй строке – аналогичные данные для файла B.\nВозможные данные одного из файлов иллюстрированы графиком.\nВнимание! График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию.\nДля выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\19566_base64.png"
        ],
        "files": [
            "tasks_json\\task_27\\files\\19566_27.17.A.txt",
            "tasks_json\\task_27\\files\\19566_27.17.A.xlsx",
            "tasks_json\\task_27\\files\\19566_27.17.B.txt",
            "tasks_json\\task_27\\files\\19566_27.17.B.xlsx"
        ],
        "answer": "216297 43456"
    },
    {
        "id": 19257,
        "difficulty": "Уровень: Базовый",
        "task": "Фрагмент звёздного неба спроецирован на плоскость с декартовой системой координат. Учёный решил провести кластеризацию полученных точек, являющихся изображениями звёзд, то есть разбить их множество на N непересекающихся непустых подмножеств (кластеров), таких что точки каждого подмножества лежат внутри прямоугольника со сторонами длиной H и W, причём эти прямоугольники между собой не пересекаются. Стороны прямоугольников не обязательно параллельны координатным осям.\nГарантируется, что такое разбиение существует и единственно для заданных размеров прямоугольников.\nБудем называть центром кластера точку этого кластера, сумма расстояний от которой до всех остальных точек кластера минимальна. Для каждого кластера гарантируется единственность его центра. Расстояние между двумя точками на плоскости\nA(x\n1\n,y\n1\n) и\nB(x\n2\n,y\n2\n) вычисляется по формуле:\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n\nВ файле A хранятся данные о звёздах двух кластеров, где H=6, W=6 для каждого кластера. В каждой строке записана информация о расположении на карте одной звезды: сначала координата x, затем координата y. Значения даны в условных единицах. Известно, что количество звёзд не превышает 1000.\nВ файле B хранятся данные о звёздах трёх кластеров, где H=5, W=5 для каждого кластера. Известно, что количество звёзд не превышает 10 000. Структура хранения информации о звездах в файле B аналогична файлу А. \nДля каждого файла определите координаты центра каждого кластера, затем вычислите два числа:\n P\nx\n– среднее арифметическое абсцисс центров кластеров, и\n P\ny\n– среднее арифметическое ординат центров кластеров.\nВ ответе запишите четыре числа: в первой строке сначала абсолютное значение целой части произведения\nP\nx\n×10000, затем абсолютное значение целой части произведения\nP\ny\n×10000 для файла А, во второй строке – аналогичные данные для файла B.\nВозможные данные одного из файлов иллюстрированы графиком. \nВнимание! График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию.\nДля выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\19257_base64.png"
        ],
        "files": [
            "tasks_json\\task_27\\files\\19257_27_A.xlsx",
            "tasks_json\\task_27\\files\\19257_27_B.xlsx"
        ],
        "answer": "43789 62202\n14271 54727"
    },
    {
        "id": 19153,
        "difficulty": "Уровень: Средний",
        "task": "(В. Лашин) Фрагмент звёздного неба спроецирован на плоскость с декартовой системой координат. Учёный решил провести кластеризацию полученных точек, являющихся изображениями звёзд, то есть разбить их множество на N непересекающихся непустых подмножеств (кластеров), таких что точки каждого подмножества лежат внутри прямоугольника со сторонами длиной H и W, причём эти прямоугольники между собой не пересекаются. Стороны прямоугольников не обязательно параллельны координатным осям.\nГарантируется, что такое разбиение существует и единственно для заданных размеров прямоугольников.\nБудем называть центром кластера точку этого кластера, сумма расстояний от которой до всех остальных точек кластера минимальна. Для каждого кластера гарантируется единственность его центра. Расстояние между двумя точками на плоскости\nA(x\n1\n,y\n1\n) и\nB(x\n2\n,y\n2\n) вычисляется по формуле:\nd(A,B)=\n(x\n1\n−x\n2\n)\n2\n+(y\n1\n−y\n2\n)\n2\n\nВ файле A хранятся данные о звёздах десяти кластеров, где H=2, W=2 для каждого кластера. В каждой строке записана информация о расположении на карте одной звезды: сначала координата x, затем координата y. Значения даны в условных единицах. Известно, что количество звёзд не превышает 1000. В файле B хранятся данные о звёздах ста кластеров, где H=2, W=2 для каждого кластера. Известно, что количество звёзд не превышает 10 000. Структура хранения информации о звездах в файле B аналогична файлу А. Для каждого файла определите координаты центра каждого кластера, затем вычислите два числа:  Px – среднее арифметическое абсцисс центров кластеров, и  Py – среднее арифметическое ординат центров кластеров. В ответе запишите четыре числа: в первой строке сначала целую часть произведения  Px×10000, затем целую часть произведения  Py×10000 для файла А, во второй строке – аналогичные данные для файла B.\nВозможные данные одного из файлов иллюстрированы графиком.\nГарантируется, что расстояние между любыми двумя точками разных кластеров превышает 1.\nВнимание! График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию.\nДля выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\19153_base64.png"
        ],
        "files": [
            "tasks_json\\task_27\\files\\19153_27_B.xlsx",
            "tasks_json\\task_27\\files\\19153_27_B.txt",
            "tasks_json\\task_27\\files\\19153_27_A.xlsx",
            "tasks_json\\task_27\\files\\19153_27_A.txt"
        ],
        "answer": "35547 28496\n13560 16104"
    },
    {
        "id": 18940,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Попков) Снежная королева решила провести кластеризацию жителей своей страны по деревням и узнать, в каком месте каждой деревни расположить место спортивных мероприятий. Каждый дом имеет свои координаты на плоскости, и необходимо определить центры кластеров, чтобы оптимально организовать зимние мероприятия.\nВ файле A содержится информация о расположении домов в двух деревнях. В каждой строке записаны координаты одного дома: сначала координата\nx, затем координата\ny (в условных единицах). Известно, что количество домов не превышает 1000.\nВ файле B содержится информация о домах трех деревней. Количество домов не превышает 10 000. Структура хранения информации аналогична файлу A.\nЛучшее место для спортивных развлечений - центроид, – это место около одного дома деревни, сумма расстояний от которой до всех остальных звезд кластера минимальна. Расстояние между двумя точками\nA(x\n1\n,y\n1\n) и\nB(x\n2\n,y\n2\n) вычисляется по формуле:\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n.\nДля каждого файла необходимо определить координаты центра каждого кластера, а затем вычислить два числа:\nP\nx\n– среднее арифметическое абсцисс центров кластеров,\nP\ny\n– среднее арифметическое ординат центров кластеров.\nВ ответе запишите четыре числа: в первой строке сначала целая часть произведения\nP\nx\n×10000, затем целая часть произведения\nP\ny\n×10000 для файла A, во второй строке – аналогичные данные для файла B.",
        "images": [],
        "files": [
            "tasks_json\\task_27\\files\\18940_27A.txt",
            "tasks_json\\task_27\\files\\18940_27A.xlsx",
            "tasks_json\\task_27\\files\\18940_27B.txt",
            "tasks_json\\task_27\\files\\18940_27B.xlsx"
        ],
        "answer": "6221 33370\n48199 23408"
    },
    {
        "id": 18884,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин, В. Лашин) В администрации резиденции Деда Мороза проводится активное обсуждение вопроса эффективности перевозки мириад подарков в канун волшебного Нового Года. Снегурочка настаивает на немедленном внедрении передовых технологий: «Старый мешок с письмами никуда не годится — в этой куче адресов невозможно разобраться, да и Дед уже не тот, даже таблетки не помогают. Если мы срочно не решим эту проблему, наш дорогой Дед Мороз скоро превратится в Санта Клауса! Министерство культуры РФ такое точно не одобрит». В сказочной резиденции с женщинами спорить не принято, тем более с такими молодыми и горячими, как прелестная Снегурочка. Да и аргументы в этот раз звучат убедительно...\nОтдел аналитики данных возложил решение обозначенной ранее проблемы на могучие плечи СнегПрогов (снеговиков-программистов). СнегПроги предложили простую концепцию: разделить письма на группы (города) по характеристике места жительства (геопозиции) их отправителей. Благодаря этому гениальному подходу Деду Морозу не придется по сто раз перемещаться между Москвой и Владивостоком, ведь он сможет переходить к доставке подарков по Москве только после того, как развезет все подарки владивостокцам. И Декабрь, Январь и Февраль точно останутся благодарны своему хозяину. К тому же получится сэкономить на бензине, что в наше время совсем не дурно!\nОдним городом СнегПроги решили считать такую группу геопозиций (точек, определенных по двум координатам\nx и\ny), в которой любая из геопозиций удалена от геопозиции из другой группы хотя бы на\nE=20 у.е. (условных единиц). А метрикой расстояния между двумя точками (геопозициями) уже традиционно стала формула Евклида:\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n.\nПомогите СнегПрогам найти оптимальные геопозиции в каждом городе для открытия в них новых филиалов резиденции. Лучшим местом будет считаться такая геопозиция, суммарное расстояние от которой до всех других геопозиций в этом же городе минимально. Если у вас все получится, СнегПроги получат в подарок от Деда Мороза новые чудо-компьютеры, сделанные из льдинок высочайшего качества. А вам в таком случае полагается хорошее настроение =)\nВ файле A хранятся записи об адресах первой партии полученных писем, образующих 2 города. В каждой строке записана информация о двух показателях геопозиции конкретного письма: сначала координата\nx, затем координата\ny. Известно, что количество записей не превышает 2200. В файле Б хранятся записи об адресах второй партии полученных писем, образующих 3 города. Известно, что количество записей не превышает 15 500. Структура хранения информации в файле Б аналогична файлу А. Возможные данные одного из файлов иллюстрированы графиком.\nДля каждого файла определите координаты новых филиалов резиденции для всех городов, а затем вычислите два числа:\nSx – среднее арифметическое абсцисс этих филиалов, и\nSy – среднее арифметическое их ординат. В ответе запишите четыре числа: в первой строке сначала целую часть значения\nSx, затем целую часть значения\nSy для файла А, во второй строке – аналогичные данные для файла Б.",
        "images": [
            "tasks_json\\task_27\\images\\18884_base64.png"
        ],
        "files": [
            "tasks_json\\task_27\\files\\18884_27_A.txt",
            "tasks_json\\task_27\\files\\18884_27_A.xlsx",
            "tasks_json\\task_27\\files\\18884_27_B.txt",
            "tasks_json\\task_27\\files\\18884_27_B.xlsx"
        ],
        "answer": "40 -30\n-19 -176"
    },
    {
        "id": 18676,
        "difficulty": "Уровень: Средний",
        "task": "Учёный решил провести кластеризацию некоторого множества звёзд по их расположению на карте звёздного неба. Кластер звёзд – это набор звёзд (точек) на графике. Каждая звезда обязательно принадлежит только одному из кластеров.\nИстинный центр кластера, или центроид, – это одна из звёзд на графике, сумма расстояний от которой до всех остальных звёзд кластера минимальна.\nПод расстоянием понимается расстояние Евклида между двумя точками\nA(x\n1\n,y\n1\n) и\nB(x\n2\n,y\n2\n) на плоскости, которое вычисляется по формуле:\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n\nВ файле A хранятся данные о звёздах двух кластеров. В каждой строке записана информация о расположении на карте одной звезды: сначала координата x, затем координата y (в условных единицах). Известно, что количество звёзд не превышает 1000. В файле Б хранятся данные о звёздах трёх кластеров. Известно, что количество звёзд не превышает 10 000. Структура хранения информации о звездах в файле Б аналогична файлу А.\nДля каждого файла определите координаты центра каждого кластера, затем вычислите два числа:\n P\nx\n– среднее арифметическое абсцисс центров кластеров, и\n P\ny\n– среднее арифметическое ординат центров кластеров.\nВ ответе запишите четыре числа: в первой строке сначала целую часть произведения\nP\nx\n×100000, затем целую часть произведения\nP\ny\n×100000 для файла А, во второй строке – аналогичные данные для файла B.\nВозможные данные одного из файлов иллюстрированы графиком. \nВнимание! График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию.\nДля выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\18676_7728.gif"
        ],
        "files": [
            "tasks_json\\task_27\\files\\18676_27A.txt",
            "tasks_json\\task_27\\files\\18676_27B.txt"
        ],
        "answer": "566258 38951\n591893 290926"
    },
    {
        "id": 18628,
        "difficulty": "Уровень: Средний",
        "task": "Учёный решил провести кластеризацию некоторого множества звёзд по их расположению на карте звёздного неба. Кластер звёзд – это набор звёзд (точек) на графике. Каждая звезда обязательно принадлежит только одному из кластеров.\nИстинный центр кластера, или центроид, – это одна из звёзд на графике, сумма расстояний от которой до всех остальных звёзд кластера минимальна.\nПод расстоянием понимается расстояние Евклида между двумя точками\nA(x\n1\n,y\n1\n) и\nB(x\n2\n,y\n2\n) на плоскости, которое вычисляется по формуле:\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n\nВ файле A хранятся данные о звёздах двух кластеров. В каждой строке записана информация о расположении на карте одной звезды: сначала координата x, затем координата y (в условных единицах). Известно, что количество звёзд не превышает 1000. В файле Б хранятся данные о звёздах трёх кластеров. Известно, что количество звёзд не превышает 10 000. Структура хранения информации о звездах в файле Б аналогична файлу А.\nДля каждого файла определите координаты центра каждого кластера, затем вычислите два числа:\n P\nx\n– среднее арифметическое абсцисс центров кластеров, и\n P\ny\n– среднее арифметическое ординат центров кластеров.\nВ ответе запишите четыре числа: в первой строке сначала целую часть произведения\nP\nx\n×100000, затем целую часть произведения\nP\ny\n×100000 для файла А, во второй строке – аналогичные данные для файла B.\nВозможные данные одного из файлов иллюстрированы графиком. \nВнимание! График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию.\nДля выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\18628_7708.gif"
        ],
        "files": [
            "tasks_json\\task_27\\files\\18628_27A.txt",
            "tasks_json\\task_27\\files\\18628_27B.txt"
        ],
        "answer": "258853 499656\n6165 372336"
    },
    {
        "id": 18624,
        "difficulty": "Уровень: Средний",
        "task": "Учёный решил провести кластеризацию некоторого множества звёзд по их расположению на карте звёздного неба. Кластер звёзд – это набор звёзд (точек) на графике. Каждая звезда обязательно принадлежит только одному из кластеров.\nИстинный центр кластера, или центроид, – это одна из звёзд на графике, сумма расстояний от которой до всех остальных звёзд кластера минимальна.\nПод расстоянием понимается расстояние Евклида между двумя точками\nA(x\n1\n,y\n1\n) и\nB(x\n2\n,y\n2\n) на плоскости, которое вычисляется по формуле:\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n\nВ файле A хранятся данные о звёздах двух кластеров. В каждой строке записана информация о расположении на карте одной звезды: сначала координата x, затем координата y (в условных единицах). Известно, что количество звёзд не превышает 1000. В файле Б хранятся данные о звёздах трёх кластеров. Известно, что количество звёзд не превышает 10 000. Структура хранения информации о звездах в файле Б аналогична файлу А.\nДля каждого файла определите координаты центра каждого кластера, затем вычислите два числа:\n P\nx\n– среднее арифметическое абсцисс центров кластеров, и\n P\ny\n– среднее арифметическое ординат центров кластеров.\nВ ответе запишите четыре числа: в первой строке сначала целую часть произведения\nP\nx\n×100000, затем целую часть произведения\nP\ny\n×100000 для файла А, во второй строке – аналогичные данные для файла B.\nВозможные данные одного из файлов иллюстрированы графиком. \nВнимание! График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию.\nДля выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\18624_7698.gif"
        ],
        "files": [
            "tasks_json\\task_27\\files\\18624_27A.txt",
            "tasks_json\\task_27\\files\\18624_27B.txt"
        ],
        "answer": "455058 449904\n366751 398174"
    },
    {
        "id": 18622,
        "difficulty": "Уровень: Базовый",
        "task": "В лаборатории проводится эксперимент, состоящий из множества испытаний. Результат каждого испытания представляется в виде пары чисел. Для визуализации результатов эта пара рассматривается как координаты точки на плоскости, и на чертеже отмечаются точки, соответствующие всем испытаниям.\nПо результатам эксперимента проводится кластеризация полученных результатов: на плоскости выделяется несколько кластеров - прямоугольников размером 3×3 так, что каждая точка попадает ровно в один кластер.\nЦентроидом кластера называется та из входящих в него точек, для которой минимальна сумма расстояний до всех остальных точек кластера.\nОбработка результатов эксперимента включает следующие шаги:\n1) кластер, содержащий наибольшее число точек, исключается;\n2) определяются центроиды всех оставшихся кластеров;\n3) для найденных центроидов вычисляется средняя точка. Средней для группы точек называется точка (не обязательно входящая в группу), координаты которой определяются как средние арифметические значения координат всех точек группы.\nВ файле записан протокол проведения эксперимента. Каждая строка файла содержит два числа: координаты X и Y точки, соответствующей одному испытанию. По данному протоколу надо определить среднюю точку центроидов всех кластеров за исключением содержащего наибольшее число точек.\nВам даны два входных файла (A и B), каждый из которых имеет описанную выше структуру. По данным каждого из представленных файлов определите координаты средней точки по описанным выше правилам. \nВ ответе запишите четыре числа: сначала (в первой строке) координаты X и Y средней точки для файла A, затем (во второй строке) координаты X и Y средней точки для файла B.\nВ качестве значения координаты указывайте целую часть от умножения числового значения координаты на 10 000.",
        "images": [],
        "files": [
            "tasks_json\\task_27\\files\\18622_27A.xlsx",
            "tasks_json\\task_27\\files\\18622_27A.txt",
            "tasks_json\\task_27\\files\\18622_27B.xlsx",
            "tasks_json\\task_27\\files\\18622_27B.txt"
        ],
        "answer": "4597 23685\n25450 24994"
    },
    {
        "id": 18585,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) Ведущие специалисты отдела бизнес-аналитики торгового маркетплейса «Ozonyol» собирают статистику и изучают предпочтения покупателей за период летних и осенних продаж. Перед ними стоит задача – проанализировать рынок и сделать выводы об уровне спроса на товары различных категорий для выделения наиболее перспективных траекторий развития площадки с привлечением инвестиционных средств. По итогам сбора информации имеется набор данных, включающий записи о товарах, каждый из которых содержит три показателя – номер сегмента товара, характеризующий его расположение на сайте, коэффициент успешных конверсий и уровень заинтересованности покупателей, выраженный в коэффициенте их активности. Общий спрос на товар вычисляется как среднее арифметическое второго и третьего показателей. На основании полученной информации строится графический отчёт, отражающий общий спрос на товар в зависимости от его номера сегмента, в котором записи, лежащие в области окружности с радиусом\nR, выделяются в отдельные кластеры. В итоге решено привлекать средства на продвижение товаров только из кластеров, содержащих хотя бы\nK записей, причем первые вложения направить в товары-медоиды. Медоидом (центром) кластера называется такая запись о товаре, суммарное расстояние от которой до других записей в кластере минимально. Метрикой расстояния между двумя записями\nA(x1,y1) и\nB(x2,y2) является формула Евклида:\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n.\nПримечание. Гарантируется, что каждый товар принадлежит только одному из кластеров.\nВ файле A в первой строке записаны числа\nR и\nK. В остальных строках хранятся записи о товарах за период летних продаж, образующих 3 кластера. В каждой строке записана информация о трех показателях конкретного товара: сначала номер сегмента товара, затем коэффициент успешных конверсий и коэффициент активности. Известно, что количество записей не превышает 1100. В файле Б хранятся записи о товарах за период осенних продаж, образующих 6 кластеров, и соответствующие осенним продажам числа\nR и\nK. Известно, что количество записей не превышает 11 000. Структура хранения информации о товарах в файле Б аналогична файлу А. Возможные данные одного из файлов иллюстрированы графиком.\nДля каждого файла определите координаты медоидов (центров) всех кластеров, для продвижения которых будут привлечены инвестиционные средства, а затем вычислите два числа:\nSx – среднее арифметическое абсцисс центров кластеров, и\nSy – среднее арифметическое ординат центров кластеров. В ответе запишите четыре числа: в первой строке сначала целую часть произведения\nSx×100000, затем целую часть произведения\nSy×100000 для файла А, во второй строке – аналогичные данные для файла Б.",
        "images": [
            "tasks_json\\task_27\\images\\18585_base64.png"
        ],
        "files": [
            "tasks_json\\task_27\\files\\18585_27_A.txt",
            "tasks_json\\task_27\\files\\18585_27_A.xls",
            "tasks_json\\task_27\\files\\18585_27_B.txt",
            "tasks_json\\task_27\\files\\18585_27_B.xls"
        ],
        "answer": "728724 506096\n328813 419784"
    },
    {
        "id": 18390,
        "difficulty": "Уровень: Средний",
        "task": "(Л. Шастин) Популярная компания по доставке продуктов «Быстрокат» расширяется и хочет открыть новые филиалы в двух густонаселенных районах города. Для открытия отдела логистам необходимо выбрать самую подходящую геолокацию для оптимизации организации процессов по координации и доставке товаров,  для чего им нужно проанализировать множество жилых единиц (геопозиций). Каждый район состоит из нескольких микрорайонов, включающих в себя некоторое количество геопозиций. Известно, что каждый микрорайон характеризуется тем, что любая из его геопозиций удалена от любой геопозиции из других микрорайонов хотя бы на\nR у.е. (условных единиц). Для анализа данных используется предоставленный набор вещественных точек (геопозиций), размещенных на декартовой оси координат. Они характеризуют все геопозиции конкретного района, который представляет собой квадрат размером\n10 у.е. (условных единиц). С целью определить оптимальную геолокацию для открытия филиала логисты вычисляют медоид (райцентр) каждого микрорайона, который определяется как такая геопозиция внутри одного микрорайона, суммарное расстояние от которой до всех других геопозиций этого же микрорайона минимально. Затем специалисты определяют конечный медоид, опираясь на данные о расположении ранее найденных медоидов, – такую геопозицию, суммарное расстояние от которой до всех медоидов минимально. Именно в этой геопозиции и будет затем открыт новый филиал. При проведении расчетов также исключаются аномальные геопозиции, случайно попавшие в представленный набор данных. Они определяются как точки, расстояние от которых до любой другой точки в наборе данных превышает\nK у.е. (условных единиц). Метрикой расстояния между двумя геопозициями (точками)\nA(x1,y1) и\nB(x2,y2) на плоскости является формула Евклида:\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n.\nВ файле A хранятся данные обо всех геопозициях первого района. В первой строке записаны значения\nR и\nK для этого района. В каждой из следующих строк записана информация о расположении в районе одной геопозиции:  сначала  координата \nx,  затем  координата \ny. Значения даны в условных единицах, которые представлены вещественными числами. Известно, что количество геопозиций не превышает 2000. В файле Б хранятся данные обо всех геопозициях второго района. В первой строке записаны значения\nR и\nK для этого района. Известно, что количество геопозиций не превышает 30 000. Структура хранения информации о звездах в файле Б аналогична файлу А. \nДля каждого файла определите геопозицию, в которой будет открыт филиал. В ответе запишите четыре числа: в первой строке сначала целую часть произведения координаты\nx этой геопозиции на\n10000, затем целую часть произведения координаты\ny этой геопозиции на\n10000 для файла А, во второй строке – аналогичные данные для файла Б.\nВозможные данные одного из файлов иллюстрированы графиком.  Внимание!  График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию. Для выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\18390_base64.png"
        ],
        "files": [
            "tasks_json\\task_27\\files\\18390_27_A.txt",
            "tasks_json\\task_27\\files\\18390_27_B.txt",
            "tasks_json\\task_27\\files\\18390_27_B.xlsx",
            "tasks_json\\task_27\\files\\18390_27_A.xlsx"
        ],
        "answer": "33923 51105\n33732 37221"
    },
    {
        "id": 18314,
        "difficulty": "Уровень: Базовый",
        "task": "(Д. Бахтиев) На складе с автоматической системой управления работают роботы, которые собирают грузы, расположенные на разных участках склада. Склад представляет собой прямоугольную сетку высотой\nH и шириной\nW. Каждый робот может перемещаться только вдоль осей сетки (вверх, вниз, влево, вправо), поэтому для оценки расстояний между объектами используется манхэттенское расстояние.\nГруппа инженеров решила оптимизировать работу роботов, минимизировав общее время сбора грузов. Для этого необходимо определить координаты груза в каждом участке склада, для которой сумма расстояний от неё до всех грузов на участке будет минимальной. Эта точка называется центроидом. Робот, находящийся в центроиде, сможет быстрее собрать все грузы на своём участке.\nПод расстоянием между двумя точками\nA(x1,y1) и\nB(x2,y2) понимается манхэттенское расстояние, которое вычисляется по формуле:\nd(A,B)=∣x2−x1∣+∣y2−y1∣\nВ файле A хранятся данные о расположении грузов на двух участках склада, где каждый участок имеет размеры\nH=10 и\nW=20. В каждой строке записана информация о расположении одного груза: сначала координата\nx, затем координата\ny. Количество грузов в файле не превышает 1000.\nВ файле B хранятся данные о грузах на трёх участках склада, где каждый участок также имеет размеры\nH=10 и\nW=20. Количество грузов в файле не превышает 10 000. Структура хранения информации о грузах в файле B аналогична файлу A.\nДля каждого файла определите координаты центра каждого участка (центроида), а затем вычислите два числа:\nPx — среднее арифметическое абсцисс центроидов участков,\nPy — среднее арифметическое ординат центроидов участков.\nВ ответе запишите четыре числа: в первой строке сначала целую часть произведения\nPx∗1000 затем целую часть произведения\nPy∗1000 для файла A; во второй строке — аналогичные данные для файла B.\nВозможные данные одного из файлов иллюстрированы графиком. \nВнимание! График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию.\nДля выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\18314_base64.png"
        ],
        "files": [
            "tasks_json\\task_27\\files\\18314_27_A.txt",
            "tasks_json\\task_27\\files\\18314_27_B.txt",
            "tasks_json\\task_27\\files\\18314_27_A.xlsx",
            "tasks_json\\task_27\\files\\18314_27_B.xlsx"
        ],
        "answer": "23509 554"
    },
    {
        "id": 18184,
        "difficulty": "Уровень: Средний",
        "task": "(Д. Бахтиев) Радиус Шварцшильда — это характеристика черной дыры, определяющая её границу, которую часто называют горизонтом событий. Учёный изучает вращение звёзд (точек) вокруг чёрных дыр и рассматривает те звёзды, которые находятся в диапазоне от одного до трёх радиусов Шварцшильда. Назовём расстоянием между чёрной дырой и звездой — расстояние от звезды до горизонта событий рассматриваемой чёрной дыры.\nРасстояние между двумя точками можно вычислить по формуле:\nd=\n(x−a)\n2\n+(y−b)\n2\n, где (x; y) и (a; b) — координаты точек. Гарантируется, что ни одна звезда не находится в диапазоне от одного до трёх радиусов Шварцшильда сразу двух или более чёрных дыр.\nВ файлах A и Б хранятся данные о чёрных дырах и звёздах. В первой строке указано число n — количество чёрных дыр. В последующих n строках указаны три числа: первое и второе — координаты x и y (в условных единицах) центра чёрной дыры соответственно, третье — радиус Шварцшильда (в условных единицах) для этой чёрной дыры. В каждой последующей строке записана информация о расположении одной звезды — сначала координата x, затем координата y.\nИзвестно, что количество звёзд в файле А не превышает 1000, а в файле Б — 10000. \nДля каждой чёрной дыры найдите среднее арифметическое расстояние от неё до звёзд, находящихся в диапазоне от одного до трёх радиусов Шварцшильда соответствующей чёрной дыры. Полученные результаты умножьте на 1000 и отбросьте все оставшиеся десятичные знаки. В ответе запишите сначала наибольшее, а затем наименьшее значения для файла А. Затем запишите подсчитанные значения для файла Б в том же порядке.",
        "images": [],
        "files": [
            "tasks_json\\task_27\\files\\18184_27_A.txt",
            "tasks_json\\task_27\\files\\18184_27_B.txt"
        ],
        "answer": "3408 2439\n6561 3294"
    },
    {
        "id": 18150,
        "difficulty": "Уровень: Базовый",
        "task": "(В. Колчев) Учёный решил провести кластеризацию некоторого множества звёзд по их расположению на карте звёздного неба. Кластер звёзд – это набор звёзд (точек) на графике, лежащий внутри прямоугольника высотой H и шириной W. Каждая звезда обязательно принадлежит только одному из кластеров.\nИстинный центр кластера, или центроид, – это одна из звёзд на графике, сумма расстояний от которой до всех остальных звёзд кластера минимальна.\nПод расстоянием понимается расстояние Евклида между двумя точками\nA(x\n1\n,y\n1\n) и\nB(x\n2\n,y\n2\n) на плоскости, которое вычисляется по формуле:\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n\nВ файле A хранятся данные о звёздах двух кластеров, где H=3, W=3 для каждого кластера. В каждой строке записана информация о расположении на карте одной звезды: сначала координата x, затем координата y. Значения даны в условных единицах. Известно, что количество звёзд не превышает 1000.\nВ файле B хранятся данные о звёздах трёх кластеров, где H=3, W=3 для каждого кластера. Известно, что количество звёзд не превышает 10 000. Структура хранения информации о звездах в файле B аналогична файлу А. \nДля каждого файла определите координаты центра каждого кластера, затем вычислите два числа:  Px – среднее арифметическое абсцисс центров кластеров, и  Py – среднее арифметическое ординат центров кластеров.\nВ ответе запишите четыре числа: в первой строке сначала целую часть произведения  Px×1000, затем целую часть произведения  Py×1000 для файла А, во второй строке – аналогичные данные для файла B.\nВозможные данные одного из файлов иллюстрированы графиком. \nВнимание! График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию.\nДля выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\18150_base64.png"
        ],
        "files": [
            "tasks_json\\task_27\\files\\18150_27A.txt",
            "tasks_json\\task_27\\files\\18150_27B.txt"
        ],
        "answer": "2467 1343"
    },
    {
        "id": 18055,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Крючков) В лесу выделено несколько мест (кластеров), где растёт много деревьев, предназначенных для вырубки. После спиливания дерева его нужно доставить в точку сбора, которая совпадает с одним из деревьев кластера. Стоимость доставки определяется как расстояние от дерева до точки сбора, умноженное на высоту дерева. Расстояние между двумя точками\nA(x\n1\n,y\n1\n) и\nB(x\n2\n,y\n2\n) вычисляется по формуле\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n.\nВ каждом кластере нужно найти оптимальную точку сбора (центр), такую что суммарная стоимость доставки в это место всех спиленных деревьев данного кластера минимальна. Аномалиями назовём совокупности из не более чем 10 точек, каждая из которых находится на расстоянии более 30 м от точек кластеров. Аномалии в расчётах не учитываются.\nВ файле A хранятся данные о двух кластерах. Каждый кластер имеет форму прямоугольника размером 100×100 м. Каждая строка файла содержит три характеристики одного дерева: координату x, затем координату y и затем высоту дерева. Количество деревьев в каждом кластере не превышает 1000. В файле Б той же структуры хранятся данные о трёх кластерах, каждый из которых имеет вид прямоугольника размером не более 100×200 м. Количество точек в каждом кластере не превышает 10 000.\nДля каждого файла определите координаты центра каждого кластера, затем вычислите два числа:\nP\nx\n– среднее арифметическое абсцисс центров кластеров, и\nP\ny\n– среднее арифметическое ординат центров кластеров. В ответе запишите четыре числа: в первой строке сначала целую часть произведения\nP\nx\n×100000, затем целую часть произведения\nP\ny\n×100000 для файла А, во второй строке – аналогичные данные для файла Б.\nВозможные данные одного из файлов иллюстрированы графиком. \nВнимание! График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию.\nДля выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\18055_7654.gif"
        ],
        "files": [
            "tasks_json\\task_27\\files\\18055_27A.txt",
            "tasks_json\\task_27\\files\\18055_27A.xls",
            "tasks_json\\task_27\\files\\18055_27B.txt",
            "tasks_json\\task_27\\files\\18055_27B.xls"
        ],
        "answer": "25667971 24175730"
    },
    {
        "id": 18054,
        "difficulty": "Уровень: Базовый",
        "task": "(В. Ланская, Р. Ягафаров) В городе X тестируется проект по оптимизации размещения кранов на складах. Оптимальное местоположение для крана (или центроид) будет таким, при котором сумма расстояний Чебышева от этого места до всех других точек на складе была минимальной. Расстояние Чебышева между двумя точками\nA(x\n1\n,y\n1\n) и\nB(x\n2\n,y\n2\n) вычисляется по формуле\nd(A,B)=max(∣x\n2\n−x\n1\n∣,∣y\n2\n−y\n1\n∣).\nВ файле A хранятся данные о двух складских комплексах (кластерах). Каждый комплекс имеет форму прямоугольника размером H = 3 и W = 5. Каждая строка файла содержит координаты одной точки на складе: сначала x, затем y. Количество точек в каждом комплексе не превышает 1000. В файле Б той же структуры хранятся данные о трёх кластерах, каждый из которых имеет вид прямоугольника размером H = 6 и W = 8. Количество точек в каждом комплексе не превышает 10 000.\nДля каждого файла определите координаты центра каждого кластера, затем вычислите два числа:\nP\nx\n– среднее арифметическое абсцисс центров кластеров, и\nP\ny\n– среднее арифметическое ординат центров кластеров. В ответе запишите четыре числа: в первой строке сначала целую часть произведения\nP\nx\n×10000, затем целую часть произведения\nP\ny\n×10000 для файла А, во второй строке – аналогичные данные для файла Б.\nВозможные данные одного из файлов иллюстрированы графиком. \nВнимание! График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию.\nДля выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\18054_7652a.gif"
        ],
        "files": [
            "tasks_json\\task_27\\files\\18054_27A.txt",
            "tasks_json\\task_27\\files\\18054_27A.xls",
            "tasks_json\\task_27\\files\\18054_27B.txt",
            "tasks_json\\task_27\\files\\18054_27B.xls"
        ],
        "answer": "26521 53559"
    },
    {
        "id": 18052,
        "difficulty": "Уровень: Средний",
        "task": "(В. Шубинкин) При проведении эксперимента заряженные частицы попадают на чувствительный экран размером 12 на 9 условных единиц. При попадании каждой частицы на экран в протоколе фиксируются координаты попадания в условных единицах. При анализе результатов выделяют кластеры – группы точек на экране, в которые попали частицы. Каждая точка принадлежит только одному кластеру. Минимальное (максимальное) расстояние между кластерами – это минимальное (максимальное) расстояние между двумя точками, одна из которых принадлежит одному кластеру, а вторая – другому. Расстояние между двумя точками\nA(x\n1\n,y\n1\n) и\nB(x\n2\n,y\n2\n) вычисляется по формуле\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n\nАномалиями назовём совокупности из не более чем 10 точек, каждая из которых находится на расстоянии более одной условной единицы от точек кластеров. Аномалии в расчётах не учитываются.\nВ файле A хранятся данные о звёздах двух кластеров. В каждой строке записана информация о расположении на карте одной точки: сначала координата x, затем координата y (в условных единицах). Известно, что количество точек не превышает 1000. В файле Б хранятся данные о трёх кластерах. Известно, что количество точек не превышает 10 000. Структура хранения информации о точках в файле Б аналогична файлу А. Возможные данные одного из файлов иллюстрированы графиком.\nДля каждого файла определите минимальное\nd\nmin\nи максимальное\nd\nmax\nрасстояния между двумя кластерами. В ответ запишите 4 числа: в первой строке целую часть произведения\nd\nmin\n×10000, затем целую часть произведения\nd\nmax\n×10000 для файла А, во второй строке – аналогичные данные для файла Б.\nВозможные данные одного из файлов иллюстрированы графиком. \nВнимание! График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию.\nДля выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\18052_7612.gif"
        ],
        "files": [
            "tasks_json\\task_27\\files\\18052_27A.txt",
            "tasks_json\\task_27\\files\\18052_27A.xls",
            "tasks_json\\task_27\\files\\18052_27B.txt",
            "tasks_json\\task_27\\files\\18052_27B.xls"
        ],
        "answer": "40112 103021\n20063 94283"
    },
    {
        "id": 18051,
        "difficulty": "Уровень: Средний",
        "task": "Учёный решил провести кластеризацию некоторого множества звёзд по их расположению на карте звёздного неба. Кластер звёзд – это набор звёзд (точек) на графике. Каждая звезда обязательно принадлежит только одному из кластеров.\nИстинный центр кластера, или центроид, – это одна из звёзд на графике, сумма расстояний от которой до всех остальных звёзд кластера минимальна.\nПод расстоянием понимается расстояние Евклида между двумя точками\nA(x\n1\n,y\n1\n) и\nB(x\n2\n,y\n2\n) на плоскости, которое вычисляется по формуле:\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n\nВ файле A хранятся данные о звёздах двух кластеров. В каждой строке записана информация о расположении на карте одной звезды: сначала координата x, затем координата y (в условных единицах). Известно, что количество звёзд не превышает 1000. В файле Б хранятся данные о звёздах трёх кластеров. Известно, что количество звёзд не превышает 10 000. Структура хранения информации о звездах в файле Б аналогична файлу А.\nДля каждого файла определите координаты центра каждого кластера, затем вычислите два числа:\n P\nx\n– среднее арифметическое абсцисс центров кластеров, и\n P\ny\n– среднее арифметическое ординат центров кластеров.\nВ ответе запишите четыре числа: в первой строке сначала целую часть произведения\n P\nx\n×10000, затем целую часть произведения\n P\ny\n×10000 для файла А, во второй строке – аналогичные данные для файла B.\nВозможные данные одного из файлов иллюстрированы графиком. \nВнимание! График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию.\nДля выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\18051_base64.png"
        ],
        "files": [
            "tasks_json\\task_27\\files\\18051_27A.txt",
            "tasks_json\\task_27\\files\\18051_27A.xls",
            "tasks_json\\task_27\\files\\18051_27B.txt",
            "tasks_json\\task_27\\files\\18051_27B.xls"
        ],
        "answer": "10410 66711\n81775 7384"
    },
    {
        "id": 18031,
        "difficulty": "Уровень: Базовый",
        "task": "(Л. Шастин) Учёный решил провести кластеризацию некоторого множества звёзд по их расположению на карте звёздного неба. Кластер звёзд – это набор звёзд (точек) на  графике, лежащий внутри прямоугольника высотой\nH и шириной\nW. Каждая  звезда обязательно принадлежит  только одному  из кластеров. Под расстоянием между двумя кластерами понимается минимальное расстояние между двумя звёздами этих кластеров, а расстояние между двумя точками\nA(x1,y1) и\nB(x2,y2) на плоскости вычисляется по формуле Евклида:\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n.\nВ файле A хранятся данные о звёздах двух кластеров, где\nH=W=3 для каждого кластера. В каждой строке записана информация о расположении на карте  одной  звезды:  сначала  координата \nx,  затем  координата \ny. Значения даны в условных единицах, которые представлены вещественными числами. Известно, что количество звёзд не превышает 1000.  В файле Б хранятся данные о звёздах пяти кластеров, где\nH=W=2 для каждого кластера. Известно, что количество  звёзд  не превышает 10 000. Структура хранения информации о звездах в файле Б аналогична файлу А. \nДля каждого файла определите два кластера, расстояние между которыми минимально, и затем вычислите два числа:\nS\nx\n– сумму координат абсцисс точек, образующих минимальное расстояние между этими кластерами, и\nS\ny\n– сумму координат ординат этих точек. \nВ  ответе  запишите четыре  числа:  в  первой  строке  сначала целую часть произведения\nS\nx\n×1000, затем целую часть произведения\nS\ny\n×1000 для файла А, во второй строке – аналогичные данные для файла Б.\nВозможные данные одного из файлов иллюстрированы графиком.  Внимание!  График  приведён  в иллюстративных  целях  для произвольных  значений,  не  имеющих  отношения  к  заданию. Для выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\18031_base64.png"
        ],
        "files": [
            "tasks_json\\task_27\\files\\18031_27A.txt",
            "tasks_json\\task_27\\files\\18031_27A.xlsx",
            "tasks_json\\task_27\\files\\18031_27B.txt",
            "tasks_json\\task_27\\files\\18031_27B.xlsx"
        ],
        "answer": "1731 6256\n18166 26588"
    },
    {
        "id": 17953,
        "difficulty": "Уровень: Базовый",
        "task": "(А. Сражаев) Учёный решил провести кластеризацию некоторого множества звёзд по их расположению на карте звёздного неба. Кластер звёзд – это набор звёзд (точек) на графике, лежащий внутри прямоугольника высотой H и шириной W. Каждая звезда обязательно принадлежит только одному из кластеров.\nИстинный центр кластера, или центроид, – это одна из звёзд на графике, суммарное гравитационное воздействие которой на звёзды кластера минимально. Гравитационное воздействие между двумя звёздами равно произведению расстояния между ними на модуль разности гравитационного поля этих звёзд. Под расстоянием понимается расстояние Евклида между двумя точками\nA(x\n1\n,y\n1\n) и\nB(x\n2\n,y\n2\n) на плоскости, которое вычисляется по формуле:\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n\nВ файле A хранятся данные о звёздах двух кластеров, где H=7, W=8 для каждого кластера. В каждой строке записана информация о расположении на карте одной звезды: сначала координата x, затем координата y, последним значением указано гравитационное поле g. Значения даны в условных единицах. Известно, что количество звёзд не превышает 1 000.\nВ файле B хранятся данные о звёздах трёх кластеров, где H=6, W=12 для каждого кластера. Известно, что количество звёзд не превышает 10 000. Структура хранения информации о звездах в файле B аналогична файлу А.\nДля каждого файла определите координаты центроида каждого кластера, затем определите центроид гравитационное поле которого максимально.\nВ ответе запишите четыре числа: в первой строке сначала целую часть координаты\nх×1000, затем целую часть координаты\ny× 1000 найденного центроида для файла А, во второй строке – аналогичные данные для файла B.\n\nВнимание! График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию.\nДля выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\17953_base64.png"
        ],
        "files": [
            "tasks_json\\task_27\\files\\17953_27_A.txt",
            "tasks_json\\task_27\\files\\17953_27_A.xlsx",
            "tasks_json\\task_27\\files\\17953_27_B.txt",
            "tasks_json\\task_27\\files\\17953_27_B.xlsx"
        ],
        "answer": "6891 20220\n969 3060"
    },
    {
        "id": 17917,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Ишимов) Учёный решил провести кластеризацию некоторого множества звёзд по их расположению на карте звёздного неба. Кластер звёзд – это набор звёзд (точек) на графике, лежащий внутри прямоугольника высотой H и шириной W. Каждая звезда обязательно принадлежит только одному из кластеров.\nИстинный центр кластера, или центроид, – это одна из звёзд на графике, сумма расстояний от которой до всех остальных звёзд кластера минимальна.\nПод расстоянием понимается расстояние Евклида между двумя точками\nA(x\n1\n,y\n1\n) и\nB(x\n2\n,y\n2\n) на плоскости, которое вычисляется по формуле:\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n\nВ файле A хранятся данные о звёздах, где H=3, W=3 для каждого кластера. В каждой строке записана информация о расположении на карте одной звезды: сначала координата x, затем координата y. Значения даны в условных единицах. Известно, что количество звёзд не превышает 1000.\nВ файле B хранятся данные о звёздах, где H=3, W=3 для каждого кластера. Известно, что количество звёзд не превышает 10 000. Структура хранения информации о звездах в файле B аналогична файлу А. \nДля каждого файла определите минимальное возможное количество кластеров для соответствующего набора, а также координаты центра каждого кластера, затем вычислите два числа:\nP\nx\n– среднее арифметическое абсцисс центров кластеров, и\nP\ny\n– среднее арифметическое ординат центров кластеров.\nВ ответе запишите четыре числа: в первой строке сначала целую часть произведения\n P\nx\n×10000, затем целую часть произведения\n P\ny\n×10000 для файла А, во второй строке – аналогичные данные для файла B.\nВозможные данные одного из файлов иллюстрированы графиком. \nВнимание! График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию.\nДля выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\17917_base64.png"
        ],
        "files": [
            "tasks_json\\task_27\\files\\17917_27_A.txt",
            "tasks_json\\task_27\\files\\17917_27_A.xlsx",
            "tasks_json\\task_27\\files\\17917_27_B.txt",
            "tasks_json\\task_27\\files\\17917_27_B.xlsx"
        ],
        "answer": "119313 105605\n183995 50612"
    },
    {
        "id": 17916,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Ишимов) Учёный решил провести кластеризацию некоторого множества звёзд по их расположению на карте звёздного неба. Кластер звёзд – это набор звёзд (точек) на графике, лежащий внутри прямоугольника высотой H и шириной W. Каждая звезда обязательно принадлежит только одному из кластеров.\nИстинный центр кластера, или центроид, – это одна из звёзд на графике, сумма расстояний от которой до всех остальных звёзд кластера минимальна.\nПод расстоянием понимается расстояние Евклида между двумя точками\nA(x\n1\n,y\n1\n) и\nB(x\n2\n,y\n2\n) на плоскости, которое вычисляется по формуле:\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n\nВ файле A хранятся данные о звёздах двух кластеров, где H=2, W=2 для каждого кластера. В каждой строке записана информация о расположении на карте одной звезды: сначала координата x, затем координата y. Значения даны в условных единицах. Известно, что количество звёзд не превышает 1000.\nВ файле B хранятся данные о звёздах пяти кластеров, где H=2, W=2 для каждого кластера. Известно, что количество звёзд не превышает 10 000. Структура хранения информации о звездах в файле B аналогична файлу А. \nДля каждого файла определите координаты центра каждого кластера, затем вычислите два числа:\n P\nx\n– среднее арифметическое абсцисс центров кластеров, и\n P\ny\n– среднее арифметическое ординат центров кластеров.\nВ ответе запишите четыре числа: в первой строке сначала целую часть произведения\n P\nx\n×10000, затем целую часть произведения\n P\ny\n×10000 для файла А, во второй строке – аналогичные данные для файла B.\nВозможные данные одного из файлов иллюстрированы графиком. \nВнимание! График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию.\nДля выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\17916_base64.png"
        ],
        "files": [
            "tasks_json\\task_27\\files\\17916_27_A.txt",
            "tasks_json\\task_27\\files\\17916_27_A.xlsx",
            "tasks_json\\task_27\\files\\17916_27_B.txt",
            "tasks_json\\task_27\\files\\17916_27_B.xlsx"
        ],
        "answer": "119766 83062\n90275 74960"
    },
    {
        "id": 17915,
        "difficulty": "Уровень: Базовый",
        "task": "(М. Ишимов) Учёный решил провести кластеризацию некоторого множества звёзд по их расположению на карте звёздного неба. Кластер звёзд – это набор звёзд (точек) на графике, лежащий внутри прямоугольника высотой H и шириной W. Каждая звезда обязательно принадлежит только одному из кластеров.\nИстинный центр кластера, или центроид, – это одна из звёзд на графике, сумма расстояний от которой до всех остальных звёзд кластера минимальна.\nПод расстоянием понимается расстояние Евклида между двумя точками\nA(x\n1\n,y\n1\n) и\nB(x\n2\n,y\n2\n) на плоскости, которое вычисляется по формуле:\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n\nВ файле A хранятся данные о звёздах трёх кластеров, где H=5, W=5 для каждого кластера. В каждой строке записана информация о расположении на карте одной звезды: сначала координата x, затем координата y. Значения даны в условных единицах. Известно, что количество звёзд не превышает 1000.\nВ файле B хранятся данные о звёздах четырёх кластеров, где H=5, W=5 для каждого кластера. Известно, что количество звёзд не превышает 10 000. Структура хранения информации о звездах в файле B аналогична файлу А. \nДля каждого файла определите координаты центра каждого кластера, затем вычислите два числа:\n P\nx\n– среднее арифметическое абсцисс центров кластеров, и\n P\ny\n– среднее арифметическое ординат центров кластеров.\nВ ответе запишите четыре числа: в первой строке сначала целую часть произведения\n P\nx\n×10000, затем целую часть произведения\n P\ny\n×10000 для файла А, во второй строке – аналогичные данные для файла B.\nВозможные данные одного из файлов иллюстрированы графиком. \nВнимание! График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию.\nДля выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\17915_base64.png"
        ],
        "files": [
            "tasks_json\\task_27\\files\\17915_27_A.txt",
            "tasks_json\\task_27\\files\\17915_27_A.xlsx",
            "tasks_json\\task_27\\files\\17915_27_B.txt",
            "tasks_json\\task_27\\files\\17915_27_B.xlsx"
        ],
        "answer": "95200 233468\n163215 128141"
    },
    {
        "id": 17882,
        "difficulty": "Уровень: Базовый",
        "task": "Фрагмент звёздного неба спроецирован на плоскость с декартовой системой координат. Учёный решил провести кластеризацию полученных точек, являющихся изображениями звёзд, то есть разбить их множество на N непересекающихся непустых подмножеств (кластеров), таких что точки каждого подмножества лежат внутри прямоугольника со сторонами длиной H и W, причём эти прямоугольники между собой не пересекаются. Стороны прямоугольников не обязательно параллельны координатным осям.\nГарантируется, что такое разбиение существует и единственно для заданных размеров прямоугольников.\nБудем называть центром кластера точку этого кластера, сумма расстояний от которой до всех остальных точек кластера минимальна. Для каждого кластера гарантируется единственность его центра. Расстояние между двумя точками на плоскости\nA(x\n1\n,y\n1\n) и\nB(x\n2\n,y\n2\n) вычисляется по формуле:\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n\nВ файле A хранятся данные о звёздах двух кластеров, где H=3, W=3 для каждого кластера. В каждой строке записана информация о расположении на карте одной звезды: сначала координата x, затем координата y. Значения даны в условных единицах. Известно, что количество звёзд не превышает 1000.\nВ файле B хранятся данные о звёздах трёх кластеров, где H=3, W=3 для каждого кластера. Известно, что количество звёзд не превышает 10 000. Структура хранения информации о звездах в файле B аналогична файлу А. \nДля каждого файла определите координаты центра каждого кластера, затем вычислите два числа:\n P\nx\n– среднее арифметическое абсцисс центров кластеров, и\n P\ny\n– среднее арифметическое ординат центров кластеров.\nВ ответе запишите четыре числа: в первой строке сначала целую часть произведения\n P\nx\n×10000, затем целую часть произведения\n P\ny\n×10000 для файла А, во второй строке – аналогичные данные для файла B.\nВозможные данные одного из файлов иллюстрированы графиком. \nВнимание! График приведён в иллюстративных целях для произвольных значений, не имеющих отношения к заданию.\nДля выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\17882_base64.png"
        ],
        "files": [
            "tasks_json\\task_27\\files\\17882_27_A.txt",
            "tasks_json\\task_27\\files\\17882_27_A.xlsx",
            "tasks_json\\task_27\\files\\17882_27_B.txt",
            "tasks_json\\task_27\\files\\17882_27_B.xlsx"
        ],
        "answer": "10738 30730\n37522 51277"
    },
    {
        "id": 17834,
        "difficulty": "Уровень: Базовый",
        "task": "(Д. Бахтиев, Л. Шастин) Учёный решил провести кластеризацию некоторого множества звёзд по их расположению на карте звёздного неба. Кластер звёзд – это набор звёзд (точек) на  графике, лежащий внутри круга радиусом\nR. Каждая  звезда обязательно принадлежит  только одному  из кластеров. Истинный центр кластера, или центроид, – это одна из звёзд на графике, сумма расстояний от которой до всех остальных звёзд кластера минимальна. Под расстоянием понимается расстояние Евклида между двумя  точками\nA(x1,y1) и\nB(x2,y2) на плоскости, которое вычисляется по формуле:\nd(A,B)=\n(x\n2\n−x\n1\n)\n2\n+(y\n2\n−y\n1\n)\n2\n.\nВ файле A хранятся данные о звёздах двух кластеров, где\nR=4 для каждого кластера. В каждой строке записана информация о расположении на карте  одной  звезды:  сначала  координата \nx,  затем  координата \ny.  Значения даны в условных единицах, которые представлены вещественными числами. Известно, что количество звёзд не превышает 1000.  В файле Б хранятся данные о звёздах трёх кластеров, где\nR=3 для каждого кластера. Известно, что количество  звёзд  не превышает 10 000. Структура хранения информации о звездах в файле Б аналогична файлу А. \nДля каждого файла определите координаты центра каждого кластера, затем вычислите  два  числа: \nPx –  среднее арифметическое абсцисс центров кластеров, и\nPy – среднее арифметическое ординат центров кластеров. \nВ  ответе  запишите  четыре  числа:  в  первой  строке  сначала  целую  часть произведения\nPx×100, затем целую часть произведения\nPy×100 для файла А, во второй строке – аналогичные данные для файла Б.\nВозможные данные одного из файлов иллюстрированы графиком.  Внимание!  График  приведён  в иллюстративных  целях  для произвольных  значений,  не  имеющих  отношения  к  заданию. Для выполнения задания используйте данные из прилагаемого файла.",
        "images": [
            "tasks_json\\task_27\\images\\17834_base64.png"
        ],
        "files": [
            "tasks_json\\task_27\\files\\17834_27_A.txt",
            "tasks_json\\task_27\\files\\17834_27_B.txt",
            "tasks_json\\task_27\\files\\17834_27_A.xlsx",
            "tasks_json\\task_27\\files\\17834_27_B.xlsx"
        ],
        "answer": "597 432\n408 352"
    }
]